#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ОбрабатыватьАлгоритмы = Истина;
	Объект.ОбрабатыватьПКО = Истина;
	Объект.ОбрабатыватьПКПД = Истина;
	Объект.ОбрабатыватьПОД = Истина;
	Объект.ОбрабатыватьЗапросы = Истина;
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоставДанныхПриИзменении(Элемент)
	Если СоставДанных = 0 Тогда
		// Все
		Объект.ОбрабатыватьАлгоритмы = Истина;
		Объект.ОбрабатыватьПКО = Истина;
		Объект.ОбрабатыватьПКПД = Истина;
		Объект.ОбрабатыватьПОД = Истина;
		Объект.ОбрабатыватьЗапросы = Истина;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	КонвертацияПриИзмененииНаСервере(Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КопироватьСоставКонвертации(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	КопироватьСоставКонвертацииНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГруппаСоставВыборочно.Видимость = (СоставДанных <> 0);
	Если СоставДанных <> 0 Тогда
		Элементы.ОбрабатыватьЗапросы.Видимость = ПоказыватьЗапросы;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КопироватьСоставКонвертацииНаСервере()
	Если Объект.КонвертацияИсточник.ТипКонвертации <> Объект.КонвертацияПолучатель.ТипКонвертации Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Различаются типы выбранных конвертаций. Копирование состава не может быть выполнено.'"));
		Возврат;
	КонецЕсли;
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьСоставКонвертации();
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Копирование состава конвертаций завершено.'"));

КонецПроцедуры


&НаСервере
Процедура КонвертацияПриИзмененииНаСервере(ИмяРеквизитаКонвертация)
	ПоказыватьЗапросы = Ложь;
	Если ИмяРеквизитаКонвертация = "КонвертацияИсточник" Тогда
		ТекТипКонвертации = Объект.КонвертацияИсточник.ТипКонвертации;
	Иначе
		ТекТипКонвертации = Объект.КонвертацияПолучатель.ТипКонвертации;
	КонецЕсли;
	ПоказыватьЗапросы = (ТекТипКонвертации = Перечисления.ТипыКонвертаций.XML);
КонецПроцедуры


#КонецОбласти