#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МенюВыбораТипаКонвертации.Добавить(Перечисления.ТипыКонвертаций.XDTO, НСтр("ru='Создать конвертацию XDTO'"));
	МенюВыбораТипаКонвертации.Добавить(Перечисления.ТипыКонвертаций.XML, НСтр("ru='Создать конвертацию XML'"));
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Ложь;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Отбор.Использование = Ложь;
	ПоказыватьПомеченныеНаУдаление = Истина;
	ИзменитьОтборФормыСписка();
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Элементы.ФормаИзменитьОтображениеПомеченныхНаУдаление.Пометка = ПоказыватьПомеченныеНаУдаление;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Или Группа Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Родитель) Тогда
		ТекТипКонвертации = ОпределитьТипКонвертацииПоРодителю(Родитель);
		Если ТекТипКонвертации <> Неопределено Тогда
			Отказ = Истина;
			ПараметрыФормы = Новый Структура("ТипКонвертации, Родитель", ТекТипКонвертации, Родитель);
			ОткрытьФорму("Справочник.Конвертации.Форма.ФормаЭлемента", ПараметрыФормы);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Отказ = Истина;
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ВыбранТипКонвертации",ЭтотОбъект, Новый Структура("Родитель", Родитель)), МенюВыбораТипаКонвертации);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы 
&НаКлиенте
Процедура ИзменитьОтображениеПомеченныхНаУдаление(Команда)
	ПоказыватьПомеченныеНаУдаление = НЕ ПоказыватьПомеченныеНаУдаление;
	Элементы.ФормаИзменитьОтображениеПомеченныхНаУдаление.Пометка = ПоказыватьПомеченныеНаУдаление;
	ИзменитьОтборФормыСписка();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВыбранТипКонвертации(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ТипКонвертации", ВыбранныйЭлемент.Значение);
	Если ДополнительныеПараметры.Свойство("Родитель") Тогда
		ПараметрыФормы.Вставить("Родитель", ДополнительныеПараметры.Родитель);
	КонецЕсли;
	ОткрытьФорму("Справочник.Конвертации.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция ОпределитьТипКонвертацииПоРодителю(Родитель)
	Если Родитель.ПринадлежитЭлементу(Справочники.Конвертации.ФорматXDTO)
		Или Родитель = Справочники.Конвертации.ФорматXDTO Тогда
		Возврат Перечисления.ТипыКонвертаций.XDTO;
	ИначеЕсли Родитель.ПринадлежитЭлементу(Справочники.Конвертации.ФорматXML)
		Или Родитель = Справочники.Конвертации.ФорматXML Тогда
		Возврат Перечисления.ТипыКонвертаций.XML;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ИзменитьОтборФормыСписка()
	ОтборПоПометкеУдаления = Неопределено;
	Если Список.Отбор.Элементы.Количество() = 1 Тогда
		ОтборПоПометкеУдаления = Список.Отбор.Элементы[0];
	Иначе
		Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
			Если ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный
				И ЭлементОтбора.ПравоеЗначение = Ложь Тогда
				ОтборПоПометкеУдаления = ЭлементОтбора;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ОтборПоПометкеУдаления.Использование = НЕ ПоказыватьПомеченныеНаУдаление;
КонецПроцедуры
#КонецОбласти


