///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныйПрограммныйИнтерфейс
Функция ДоступныеВидыОбработчиков(ТипОбъекта) Экспорт
	Результат = Новый Массив;
	Если ТипОбъекта = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда
		Результат.Добавить(Перечисления.ВидыОбработчиков.ПриОбработке);
		Результат.Добавить(Перечисления.ВидыОбработчиков.ВыборкаДанных);
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		Результат.Добавить(Перечисления.ВидыОбработчиков.ПриОтправке);
		Результат.Добавить(Перечисления.ВидыОбработчиков.ПриКонвертацииДанныхXDTO);
		Результат.Добавить(Перечисления.ВидыОбработчиков.ПередЗаписьюПолученныхДанных);
	КонецЕсли; 
	Возврат Результат;
КонецФункции

Функция ПрочитатьКомментарийКОбработчику(Объект, ВидОбработчика) Экспорт
	Если ТипЗнч(ВидОбработчика) = Тип("Строка") Тогда
		ВидОбработчикаСсылка = ВидОбработчикаПоСтроке(ВидОбработчика);
	Иначе
		ВидОбработчикаСсылка = ВидОбработчика;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ВидОбработчикаСсылка) Тогда
		Возврат "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Комментарий 
	|ИЗ РегистрСведений.КомментарииКОбработчикам
	|ГДЕ Объект = &Объект И ВидОбработчика = &ВидОбработчика";
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ВидОбработчика", ВидОбработчикаСсылка);
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Комментарий;
	КонецЕсли;
	Возврат "";
КонецФункции

Процедура УстановитьКомментарийКОбработчику(Объект, ВидОбработчика, Комментарий) Экспорт 
	КомментарийНаборЗаписей = РегистрыСведений.КомментарииКОбработчикам.СоздатьНаборЗаписей();
	КомментарийНаборЗаписей.Отбор.Объект.Установить(Объект); 
	КомментарийНаборЗаписей.Отбор.ВидОбработчика.Установить(ВидОбработчика);
    НовЗапись = КомментарийНаборЗаписей.Добавить();
	НовЗапись.Объект = Объект;
	НовЗапись.ВидОбработчика = ВидОбработчика;
	НовЗапись.Комментарий = Комментарий;
	КомментарийНаборЗаписей.Записать();
КонецПроцедуры

Функция ВидОбработчикаПоСтроке(ВидОбработчика)
	Если ВидОбработчика = "ПриОтправкеДанных" Тогда
		Возврат Перечисления.ВидыОбработчиков.ПриОтправке;
	КонецЕсли;
	ВоврЗначение = "";
	Попытка
		ВоврЗначение = Перечисления.ВидыОбработчиков[СокрЛП(ВидОбработчика)];
	Исключение
	КонецПопытки;
	Возврат ВоврЗначение;
КонецФункции
#КонецОбласти
#КонецЕсли
