#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	// Заполнение списка конвертаций данного правила.
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
	Иначе
		Если ЗначениеЗаполнено(Параметры.Конвертация) Тогда
			СписокКонвертаций.Добавить(Параметры.Конвертация);
			Объект.ТипКонвертации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Конвертация, "ТипКонвертации");
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Возможно новый элемент копируется - тогда список конвертаций необходимо заполнить.
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Параметры.ЗначениеКопирования, СписокКонвертаций);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
			Объект.ГруппаПравил = Параметры.ГруппаПравил;
		КонецЕсли;
	КонецЕсли;
	ЭтоКонвертацияXDTO = (Объект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	Если ЭтоКонвертацияXDTO Тогда
		Для Каждого Конвертация Из СписокКонвертаций Цикл
			ИспользоватьРазделениеМодуля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация.Значение, "ИспользоватьРазделениеМодуля");
			Если ИспользоватьРазделениеМодуля Тогда
				ЗаполнитьПараметрыВыбораДополнительногоМодуля(Конвертация.Значение);
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		КонвертацияДанныхXDTOВызовСервера.ОпределитьИспользованиеТегов(СписокКонвертаций, ЕстьТеги, Элементы.ТегиТег);
	КонецЕсли;

	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Объект.Захвачен = Истина;
		ИначеЕсли Объект.Захвачен Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТолькоПросмотр Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если ОграничиватьДоступНаУровнеЗаписей Тогда
			КонвертацияДанныхXDTOСервер.ПроверитьДоступКОбъектуНаУровнеЗаписей(ЭтаФорма, СписокКонвертаций);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КонвертацияДанныхXDTOВызовСервера.ПроверитьВозможностьЗаписиАлгоритма(Отказ, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Для нового правила создать запись в регистре
	КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_Алгоритмы");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Закрыта форма вопроса о составе конвертаций с изменением состава
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		ОбработкаВыбораНаСервере();
		ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере()
	// Изменился состав конвертаций
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Объект.Захвачен, СовместнаяРабота);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СовместнаяРабота И ИмяСобытия = "ИзмененСтатусЗахвата" И Источник = Объект.Ссылка Тогда
		Прочитать();
		ОбработкаОповещенияНаСервере();
		КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Параметр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементВСоставКонвертации(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстПредупреждения = НСтр("ru = 'Сначала необходимо записать алгоритм'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбранаКонвертация", ЭтаФорма);
	ОткрытьФорму("Справочник.Конвертации.ФормаВыбора",, ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВыбранаКонвертация(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	ОтказДобавления = Ложь;
	ДополнитьСоставКонвертации(РезультатЗакрытия, Объект.Ссылка, ОтказДобавления);
	Если ОтказДобавления Тогда
		ТекстПредупреждения = НСтр("ru = 'Данный элемент уже входит в состав выбранной конвертации'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	Иначе
		Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, ОтказДобавления)
	// Проверка на дубли
	Если КонвертацияДанныхXDTOВызовСервера.ЭлементКонвертацииВходитВСоставКонвертации(Конвертация, ЭлементКонвертации) Тогда
		ОтказДобавления = Истина;
		Возврат;
	КонецЕсли;
	Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации);
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ИспользуетсяПриЗагрузке.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.Экспортный.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ЭтоФункция.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ГруппаКомментарий.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ДополнительныйМодуль.Видимость = ИспользоватьРазделениеМодуля;
	Элементы.ГруппаТеги.Видимость = ЭтоКонвертацияXDTO И ЕстьТеги; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыВыбораДополнительногоМодуля(КонвертацияОтбор)
	
	ПараметрВладелец = Новый ПараметрВыбора("Отбор.Владелец", КонвертацияОтбор); 
	ПараметрРаздел = Новый ПараметрВыбора("Отбор.Раздел", Перечисления.РазделыДополнительныхМодулей.Пользовательский);
	ПараметрыВыбораМодуля = Новый Массив;
	ПараметрыВыбораМодуля.Добавить(ПараметрВладелец);
	ПараметрыВыбораМодуля.Добавить(ПараметрРаздел);
	Элементы.ДополнительныйМодуль.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМодуля);
	
КонецПроцедуры

#КонецОбласти
