
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтоНовый() Тогда
		КонвертацияДанныхXDTOСервер.ПроверитьВозможностьИзмененияСтатуса(Ссылка, Статус, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// Зачистка лишних данных которые не используются для типа конвертации.
	Если ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
		АлгоритмПередКонвертацией = "";
		АлгоритмПослеКонвертации = "";
		АлгоритмПередОтложеннымЗаполнением = "";
		АлгоритмПередОбработкойУдаления = "";
		ВерсияФорматаМенеджера = "";
		ВерсииФормата.Очистить();
		Если НЕ ЗначениеЗаполнено(Родитель) Тогда
			Родитель = Справочники.Конвертации.ФорматXML;
		КонецЕсли;
	Иначе
		АлгоритмПередВыгрузкойДанных = "";
		АлгоритмПослеВыгрузкиДанных = "";
		АлгоритмПередЗагрузкойДанных = "";
		АлгоритмПослеЗагрузкиДанных = "";
		АлгоритмПередВыгрузкойОбъекта = "";
		АлгоритмПередКонвертациейОбъекта = "";
		АлгоритмПередЗагрузкойОбъекта = "";
		АлгоритмПослеЗагрузкиОбъекта = "";
		АлгоритмПослеЗагрузкиПравилОбмена = "";
		АлгоритмПередОтправкойИнформацииОбУдалении = "";
		АлгоритмПриПолученииИнформацииОбУдалении = "";
		АлгоритмПослеЗагрузкиПараметров = "";
		АлгоритмПередПолучениемИзмененныхОбъектов = "";
		АлгоритмПослеПолученияИнформацииОбУзлахОбмена = "";
		Для Каждого Строка Из Параметры Цикл
			Строка.УстанавливатьВДиалоге = Ложь;
			Строка.ИспользуетсяПриЗагрузке = Ложь;
			Строка.ПередаватьПараметрПриВыгрузке = Ложь;
			Строка.ТипОбъекта = Неопределено;
			Строка.ПравилоКонвертации = "";
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(Родитель) Тогда
			Родитель = Справочники.Конвертации.ФорматXDTO;
		КонецЕсли; 
	КонецЕсли;
	Если ВерсияФорматаМенеджера = "1" Тогда
		ИспользоватьРазделениеМодуля = Ложь; 
		ИспользоватьТипизациюПеременных = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	КонвертацияДанныхXDTOСервер.ОтразитьИзмененияСтатуса(Ссылка, Статус);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЭтоГруппа И ИспользоватьРазделениеМодуля Тогда
		ПроверяемыеРеквизиты.Добавить("ИмяФайлаДляСохранения");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
