#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Константы.СовместнаяРабота.Получить() = Ложь Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Действие = Параметры.Действие;
	Если Параметры.Свойство("КОбработке") Тогда
		Для Каждого ТекСсылка Из Параметры.КОбработке Цикл
			СсылкиНаОбъект.Добавить(ТекСсылка);
			ПредставлениеОбъектов = ПредставлениеОбъектов + СокрЛП(ТекСсылка) + "; ";
		КонецЦикла;
	ИначеЕсли Параметры.Свойство("СсылкаНаОбъект") Тогда
		СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
		СсылкиНаОбъект.Добавить(Параметры.СсылкаНаОбъект);
		ПредставлениеОбъектов = СокрЛП(Параметры.СсылкаНаОбъект);
	КонецЕсли;
	// Информация о возможном захвате.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Объект,
	|	Действие,
	|	Пользователь,
	|	Комментарий,
	|	Период
	|ИЗ (
	|ВЫБРАТЬ
	|	Объект КАК Объект,
	|	Действие,
	|	Пользователь,
	|	Комментарий,
	|	Период
	|ИЗ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект В (&СсылкиНаОбъект))
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	РабочаяКопия,
	|	Действие,
	|	Пользователь,
	|	Комментарий,
	|	Период
	|ИЗ РегистрСведений.СовместнаяРаботаСОбъектами
	|ГДЕ РабочаяКопия В (&СсылкиНаОбъект)
	|) КАК Свод
	|УПОРЯДОЧИТЬ ПО Объект, Период УБЫВ";
	Запрос.УстановитьПараметр("СсылкиНаОбъект", СсылкиНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Действие = 1 Тогда
		// Будет выполнен захват.
		Пока Выборка.Следующий() Цикл
			Если Выборка.Действие = Перечисления.ДействияПриСовместнойРаботе.Захват Тогда
				ТекстСообщения = НСтр("ru='Объект %1 уже захвачен пользователем %2 %3'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.Объект, Выборка.Пользователь, Выборка.Период);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Объект);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;

		Пользователь = Пользователи.ТекущийПользователь();
		Дата = ТекущаяДатаСеанса();
		Элементы.Комментарий.Доступность = Истина;
		Элементы.ФормаЗахватить.Видимость = Истина;
		Элементы.ФормаОтменитьЗахват.Видимость = Ложь;
		Элементы.ФормаСнятьЗахватСЗаписью.Видимость = Ложь;
		Заголовок = НСтр("ru='Захват объектов конвертации'");
	Иначе
		// Действие с захваченным объектом: просмотр параметров захвата или отмена захвата.
		// Всегда передается единичный объект.
		Если Выборка.Следующий() И Выборка.Действие = Перечисления.ДействияПриСовместнойРаботе.Захват Тогда
			Пользователь = Выборка.Пользователь;
			Комментарий = Выборка.Комментарий;
			Дата = Выборка.Период;
		Иначе
			ТекстСообщения = НСтр("ru='Данный объект не захвачен'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Объект);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если Действие <> 0 Тогда
			Если Пользователь <> Пользователи.ТекущийПользователь() Тогда
				ТекстСообщения = НСтр("ru='Данный объект захвачен пользователем %1. Только он может снять захват.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Пользователь);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СсылкаНаОбъект);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			// Снятие захвата.
			Заголовок = НСтр("ru='Снятие захвата объекта конвертации'");
			Элементы.Комментарий.Доступность = Истина;
			Элементы.ФормаЗахватить.Видимость = Ложь;
			Элементы.ФормаОтменитьЗахват.Видимость = Истина;
			Элементы.ФормаСнятьЗахватСЗаписью.Видимость = Истина;
		Иначе
			// Просмотр состояния.
			Элементы.Комментарий.Доступность = Ложь;
			Элементы.ФормаЗахватить.Видимость = Ложь;
			Элементы.ФормаОтменитьЗахват.Видимость = Ложь;
			Элементы.ФормаСнятьЗахватСЗаписью.Видимость = Ложь;
			Заголовок = НСтр("ru='Информация о захвате объекта конвертации'");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Захватить(Команда)
	ВыполненоУспешно = ЗахватитьОбъект();
	Если ВыполненоУспешно = Истина Тогда
		Если СсылкиНаОбъект.Количество() = 1 Тогда
			Оповестить("ИзмененСтатусЗахвата", Истина, СсылкиНаОбъект[0].Значение);
		Иначе
			Оповестить("ИзмененСтатусЗахвата");
		КонецЕсли;
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗахватИЗаписать(Команда)
	ВыполненоУспешно = ОтменитьЗахватСервер(Ложь);
	Если ВыполненоУспешно Тогда
		Оповестить("ИзмененСтатусЗахвата", Ложь, СсылкаНаОбъект);
		ОповеститьОбИзменении(СсылкаНаОбъект);
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗахват(Команда)
	ВыполненоУспешно = ОтменитьЗахватСервер(Истина);
	Если ВыполненоУспешно Тогда
		Оповестить("ИзмененСтатусЗахвата", Ложь, СсылкаНаОбъект);
		ОповеститьОбИзменении(СсылкаНаОбъект);
	КонецЕсли;
	Закрыть();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ЗахватитьОбъект()
	Отказ = Ложь;
	КонвертацияДанныхXDTOСервер.ЗахватитьОбъекты(СсылкиНаОбъект, Пользователь, Комментарий, Отказ);
	Возврат НЕ Отказ;
КонецФункции

&НаСервере
Функция ОтменитьЗахватСервер(ОткатитьИзменения)
	Если ОткатитьИзменения = Истина Тогда
		Операция = Перечисления.ДействияПриСовместнойРаботе.ОтменаЗахвата;
	Иначе
		Операция = Перечисления.ДействияПриСовместнойРаботе.ЗаписьОбъекта;
	КонецЕсли; 
	ВыполненоУспешно = Истина;
	КонвертацияДанныхXDTOСервер.СнятьЗахватСОбъекта(СсылкаНаОбъект, Операция, Комментарий, ВыполненоУспешно);
	Возврат ВыполненоУспешно;
КонецФункции



#КонецОбласти
