#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыФормы = Параметры;
	ВидЭлементаОтбора = "";
	ПараметрыФормы.Свойство("ВидЭлементаОтбора", ВидЭлементаОтбора);
	ТипЗначения = "";
	Если ПараметрыФормы.Свойство("ТипСвойстваОбъекта") Тогда
		ТипЗначения = ПараметрыФормы.ТипСвойстваОбъекта;
	КонецЕсли;
	Если ВидЭлементаОтбора = "" Тогда
		ВидЭлементаОтбора = "ЗначениеКонстанты";
	КонецЕсли;
	Если ПараметрыФормы.Свойство("ЗначениеКонстанты") Тогда
		Если ВидЭлементаОтбора = "АлгоритмЗначения" Тогда
			АлгоритмВычисленияКонстанты = ПараметрыФормы.ЗначениеКонстанты;
		Иначе
			ФиксированноеЗначениеКонстанты = ПараметрыФормы.ЗначениеКонстанты;
			Если НЕ ЗначениеЗаполнено(ФиксированноеЗначениеКонстанты) И ЗначениеЗаполнено(ТипЗначения) Тогда
				// Назначаем пустое значение конкретного типа.
				Если СтрНайти(ТипЗначения, "Булево") Тогда
					ФиксированноеЗначениеКонстанты = Ложь;
				ИначеЕсли СтрНайти(ТипЗначения, "Строка") Тогда
					ФиксированноеЗначениеКонстанты = "";
				ИначеЕсли СтрНайти(ТипЗначения, "Число") Тогда
					ФиксированноеЗначениеКонстанты = 0;
				ИначеЕсли СтрНайти(ТипЗначения, "Дата") Тогда
					ФиксированноеЗначениеКонстанты = Дата('00010101');
				Иначе
					// Фиксированное значение не может быть задано.
					ВидЭлементаОтбора = "АлгоритмЗначения";
					АлгоритмВычисленияКонстанты = ПараметрыФормы.ЗначениеКонстанты;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидЭлементаОтбораПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	Результат = Новый Структура("ВидЭлементаОтбора, ЗначениеКонстанты", ВидЭлементаОтбора);
	Если ВидЭлементаОтбора = "ЗначениеКонстанты" Тогда
		Результат.ЗначениеКонстанты = ФиксированноеЗначениеКонстанты;
	Иначе
		Результат.ЗначениеКонстанты = АлгоритмВычисленияКонстанты;
	КонецЕсли;
	Закрыть(Результат);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	Элементы.ФиксированноеЗначениеКонстанты.Доступность = Ложь;
	Элементы.АлгоритмВычисленияКонстанты.Доступность = Ложь;

	Если ВидЭлементаОтбора = "ЗначениеКонстанты" Тогда
		Элементы.ФиксированноеЗначениеКонстанты.Доступность = Истина;
	Иначе
		Элементы.АлгоритмВычисленияКонстанты.Доступность = Истина;
		Если НЕ ЗначениеЗаполнено(АлгоритмВычисленияКонстанты) Тогда
			АлгоритмВычисленияКонстанты = НСтр("ru='Значение'") + " = ;";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  



#КонецОбласти


