
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ИмяФайлаДляВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Фильтр", НСтр("ru = 'XML схема (*.xsd)'") + "|*.xsd" );
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Укажите файл для выгрузки структуры формата'"));
	НастройкиДиалога.Вставить("Режим", РежимДиалогаВыбораФайла.Сохранение);
	МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
	МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "ИмяФайлаДляВыгрузки", СтандартнаяОбработка, НастройкиДиалога);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Ожидание;
	ИзменитьДоступностьЭлементовФормы(Ложь);
	ПодключитьОбработчикОжидания("ЗапускОбработки", 5, Истина);
КонецПроцедуры 
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗапускОбработки()
	ВыполнитьВыгрузкуСервер();
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
КонецПроцедуры
&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если НЕ ДлительнаяОперация Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
		ИзменитьДоступностьЭлементовФормы(Истина);
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеВыгрузкиФормата", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеВыгрузкиФормата()
	РезультатВыгрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	ФлагОшибки = Истина;
	Если ТипЗнч(РезультатВыгрузки) = Тип("Структура") И РезультатВыгрузки.Свойство("ФлагОшибки") Тогда
		ФлагОшибки = РезультатВыгрузки.ФлагОшибки;
		Если НЕ ФлагОшибки Тогда
			ДвоичныеДанныеФормата = РезультатВыгрузки.РезультатВыгрузки;
			ДвоичныеДанныеФормата.Записать(Объект.ИмяФайлаДляВыгрузки);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ФлагОшибки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выгрузка структуры формата выполнена успешно'"));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выгрузка структуры формата не выполнена'"));
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементовФормы(ФлагДоступность)
	Элементы.ФормаВыполнитьВыгрузку.Доступность = ФлагДоступность;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуСервер()
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = "";
	ДлительнаяОперация = Ложь;
	СтруктураПараметров = Новый Структура("ИмяФайлаДляВыгрузки, ВерсияФормата", Объект.ИмяФайлаДляВыгрузки, Объект.ВерсияФормата);
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Выгрузка структуры формата'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ВыгрузкаСтруктурыФормата.ВыполнитьВыгрузку",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При выгрузке структуры формата произошла ошибка'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки
КонецПроцедуры

#КонецОбласти