#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущийЭтап = "ВыборРегистрации";
	// Чтобы отличать не установленное значение от установленного.
	Объект.ИсточникЗагрузки = -1;

	ЗаполнитьТаблицуЭтаповНастройки();
	ОбновитьОтображениеТекущегоСостоянияНастройки();
КонецПроцедуры
#КонецОбласти 
#Область ОбработчикиКомандФормы 
&НаКлиенте
Процедура ВыбратьРегистрациюДляЗагрузки(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьРегистрациюДляЗагрузкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗагрузкаРегистрации.Форма.ФормаВыборРегистрации",
			, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
&НаКлиенте
Процедура НастроитьИсточникЗагрузки(Команда)
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастроитьИсточникЗагрузкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗагрузкаРегистрации.Форма.ФормаПараметрыЗагрузки",
			, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
&НаКлиенте
Процедура ЗагрузитьПравилаРегистрации(Команда)
	Если (ТекущийЭтап <> "Загрузка" И ТекущийЭтап <> "Ошибки") Или ДлительнаяОперация = Истина Тогда
		Возврат;
	КонецЕсли; 
	ДлительнаяОперация = Истина;
	ОбновитьОтображениеТекущегоСостоянияНастройки();
	Ошибки = "";
	ЕстьОшибки = Ложь;  
	
	ПодготовитьФайлыДляЗагрузкиНачало();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкиЗагрузки(Команда)
	Если НЕ ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЗагрузкаРегистрации.Форма.ФормаОшибки",
			, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти
#Область ИнициализацияФормыПриСоздании 

&НаКлиенте
Функция ДобавитьЭтапНастройки(Название, Кнопка, ЭлементыФормы)
	
	СтрокаЭтап = Этапы.Добавить();
	СтрокаЭтап.Название        = Название;
	СтрокаЭтап.Кнопка          = Кнопка;
	СтрокаЭтап.Используется    = Истина;
	СтрокаЭтап.Недоступен      = Ложь;
	СтрокаЭтап.Основное        = Истина;
	
	ЗаполнитьЗначенияСвойств(СтрокаЭтап, ЭлементыФормы);
	
	Возврат СтрокаЭтап;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуЭтаповНастройки()
	
	Этапы.Очистить();

	// Выбор регистрации
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаВыборРегистрации.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельВыборРегистрации.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаВыборРегистрацииУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаВыборРегистрацииТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаВыборРегистрацииПустой.Имя); 
	ЭлементыФормы.Вставить("СтраницаДлительнаяОперация"	, "");
    ДобавитьЭтапНастройки("ВыборРегистрации", "ВыбратьРегистрациюДляЗагрузки", ЭлементыФормы);

	// Настройка источника	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаВыборИсточникаЗагрузки.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельВыборИсточникаЗагрузки.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаВыборИсточникаЗагрузкиУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаВыборИсточникаЗагрузкиТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаВыборИсточникаЗагрузкиПустой.Имя);
	ЭлементыФормы.Вставить("СтраницаДлительнаяОперация"	, "");
	ДобавитьЭтапНастройки("ВыборИсточникаЗагрузки", "НастроитьИсточникЗагрузки", ЭлементыФормы);
		
	// Загрузка	
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаЗагрузкаПравил.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельЗагрузкаПравил.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаЗагрузкаПравилУспешно.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаЗагрузкаПравилТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаЗагрузкаПравилПустой.Имя);
	ЭлементыФормы.Вставить("СтраницаДлительнаяОперация"	, Элементы.СтраницаЗагрузкаПравилДлительнаяОперация.Имя);
	
	ДобавитьЭтапНастройки("Загрузка", "ЗагрузитьПравилаРегистрации", ЭлементыФормы); 
	
	// Ошибки
	ЭлементыФормы = Новый Структура;
	ЭлементыФормы.Вставить("Группа"			, Элементы.ГруппаОшибкиЗагрузки.Имя);
	ЭлементыФормы.Вставить("Панель"			, Элементы.ПанельОшибкиЗагрузки.Имя);
	ЭлементыФормы.Вставить("СтраницаУспешно", Элементы.СтраницаОшибкиЗагрузкиПустой.Имя);
	ЭлементыФормы.Вставить("СтраницаТекущий", Элементы.СтраницаОшибкиЗагрузкиТекущий.Имя);
	ЭлементыФормы.Вставить("СтраницаПустой"	, Элементы.СтраницаОшибкиЗагрузкиПустой.Имя);
	
	ДобавитьЭтапНастройки("Ошибки", "ПоказатьОшибкиЗагрузки", ЭлементыФормы); 
		
КонецПроцедуры

#КонецОбласти 
#Область СлужебныеПроцедурыИФункции
 &НаКлиенте
 Процедура ОбновитьОтображениеТекущегоСостоянияНастройки() 
	Элементы.ГруппаРезультатЗагрузки.Видимость = Ложь;
	// Видимость элементов настройки.
	Для Каждого ЭтапНастройки Из Этапы Цикл 		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ЭтапНастройки.Группа, "Доступность", ЭтапНастройки.Используется И НЕ ЭтапНастройки.Недоступен);
		Если НЕ ЭтапНастройки.Используется Тогда
			Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаПустой];
		ИначеЕсли ПустаяСтрока(ТекущийЭтап) Тогда
			Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаУспешно];
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(ТекущийЭтап) Тогда
		Если Объект.СоздатьНовуюРегистрацию Тогда
			// Если загружена новая регистрация и новая конфигурация это надо отобразить.
			Элементы.ЗагрузитьПравилаРегистрации.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
			Элементы.ГруппаРезультатЗагрузки.Видимость = Истина;
		КонецЕсли;
	Иначе
		ТекущийЭтапНайден = Ложь;
		Для Каждого ЭтапНастройки Из Этапы Цикл
			Если НЕ ЭтапНастройки.Используется Тогда
				Продолжить;
			КонецЕсли;
			Если ЭтапНастройки.Название = ТекущийЭтап Тогда
				Элементы[ЭтапНастройки.Группа].Доступность = Истина; 
				Если ДлительнаяОперация И ЗначениеЗаполнено(ЭтапНастройки.СтраницаДлительнаяОперация) Тогда
					Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаДлительнаяОперация]; 
				Иначе
					Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаТекущий];  
				КонецЕсли;
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииВажнаяШрифт");
				ТекущийЭтапНайден = Истина;
			ИначеЕсли Не ТекущийЭтапНайден Тогда
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаУспешно];
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииОбычнаяШрифт");
			Иначе
				Элементы[ЭтапНастройки.Панель].ТекущаяСтраница = Элементы[ЭтапНастройки.СтраницаПустой];
				Элементы[ЭтапНастройки.Кнопка].Шрифт = ОбщегоНазначенияКлиент.ШрифтСтиля("КомандаПомощникаНастройкиСинхронизацииОбычнаяШрифт");
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРегистрациюДляЗагрузкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, РезультатЗакрытия, "Регистрация, Конфигурация, СоздатьНовуюРегистрацию, СоздатьНовуюКонфигурацию, ОбновлятьМетаданные");
		ИмяНовойРегистрации = РезультатЗакрытия.ИмяНовойРегистрации;
		ИмяНовойКонфигурации = РезультатЗакрытия.ИмяНовойКонфигурации;  

		ЭтаФорма.ОбновитьОтображениеДанных();
		Элементы.ВыбратьРегистрациюДляЗагрузки.РасширеннаяПодсказка.Заголовок = РезультатЗакрытия.ОписаниеРезультата;
		ТекущийЭтап = "ВыборИсточникаЗагрузки"; 
		// Сбросим выбранные ранее настройки если они были сделаны.
		Объект.РасположениеФайловНаКлиенте = "";
		Объект.ИсточникЗагрузки = -1;
		ОбновитьОтображениеТекущегоСостоянияНастройки();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура НастроитьИсточникЗагрузкиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, РезультатЗакрытия, "ИсточникЗагрузки, РасположениеФайловНаКлиенте, ИмяМенеджераРегистрации");

		ЭтаФорма.ОбновитьОтображениеДанных();
		Элементы.НастроитьИсточникЗагрузки.РасширеннаяПодсказка.Заголовок = РезультатЗакрытия.ОписаниеРезультата; 
        ПравилаЗагружены = Ложь;
		ТекущийЭтап = "Загрузка";
		ОбновитьОтображениеТекущегоСостоянияНастройки();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПодготовитьФайлыДляЗагрузкиНачало() 
	ФайлыДляОбработкиСервер.Очистить();
	Если Объект.ИсточникЗагрузки < 2 Тогда
		// Загрузка в существующую регистрацию из текстового файла или файла xml.
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПроверкиСуществованияФайла", ЭтотОбъект,
			Новый Структура("ТекстСообщенияОбОшибке", ?(Объект.ИсточникЗагрузки = 1, НСтр("ru='Не найден текстовый файл с модулем менеджера'"),
			НСтр("ru='Не найден файл с правилами регистрации'"))));
		НачатьПоискФайлов(ОповещениеРезультатПоиска, Объект.РасположениеФайловНаКлиенте,,Ложь);
		Возврат;
	КонецЕсли;
	Если Объект.ИсточникЗагрузки = 3 Тогда 
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПроверкиСуществованияФайла", ЭтотОбъект, 
			Новый Структура("ТекстСообщенияОбОшибке", НСтр("ru='В каталоге не найден файл Configuration.xml'")));
		НачатьПоискФайлов(ОповещениеРезультатПоиска, Объект.РасположениеФайловНаКлиенте,"Configuration.xml",Ложь);
	Иначе
		// Файл project уже указан искать его не надо.
		// Для поиска файлов используется каталог в котором находится project
		ФайлПроекта = Новый Файл(Объект.РасположениеФайловНаКлиенте);
		ИтерацияПодготовкиФайлов(ФайлПроекта.Путь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПроверкиСуществованияФайла(НайденныеФайлы, ДополнительныеПараметры) Экспорт 
	Если НайденныеФайлы.Количество() = 0 Тогда
		ЕстьОшибки = Истина;
		Ошибки = Ошибки + ДополнительныеПараметры.ТекстСообщенияОбОшибке + Символы.ПС;
		ДлительнаяОперация = Ложь; 
		ТекущийЭтап = "Ошибки"; 
		ОбновитьОтображениеТекущегоСостоянияНастройки();
		Возврат;
	КонецЕсли;
	Если Объект.ИсточникЗагрузки < 2 Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(Объект.РасположениеФайловНаКлиенте);
		#Если НЕ ВебКлиент Тогда 
		Если Объект.ИсточникЗагрузки = 1 Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
		Иначе
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		КонецЕсли;
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
		ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение", ИмяВременногоФайла, АдресХранилища));
		ЗапуститьДлительнуюОперацию_ЗагрузкаПравил();
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(НайденныеФайлы[0].ПолноеИмя), УникальныйИдентификатор);
	ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение", НайденныеФайлы[0].ПолноеИмя, АдресХранилища));
	ИтерацияПодготовкиФайлов(Объект.РасположениеФайловНаКлиенте);
КонецПроцедуры

&НаКлиенте
Процедура ИтерацияПодготовкиФайлов(КаталогЗагрузки)
	КаталогиДляОбработки = Новый Массив;
	КаталогиДляОбработки.Добавить("CommonModules");
	Если Объект.СоздатьНовуюКонфигурацию Тогда
		КаталогиДляОбработки.Добавить("Catalogs");
		КаталогиДляОбработки.Добавить("Documents");
		КаталогиДляОбработки.Добавить("Enums");
		КаталогиДляОбработки.Добавить("Tasks");
		КаталогиДляОбработки.Добавить("BusinessProcesses");
		КаталогиДляОбработки.Добавить("ChartsOfAccounts");
		КаталогиДляОбработки.Добавить("ChartsOfCalculationTypes");
		КаталогиДляОбработки.Добавить("ChartsOfCharacteristicTypes");
		КаталогиДляОбработки.Добавить("AccountingRegisters");
		КаталогиДляОбработки.Добавить("AccumulationRegisters");
		КаталогиДляОбработки.Добавить("CalculationRegisters");
		КаталогиДляОбработки.Добавить("InformationRegisters");
		КаталогиДляОбработки.Добавить("ExchangePlans");
		КаталогиДляОбработки.Добавить("EventSubscriptions");
		КаталогиДляОбработки.Добавить("Constants");
		КаталогиДляОбработки.Добавить("DefinedTypes");
		Если Объект.ИсточникЗагрузки = 2 Тогда
			КаталогиДляОбработки.Добавить("Configuration");
		КонецЕсли;

	КонецЕсли;
	КоличествоКаталоговВОбработке = КаталогиДляОбработки.Количество();
	
	Если Объект.СоздатьНовуюКонфигурацию Тогда
		КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке + 1;
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
		Если Объект.ИсточникЗагрузки = 3 Тогда
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + "/Constants","*.xml",Ложь);
		Иначе
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + "/Constants","*.mdo",Истина);
		КонецЕсли;
	КонецЕсли;
	Для Каждого ИмяКаталога Из КаталогиДляОбработки Цикл
		Если Объект.ИсточникЗагрузки = 3 Тогда
			КаталогПоиска = КаталогЗагрузки + "/" + ИмяКаталога;
		Иначе
			КаталогПоиска = КаталогЗагрузки + "/src/" + ИмяКаталога;
		КонецЕсли;
		Если ИмяКаталога = "CommonModules" Тогда
			ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"*.bsl",Истина);
		Иначе
			Если Объект.ИсточникЗагрузки = 3 Тогда
				ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
				НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"*.xml", Ложь);
				Если ИмяКаталога = "ExchangePlans" Тогда
					// Файлы с составом плана обмена.  
					КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке + 1;
					ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
					НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"Content.xml",Истина);
				Иначе
					// Файлы с предопределенными элементами.
					КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке + 1;
					ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
					НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"Predefined.xml",Истина);
				КонецЕсли;
			Иначе
				ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект);
				НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогПоиска,"*.mdo", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПоискаФайловВКаталоге(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке - 1;
	Если НайденныеФайлы.Количество() > 0 Тогда
		ОбработатьМассивФайлов(НайденныеФайлы);
	КонецЕсли;
	Если КоличествоКаталоговВОбработке > 0 Тогда
		Возврат;
	КонецЕсли;
	Если Объект.СоздатьНовуюКонфигурацию Или Объект.ОбновлятьМетаданные Тогда
		// Загрузка метаданных.
		ЗагружаютсяМетаданные = Истина;
		ЗапуститьДлительнуюОперацию_ЗагрузкаМетаданных();
	Иначе
		ЗапуститьДлительнуюОперацию_ЗагрузкаПравил();
	КонецЕсли;
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьМассивФайлов(ВложенныеФайлы)
	Если ВложенныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ВложенныйФайл Из ВложенныеФайлы Цикл
		Если ВложенныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВложенныйФайл.ПолноеИмя), УникальныйИдентификатор);
		ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение", ВложенныйФайл.ПолноеИмя, АдресХранилища));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗапуститьДлительнуюОперацию_ЗагрузкаМетаданных()
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = "";
		
	// Преобразование помещенных файлов
	ПомещенныеФайлыДляПередачи = ПоместитьФайлыДляПередачи();
	СтруктураПараметров = Новый Структура("ПомещенныеФайлы", ПомещенныеФайлыДляПередачи);
	Если Объект.СоздатьНовуюКонфигурацию Тогда
		СтруктураПараметров.Вставить("Конфигурация", Справочники.Релизы.ПустаяСсылка());
		СтруктураПараметров.Вставить("СпособЗагрузки", 0);
		СтруктураПараметров.Вставить("ИмяНовойКонфигурации", ИмяНовойКонфигурации);
	Иначе
		СтруктураПараметров.Вставить("Конфигурация", Объект.Конфигурация);
		СтруктураПараметров.Вставить("СпособЗагрузки", 1);
	КонецЕсли;
	// В интерфейсе обработки загрузки загрузка из файлов xml = 0, из файлов edt = 1
	СтруктураПараметров.Вставить("ИсточникДанных", ?(Объект.ИсточникЗагрузки = 3, 0, 1)); 
	// По умолчанию - только для документов без проведения
	СтруктураПараметров.Вставить("ВариантЗагрузкиДвижений", 1);  
	СтруктураПараметров.Вставить("ТолькоОбновитьПланыОбмена", Ложь);
	СтруктураПараметров.Вставить("ТолькоДобавлятьНовые", Ложь);
	СтруктураПараметров.Вставить("ЕстьРасширения", Ложь);
	СтруктураПараметров.Вставить("ИмяКаталогаЗагрузки", Объект.РасположениеФайловНаКлиенте);
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка структуры метаданных из каталога'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаСтруктурыКонфигурацииИзФайловXML.ВыполнитьЗагрузкуМетаданных",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		Ошибки = Ошибки + НСтр("ru = 'При загрузке структуры конфигурации произошла ошибка'") + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		ЕстьОшибки = Истина;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеЗагрузки", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеЗагрузки() 
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата); 
	РезультатЗагрузкиУспешно = Ложь;
	РезультатЗагрузкиОшибки = "";
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		РезультатЗагрузкиУспешно = РезультатЗагрузки.Успешно;
		РезультатЗагрузкиОшибки = РезультатЗагрузки.Ошибки;
	КонецЕсли;
	Если ЗагружаютсяМетаданные Тогда
		Если РезультатЗагрузкиУспешно Тогда
			Если Объект.СоздатьНовуюКонфигурацию Тогда
				Объект.Конфигурация = РезультатЗагрузки.Релиз; 
			КонецЕсли;
			ЗапуститьДлительнуюОперацию_ЗагрузкаПравил();
			ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина);
		Иначе
			ДлительнаяОперация = Ложь;
			Ошибки = Ошибки + НСтр("ru = 'При загрузке структуры конфигурации произошли ошибки'") + Символы.ПС + РезультатЗагрузкиОшибки;
			ЕстьОшибки = Истина;
		КонецЕсли;
	Иначе
		ДлительнаяОперация = Ложь;
		Если НЕ РезультатЗагрузкиУспешно Тогда
			Ошибки = Ошибки + НСтр("ru = 'При загрузке правил регистрации произошли ошибки'") + Символы.ПС + РезультатЗагрузкиОшибки;
			ЕстьОшибки = Истина;  
		ИначеЕсли ТекущийЭтап = "Загрузка" Тогда
			ТекущийЭтап = "";
			Если Объект.СоздатьНовуюРегистрацию И РезультатЗагрузки.Свойство("Регистрация") Тогда
				Объект.Регистрация = РезультатЗагрузки.Регистрация;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	Этап1 = Этапы.НайтиСтроки(Новый Структура("Название", "Ошибки"));
	Этап1[0].Недоступен = НЕ ЕстьОшибки;
	Если ЕстьОшибки Тогда
		ТекущийЭтап = "Ошибки"; 
	КонецЕсли; 	
	ОбновитьОтображениеТекущегоСостоянияНастройки();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьДлительнуюОперацию_ЗагрузкаПравил() 
	ЗагружаютсяМетаданные = Ложь;
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = ""; 
	// Преобразование помещенных файлов
	ПомещенныеФайлыДляПередачи = ПоместитьФайлыДляПередачи();
	
	СтруктураПараметров = Новый Структура("ИсточникЗагрузки, ПомещенныеФайлы, ИмяМенеджераРегистрации", Объект.ИсточникЗагрузки, ПомещенныеФайлыДляПередачи, Объект.ИмяМенеджераРегистрации); 
	СтруктураПараметров.Вставить("Регистрация", Объект.Регистрация);
	СтруктураПараметров.Вставить("СоздатьНовуюРегистрацию", Объект.СоздатьНовуюРегистрацию); 
	СтруктураПараметров.Вставить("ИмяНовойРегистрации", ИмяНовойРегистрации);
    СтруктураПараметров.Вставить("Конфигурация", Объект.Конфигурация);
	ПроцедураФоновогоЗадания = "Обработки.ЗагрузкаРегистрации.ВыполнитьЗагрузкуРегистрации"; 
	НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка регистрации из модуля'");
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне(ПроцедураФоновогоЗадания,
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		ТекОшибка = НСтр("ru = 'При запуске задания %1 произошла ошибка'");
		ТекОшибка = СтрЗаменить(ТекОшибка, "%1", НаименованиеФоновогоЗадания);
		Ошибки = Ошибки + ТекОшибка + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		ЕстьОшибки = Истина;
	КонецПопытки;

КонецПроцедуры


&НаСервере
Функция ПоместитьФайлыДляПередачи()
	ПомещенныеФайлыДляПередачи = Новый Массив;
	ИмяВременногоКаталогаФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СокрЛП(КаталогВременныхФайлов()) + "_conf_" + Строка(Новый  УникальныйИдентификатор));
	СоздатьКаталог(ИмяВременногоКаталогаФайлов);
	Для Каждого ПомФайл Из ФайлыДляОбработкиСервер Цикл
		ИмяФайлаСведений = ИмяВременногоКаталогаФайлов + Строка(Новый  УникальныйИдентификатор);
		Если СтрНайти(ПомФайл.Значение.ПолноеИмя, ".xml") > 0 Тогда
			ИмяФайлаСведений = ИмяФайлаСведений + ".xml";
		ИначеЕсли СтрНайти(ПомФайл.Значение.ПолноеИмя, ".bsl") > 0 Тогда
			ИмяФайлаСведений = ИмяФайлаСведений + ".bsl";
		ИначеЕсли СтрНайти(ПомФайл.Значение.ПолноеИмя, ".mdo") > 0 Тогда
			ИмяФайлаСведений = ИмяФайлаСведений + ".mdo";
		КонецЕсли;
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПомФайл.Значение.Хранение);
		ДвоичныеДанные.Записать(ИмяФайлаСведений);
	
		ПараметрыФайла = Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение");
		ЗаполнитьЗначенияСвойств(ПараметрыФайла, ПомФайл.Значение); 
		ПараметрыФайла.ЭтоРасширение = Ложь;
		ПараметрыФайла.Хранение = ИмяФайлаСведений;
		ПомещенныеФайлыДляПередачи.Добавить(ПараметрыФайла);
	КонецЦикла;
	Возврат ПомещенныеФайлыДляПередачи;
КонецФункции


#КонецОбласти

