#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	
	Если ТипЗнч(ЭлементДанных) = Тип("КонстантаМенеджерЗначения.НастройкиПодчиненногоУзлаРИБ")
		Или ТипЗнч(ЭлементДанных) = Тип("КонстантаМенеджерЗначения.ГлавныйУзел") Тогда
		
		Если ДляПубликации Тогда
			ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если РежимВыгрузкиПриНеобходимости <> Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости Тогда
		РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли