#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("парКонвертация") Тогда
		Объект.Конвертация = Параметры.парКонвертация;
	КонецЕсли;
	ЭтоКонвертацияXDTO = Истина;
	Если ЗначениеЗаполнено(Объект.Конвертация) Тогда
		РеквизитыКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Конвертация, "Наименование, ТипКонвертации");
		НаименованиеКонвертации = РеквизитыКонвертации.Наименование;
		ЭтоКонвертацияXDTO = (РеквизитыКонвертации.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	КонецЕсли;
	Если ЭтоКонвертацияXDTO Тогда
		Если ВерсияФорматаМенеджера = "1" Тогда
			Элементы.ФормаСохранитьМодуль.Видимость = Истина;
			Элементы.ПодменюСохранитьМодуль.Видимость = Ложь;
		Иначе
			СовместнаяРабота = Константы.СовместнаяРабота.Получить();
			Элементы.ФормаСохранитьМодуль.Видимость = НЕ СовместнаяРабота;
			Элементы.ПодменюСохранитьМодуль.Видимость = СовместнаяРабота;
		КонецЕсли;
	Иначе
		Элементы.ФормаСохранитьМодуль.Видимость = Ложь;
		Элементы.ПодменюСохранитьМодуль.Видимость = Ложь;
	КонецЕсли;
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	РазделениеМодуля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ИспользоватьРазделениеМодуля");

	Заголовок = НаименованиеКонвертации;
	ВерсияФорматаМенеджера = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ВерсияФорматаМенеджера"));
	ЗаполнитьДеревоГруппПравил();
	
	ОбновитьПараметрыСписков();
	ОбновитьПараметрыСписков_ГруппыПравил(); 
	ОбновитьТекстКнопкиВыгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ПКО;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагрузкаАлгоритмов" Тогда
		Если Параметр.Отказ = Ложь 
			И Параметр.ИдентификаторФормы = УникальныйИдентификатор Тогда
			ЗагрузкаОбработчиковНаСервере();
			ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина); 
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененСтатусЗахвата" Тогда
		Если ТипЗнч(ЭтаФорма.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			ЭтаФорма.ТекущийЭлемент.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	
	ЗаполнитьДеревоГруппПравил();
	ОбновитьПараметрыСписков();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ИмяТекущейСтраницы = Элементы.Страницы.ТекущаяСтраница.Имя;
	ИмяОбработчика = "";
	Если ИмяТекущейСтраницы = "ПОД" Тогда
		ИмяОбработчика = "ГруппыПравилПОДПриАктивизацииСтрокиОбработчикОжидания";
	ИначеЕсли ИмяТекущейСтраницы = "ПКО" Тогда
		ИмяОбработчика = "ГруппыПравилПКОПриАктивизацииСтрокиОбработчикОжидания";
	ИначеЕсли ИмяТекущейСтраницы = "ПКПД" Тогда
		ИмяОбработчика = "ГруппыПравилПКПДПриАктивизацииСтрокиОбработчикОжидания";
	ИначеЕсли ИмяТекущейСтраницы = "ГруппаАлгоритмы" Тогда
		ИмяОбработчика = "ГруппыПравилАлгоритмыПриАктивизацииСтрокиОбработчикОжидания";
	ИначеЕсли ИмяТекущейСтраницы = "ГруппаЗапросы" Тогда
		ИмяОбработчика = "ГруппыПравилЗапросыПриАктивизацииСтрокиОбработчикОжидания";  
	КонецЕсли;
	Если НЕ ПустаяСтрока(ИмяОбработчика) Тогда
		ПодключитьОбработчикОжидания(ИмяОбработчика, 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПравилаКонвертацииПредопределенныхДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОткрытьФормуСправочника("ПравилаКонвертацииПредопределенныхДанных", Отказ, Копирование, Группа);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаКонвертацииОбъектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОткрытьФормуСправочника("ПравилаКонвертацииОбъектов", Отказ, Копирование, Группа);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаОбработкиДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОткрытьФормуСправочника("ПравилаОбработкиДанных", Отказ, Копирование, Группа);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравилПКОПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ГруппыПравилПКОПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравил_ПОДПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ГруппыПравилПОДПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравил_ПКПДПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ГруппыПравилПКПДПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравил_АлгоритмыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ГруппыПравилАлгоритмыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравил_ЗапросыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ГруппыПравилЗапросыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОткрытьФормуСправочника("Алгоритмы", Отказ, Копирование, Группа);
	
КонецПроцедуры
&НаКлиенте
Процедура ЗапросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОткрытьФормуСправочника("Запросы", Отказ, Копирование, Группа);
КонецПроцедуры

&НаКлиенте
Процедура ПравилаКонвертацииПредопределенныхДанныхПередНачаломИзменения(Элемент, Отказ)
	ТекущийЭлементСпр = Элементы.ПравилаКонвертацииПредопределенныхДанных.ТекущаяСтрока;
	ОткрытьФормуСправочника("ПравилаКонвертацииПредопределенныхДанных", Отказ, Ложь,Ложь, ТекущийЭлементСпр);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравилОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Перетаскивание_Где = Элемент.Имя;
	Перетаскивание_Что = ПараметрыПеретаскивания.Значение[0].НаименованиеПоиска;

	ПодключитьОбработчикОжидания("ГруппыПравилПеретаскиваниеОбработчикОжидания", 0.1, Истина);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьМодуль(Команда)
	ВыгрузитьМодулиКлиент(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьМодуль_Хранилище(Команда)
	ВыгрузитьМодулиКлиент(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКонвертацию(Команда)
	
	ПараметрыФормы = Новый Структура("Ключ", Объект.Конвертация);
	ОткрытьФорму("Справочник.Конвертации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаОбработчиковНаСервере()
	ИмяФайлаСведений = ПолучитьИмяВременногоФайла("txt");
	ТХДок = Новый ТекстовыйДокумент();
	ТХДок.ДобавитьСтроку(ДанныеБуфера);
	ТХДок.Записать(ИмяФайлаСведений);

	ПомещенныеФайлыДляПередачи = Новый Массив;
	ПараметрыФайла = Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение", "", ИмяФайлаСведений, Ложь);
	ПомещенныеФайлыДляПередачи.Добавить(ПараметрыФайла);

	
	СтруктураПараметров = Новый Структура("ИсточникЗагрузки, ПомещенныеФайлы", 0, ПомещенныеФайлыДляПередачи); 
	СтруктураПараметров.Вставить("Конвертация", Объект.Конвертация);
	СтруктураПараметров.Вставить("СоздатьНовуюКонвертацию", Ложь); 
	СтруктураПараметров.Вставить("ИмяНовойКонвертации", "");
    СтруктураПараметров.Вставить("Конфигурация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "Конфигурация"));
	СтруктураПараметров.Вставить("ТолькоОбработчики", Истина); 
	СтруктураПараметров.Вставить("ИтерацияЗагрузки", 1); 
	
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка обработчиков'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаМодуляМенеджера.ВыполнитьЗагрузкуМодуляМенеджера",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		Ошибки = Ошибки + НСтр("ru = 'При загрузке модуля менеджера произошла ошибка'") + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		ЕстьОшибки = Истина;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаОбработчиков(Команда)
	Если РазделениеМодуля Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка из буфера обмена невозможна для конвертации с разделением модуля.'")); 
		Возврат;
	КонецЕсли;
	КОбъект = Новый COMОбъект("htmlfile");
	ДанныеБуфера = КОбъект.ParentWindow.ClipboardData.Getdata("Text");
	// Результат проверки будет в обработке оповещения.
	КонвертацияДанныхXDTOКлиент.ПроверитьКонвертациюПриЗагрузкеАлгоритмов(ДанныеБуфера, Объект.Конвертация, 
									НаименованиеКонвертации, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ИмяСписка = "";
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ПОД Тогда
		ИмяСписка = "ПравилаОбработкиДанных";
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ПКО Тогда
		ИмяСписка = "ПравилаКонвертацииОбъектов";
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ПКПД Тогда
		ИмяСписка = "ПравилаКонвертацииПредопределенныхДанных";
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаАлгоритмы Тогда
		ИмяСписка = "Алгоритмы";
	Иначе
		Возврат;
	КонецЕсли;
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы[ИмяСписка]);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаКонвертацииXML(Команда)
	ОткрытьФорму("Обработка.ВыгрузкаКонвертацииXML.Форма", Новый Структура("Конвертация", Объект.Конвертация));
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонвертацию(Команда)
	ОткрытьФорму("Обработка.ПроверкаКонвертации.Форма", Новый Структура("Конвертация", Объект.Конвертация));
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоГруппПравил()
	
	ГруппыПравил_ПКО.ПолучитьЭлементы().Очистить();
	ГруппыПравил_ПОД.ПолучитьЭлементы().Очистить();
	ГруппыПравил_Алгоритмы.ПолучитьЭлементы().Очистить();
	ГруппыПравил_ПКПД.ПолучитьЭлементы().Очистить();
	ГруппыПравил_Запросы.ПолучитьЭлементы().Очистить();

	Если Не ЗначениеЗаполнено(Объект.Конвертация) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполняемыеГруппы = Новый Структура();
	ЗаполняемыеГруппы.Вставить("Алгоритмы", ГруппыПравил_Алгоритмы);
	ЗаполняемыеГруппы.Вставить("ПравилаКонвертацииОбъектов", ГруппыПравил_ПКО);
	ЗаполняемыеГруппы.Вставить("ПравилаКонвертацииПредопределенныхДанных", ГруппыПравил_ПКПД);
	ЗаполняемыеГруппы.Вставить("ПравилаОбработкиДанных", ГруппыПравил_ПОД);
	ЗаполняемыеГруппы.Вставить("Запросы", ГруппыПравил_Запросы);

	
	Для Каждого КлючИЗначение Из ЗаполняемыеГруппы Цикл
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Правила.ГруппаПравил КАК Группа
		|ИЗ
		|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник." + КлючИЗначение.Ключ + " КАК Правила
		|		ПО (Правила.Ссылка = СоставыКонвертаций.ЭлементКонвертации)
		|ГДЕ
		|	СоставыКонвертаций.Владелец = &Владелец");
		Запрос.УстановитьПараметр("Владелец", Объект.Конвертация);

	
		ТаблицаГруппыПравил = Запрос.Выполнить().Выгрузить();
		ТаблицаГруппыПравил.Свернуть("Группа");
		ТаблицаГруппыПравил.Сортировать("Группа");
		
		СтрокиДерева = Новый Соответствие;
		
		Корень = КлючИЗначение.Значение.ПолучитьЭлементы().Добавить();
		Корень.Наименование = НСтр("ru = '<Все правила>'");
		Корень.НаименованиеПоиска = НСтр("ru = '<Все правила>'");
		
		ДобавитьСтрокиДереваГруппПравил(ТаблицаГруппыПравил, Корень, СтрокиДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиДереваГруппПравил(ТаблицаГруппыПравил, Корень, СтрокиДерева, Индекс = 0, Префикс = "")
	Если ТаблицаГруппыПравил.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаГруппыПравил = ТаблицаГруппыПравил[Индекс];
	
	Родитель  = Корень;
	ИмяГруппы = СтрокаГруппыПравил.Группа;
	
	Если Не ПустаяСтрока(Префикс) Тогда
		ИмяГруппы = СтрЗаменить(ИмяГруппы, Префикс + "\", "");
		Родитель  = СтрокиДерева[Префикс];
	КонецЕсли;
	
	Поз = СтрНайти(ИмяГруппы, "\");
	
	Если Поз = 0 Тогда
		ИмяДочернего = ИмяГруппы;
		ИмяПоиска = ИмяДочернего;
		
		Если Не ПустаяСтрока(Префикс) Тогда
			ИмяПоиска = Префикс + "\" + ИмяПоиска;
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяДочернего) Тогда
			Дочерний = Родитель.ПолучитьЭлементы().Добавить();
			Дочерний.Наименование       = НСтр("ru = '<Без группы>'");
			Дочерний.НаименованиеПоиска = НСтр("ru = '<Без группы>'");
		Иначе
			Дочерний = Родитель.ПолучитьЭлементы().Добавить();
			Дочерний.Наименование       = ИмяДочернего;
			Дочерний.НаименованиеПоиска = ИмяПоиска;
		КонецЕсли;
		
		СтрокиДерева.Вставить(ИмяПоиска, Дочерний);
	Иначе
		ИмяДочернего = Лев(ИмяГруппы, Поз - 1);
		ИмяПоиска = ИмяДочернего;
		
		Если Не ПустаяСтрока(Префикс) Тогда
			ИмяПоиска = Префикс + "\" + ИмяПоиска;
		КонецЕсли;
		
		Если СтрокиДерева[ИмяПоиска] = Неопределено Тогда
			Дочерний = Родитель.ПолучитьЭлементы().Добавить();
			Дочерний.Наименование       = ИмяДочернего;
			Дочерний.НаименованиеПоиска = ИмяПоиска;
			
			СтрокиДерева.Вставить(ИмяПоиска, Дочерний);
		КонецЕсли;
		
		ДобавитьСтрокиДереваГруппПравил(ТаблицаГруппыПравил, Корень, СтрокиДерева, Индекс, ИмяПоиска);
		
		Возврат;
	КонецЕсли;
	
	Если Индекс < ТаблицаГруппыПравил.Количество() - 1 Тогда
		ДобавитьСтрокиДереваГруппПравил(ТаблицаГруппыПравил, Корень, СтрокиДерева, Индекс + 1);
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыСписков()
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("парКонвертация", Объект.Конвертация);
	ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);

	Алгоритмы.Параметры.УстановитьЗначениеПараметра("парКонвертация", Объект.Конвертация);
	Алгоритмы.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);

	ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("парКонвертация", Объект.Конвертация);
	ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);

	ПравилаКонвертацииПредопределенныхДанных.Параметры.УстановитьЗначениеПараметра("парКонвертация", Объект.Конвертация);
	ПравилаКонвертацииПредопределенныхДанных.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);

	Запросы.Параметры.УстановитьЗначениеПараметра("парКонвертация", Объект.Конвертация);
	Запросы.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);

КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыСписков_ГруппыПравил(ИмяТекущейСтраницы = "")
	ОбновитьВсе = (ИмяТекущейСтраницы = "");
	Если ОбновитьВсе Или ИмяТекущейСтраницы = "ПКО" Тогда
		НетОтбораПоГруппе = (ТекущаяГруппаПравилПКО = НСтр("ru = '<Все правила>'"));
		ПустаяГруппа      = (ТекущаяГруппаПравилПКО = НСтр("ru = '<Без группы>'"));
		ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("парГруппа",         ТекущаяГруппаПравилПКО + "%");
		ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
		ПравилаКонвертацииОбъектов.Параметры.УстановитьЗначениеПараметра("ПустаяГруппа",      ПустаяГруппа);
	КонецЕсли;
	Если ОбновитьВсе Или ИмяТекущейСтраницы = "ГруппаАлгоритмы" Тогда
		НетОтбораПоГруппе = (ТекущаяГруппаПравилАлгоритмы = НСтр("ru = '<Все правила>'"));
		ПустаяГруппа      = (ТекущаяГруппаПравилАлгоритмы = НСтр("ru = '<Без группы>'"));
		Алгоритмы.Параметры.УстановитьЗначениеПараметра("парГруппа",         ТекущаяГруппаПравилАлгоритмы + "%");
		Алгоритмы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
		Алгоритмы.Параметры.УстановитьЗначениеПараметра("ПустаяГруппа",      ПустаяГруппа);
	КонецЕсли;
	Если ОбновитьВсе Или ИмяТекущейСтраницы = "ГруппаЗапросы" Тогда
		НетОтбораПоГруппе = (ТекущаяГруппаПравилЗапросы = НСтр("ru = '<Все правила>'"));
		ПустаяГруппа      = (ТекущаяГруппаПравилЗапросы = НСтр("ru = '<Без группы>'"));
		Запросы.Параметры.УстановитьЗначениеПараметра("парГруппа",         ТекущаяГруппаПравилЗапросы + "%");
		Запросы.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
		Запросы.Параметры.УстановитьЗначениеПараметра("ПустаяГруппа",      ПустаяГруппа);
	КонецЕсли;
	Если ОбновитьВсе Или ИмяТекущейСтраницы = "ПОД" Тогда
		НетОтбораПоГруппе = (ТекущаяГруппаПравилПОД = НСтр("ru = '<Все правила>'"));
		ПустаяГруппа      = (ТекущаяГруппаПравилПОД = НСтр("ru = '<Без группы>'"));  	
		ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("парГруппа",         ТекущаяГруппаПравилПОД + "%");
		ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
		ПравилаОбработкиДанных.Параметры.УстановитьЗначениеПараметра("ПустаяГруппа",      ПустаяГруппа);
	КонецЕсли;
	Если ОбновитьВсе Или ИмяТекущейСтраницы = "ПКПД" Тогда
		НетОтбораПоГруппе = (ТекущаяГруппаПравилПКПД = НСтр("ru = '<Все правила>'"));
		ПустаяГруппа      = (ТекущаяГруппаПравилПКПД = НСтр("ru = '<Без группы>'"));  	
		ПравилаКонвертацииПредопределенныхДанных.Параметры.УстановитьЗначениеПараметра("парГруппа",         ТекущаяГруппаПравилПКПД + "%");
		ПравилаКонвертацииПредопределенныхДанных.Параметры.УстановитьЗначениеПараметра("НетОтбораПоГруппе", НетОтбораПоГруппе);
		ПравилаКонвертацииПредопределенныхДанных.Параметры.УстановитьЗначениеПараметра("ПустаяГруппа",      ПустаяГруппа);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСправочника(ИмяСправочника, Отказ, Копирование, Группа, Ключ = Неопределено)
	
	Если Группа Или Копирование Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	Если Ключ <> Неопределено Тогда
		СтруктураПараметров = Новый Структура("Ключ", Ключ);
	Иначе
	
		СтруктураПараметров = Новый Структура("Конвертация", Объект.Конвертация);
		ТекущаяГруппаПравил = "";
		ИмяФормыЭлементаСпр = "ФормаЭлемента";

		Если ИмяСправочника = "ПравилаОбработкиДанных" Тогда
			ТекущаяГруппаПравил = ТекущаяГруппаПравилПОД;
		ИначеЕсли ИмяСправочника = "ПравилаКонвертацииОбъектов" Тогда
			ТекущаяГруппаПравил = ТекущаяГруппаПравилПКО;
		ИначеЕсли ИмяСправочника = "Алгоритмы" Тогда
			ТекущаяГруппаПравил = ТекущаяГруппаПравилАлгоритмы;
		ИначеЕсли ИмяСправочника = "ПравилаКонвертацииПредопределенныхДанных" Тогда			
			ТекущаяГруппаПравил = ТекущаяГруппаПравилПКПД;
		ИначеЕсли ИмяСправочника = "Запросы" Тогда
			ТекущаяГруппаПравил = ТекущаяГруппаПравилЗапросы;
		КонецЕсли;
			
		СтруктураПараметров.Вставить("ГруппаПравил", ТекущаяГруппаПравил);
			
	КонецЕсли;

	Если ИмяСправочника = "ПравилаКонвертацииПредопределенныхДанных" Тогда
		ИмяФормыЭлементаСпр = ?(ЭтоКонвертацияXDTO, "ФормаЭлементаXDTO", "ФормаЭлементаXML");
	Иначе
		ИмяФормыЭлементаСпр = "ФормаЭлемента";
	КонецЕсли;
	ОткрытьФорму("Справочник." + ИмяСправочника + ".Форма." + ИмяФормыЭлементаСпр,
		СтруктураПараметров);


КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМодулиКлиент(ПоСостояниюХранилища) 
	Если НЕ ПроверитьЗаполненаКонвертация() Тогда
		Возврат;
	КонецЕсли;
	ИменаФайловДляСохранения = Новый Структура;
	НастройкиВыгрузки = Новый Структура;
	Модули = СохранитьМодульСервер(ПоСостояниюХранилища, ИменаФайловДляСохранения, НастройкиВыгрузки);
	Если Модули.Количество() = 1 И ИменаФайловДляСохранения.Количество() = 0 Тогда
		ТХ = Модули.МенеджерОбменаЧерезУниверсальныйФормат;
		КонвертацияДанныхXDTOКлиент.ВывестиТекстДляИспользования(ТХ);
	Иначе
		КонвертацияДанныхXDTOКлиент.СохранитьМодулиКонвертацииВФайлы(Модули, НастройкиВыгрузки, ИменаФайловДляСохранения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СохранитьМодульСервер(ПоСостояниюХранилища, ИменаФайловДляСохранения, НастройкиВыгрузки)
	Обработки.ВыгрузкаМодуля.ПодготовитьНастройкиВыгрузкиМодулей(Объект.Конвертация, ИменаФайловДляСохранения, НастройкиВыгрузки);
	Если ВерсияФорматаМенеджера = "1" Тогда
		ОбработкаОбъект = Обработки.УдалитьВыгрузкаМодуля_3_0_7.Создать();
		ОбработкаОбъект.Конвертация = Объект.Конвертация;
		Результат = Новый Структура("МенеджерОбменаЧерезУниверсальныйФормат" ,ОбработкаОбъект.ВыполнитьВыгрузкуМодулей());
	Иначе
		ОбработкаОбъект = Обработки.ВыгрузкаМодуля.Создать();
		ОбработкаОбъект.ПоСостояниюХранилища = ПоСостояниюХранилища;
		ОбработкаОбъект.Конвертация = Объект.Конвертация;
		Результат = ОбработкаОбъект.ВыполнитьВыгрузкуМодулей();
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ГруппыПравилПКОПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ГруппыПравилПКО.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Новый Структура("НаименованиеПоиска", НСтр("ru = '<Все правила>'"));
	КонецЕсли;
	
	Если ТекущаяГруппаПравилПКО = ТекущиеДанные.НаименованиеПоиска
		И ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница.Имя Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяГруппаПравилПКО = ТекущиеДанные.НаименованиеПоиска;
	ТекущаяСтраница     = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	ОбновитьПараметрыСписков_ГруппыПравил(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравилПОДПриАктивизацииСтрокиОбработчикОжидания()
	Попытка
		ТекДанные = Элементы.ГруппыПравил_ПОД.ТекущиеДанные;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ТекДанные = Неопределено Тогда
		ТекДанные = Новый Структура("НаименованиеПоиска", НСтр("ru = '<Все правила>'"));
	КонецЕсли;
	
	Если ТекущаяГруппаПравилПОД = ТекДанные.НаименованиеПоиска
		И ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница.Имя Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяГруппаПравилПОД = ТекДанные.НаименованиеПоиска;
	ТекущаяСтраница     = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	ОбновитьПараметрыСписков_ГруппыПравил(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравилПКПДПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ГруппыПравил_ПКПД.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Новый Структура("НаименованиеПоиска", НСтр("ru = '<Все правила>'"));
	КонецЕсли;
	
	Если ТекущаяГруппаПравилПКПД = ТекущиеДанные.НаименованиеПоиска
		И ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница.Имя Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяГруппаПравилПКПД = ТекущиеДанные.НаименованиеПоиска;
	ТекущаяСтраница     = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	ОбновитьПараметрыСписков_ГруппыПравил(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравилАлгоритмыПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ГруппыПравил_Алгоритмы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Новый Структура("НаименованиеПоиска", НСтр("ru = '<Все правила>'"));
	КонецЕсли;
	
	Если ТекущаяГруппаПравилАлгоритмы = ТекущиеДанные.НаименованиеПоиска
		И ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница.Имя Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяГруппаПравилАлгоритмы = ТекущиеДанные.НаименованиеПоиска;
	ТекущаяСтраница     = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	ОбновитьПараметрыСписков_ГруппыПравил(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПравилЗапросыПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ГруппыПравил_Запросы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Новый Структура("НаименованиеПоиска", НСтр("ru = '<Все правила>'"));
	КонецЕсли;
	
	Если ТекущаяГруппаПравилЗапросы = ТекущиеДанные.НаименованиеПоиска
		И ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница.Имя Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяГруппаПравилЗапросы = ТекущиеДанные.НаименованиеПоиска;
	ТекущаяСтраница     = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	ОбновитьПараметрыСписков_ГруппыПравил(ТекущаяСтраница);
	
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиКПКО(Команда)
	Если Элементы.Страницы.ТекущаяСтраница <> Элементы.ПОД Тогда
		Возврат;
	КонецЕсли;
	ТекПОД = Элементы.ПравилаОбработкиДанных.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(ТекПОД) Тогда
		Возврат;
	КонецЕсли;
	ТекПКО = ПолучитьПКО(ТекПОД);
	Если НЕ ЗначениеЗаполнено(ТекПКО) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ТекПКО) = Тип("Массив") Тогда
		ОткрытьФормуВыбораПКО(ТекПКО);
		Возврат;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ПКО;
	Элементы.ПравилаКонвертацииОбъектов.ТекущаяСтрока = ТекПКО;
КонецПроцедуры

&НаСервере
Функция ПолучитьПКО(ТекПОД)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
	Запрос.УстановитьПараметр("ПОД", ТекПОД);
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПКО.Ссылка КАК Ссылка
		|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.Владелец = &Конвертация
		|	И Состав.ЭлементКонвертации = ПКО.Ссылка
		|	И Состав.Отключить = ЛОЖЬ
		|ГДЕ ПКО.Код = &ИмяПКО";
	Если ЗначениеЗаполнено(ТекПОД.ПравилоКонвертацииОбъекта) Тогда
		Запрос.УстановитьПараметр("ИмяПКО", ТекПОД.ПравилоКонвертацииОбъекта);
	ИначеЕсли ТекПОД.ПравилаКонвертацииОбъектов.Количество() = 1 Тогда
		Запрос.УстановитьПараметр("ИмяПКО", ТекПОД.ПравилаКонвертацииОбъектов[0].ПравилоКонвертацииОбъекта);
	ИначеЕсли ТекПОД.ПравилаКонвертацииОбъектов.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='В текущем правиле обработки данных не указано правило конвертации объекта'"));
		Возврат Неопределено;
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПКО.Ссылка КАК Ссылка
		|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|	ПО Состав.Владелец = &Конвертация
		|	И Состав.ЭлементКонвертации = ПКО.Ссылка
		|	И Состав.Отключить = ЛОЖЬ
		|ГДЕ ПКО.Код В (ВЫБРАТЬ РАЗЛИЧНЫЕ ПравилоКонвертацииОбъекта
		|					ИЗ Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов
		|					ГДЕ Ссылка = &ПОД)";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		МассивПКО = Новый Массив;
		Пока Выборка.Следующий() Цикл
			МассивПКО.Добавить(Выборка.Ссылка);
		КонецЦикла;
		Возврат МассивПКО;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораПКО(МассивПКО)
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Ссылка, Конвертация",МассивПКО, Объект.Конвертация));
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ОбработатьВыборПКО",ЭтотОбъект);
	ОткрытьФорму("Справочник.ПравилаКонвертацииОбъектов.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещенияОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПКО(РезультатЗакрытияФормы, ДопПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытияФормы) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов")
		И ЗначениеЗаполнено(РезультатЗакрытияФормы) Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.ПКО;
			Элементы.ПравилаКонвертацииОбъектов.ТекущаяСтрока = РезультатЗакрытияФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ФормаВыгрузкаКонвертацииXML.Видимость = НЕ ЭтоКонвертацияXDTO;

	Элементы.ФормаЗагрузкаОбработчиков.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаОбработкиДанныхИспользоватьДляОтправки.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаОбработкиДанныхИспользоватьДляПолучения.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ГруппаЗапросы.Видимость = НЕ ЭтоКонвертацияXDTO;
	
	// ПКО
	Элементы.ПравилаКонвертацииОбъектовИспользоватьДляОтправки.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииОбъектовИспользоватьДляПолучения.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииОбъектовОбъектФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииОбъектовОбъектКонфигурацииКорреспондент.Видимость = НЕ ЭтоКонвертацияXDTO;
	// ПКПД
	Элементы.ПравилаКонвертацииПредопределенныхДанныхИспользоватьДляОтправки.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииПредопределенныхДанныхИспользоватьДляПолучения.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииПредопределенныхДанныхОбъектФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииПредопределенныхДанныхОбъектКонфигурацииКорреспондент.Видимость = НЕ ЭтоКонвертацияXDTO;
	// Заголовки.
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Элементы.ПОД.Заголовок = НСтр("ru='Правила выгрузки данных'");
		Элементы.ПравилаКонвертацииОбъектовОбъектКонфигурации.Заголовок = НСтр("ru='Источник'");
		Элементы.ПравилаКонвертацииПредопределенныхДанныхОбъектКонфигурации.Заголовок = НСтр("ru='Источник'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполненаКонвертация()
	Если НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указана конвертация'"));
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ГруппыПравилПеретаскиваниеОбработчикОжидания()
	 // Поиск в новом дереве.
	 Если Перетаскивание_Где = "ГруппыПравил_ПОД" Тогда
		 СтрокиДереваВсе = ГруппыПравил_ПОД.ПолучитьЭлементы();
		 ИмяСправочника = "ПравилаОбработкиДанных";
	 ИначеЕсли Перетаскивание_Где = "ГруппыПравил_ПКО" Тогда
		 СтрокиДереваВсе = ГруппыПравил_ПКО.ПолучитьЭлементы();
		 ИмяСправочника = "ПравилаКонвертацииОбъектов";
	 ИначеЕсли Перетаскивание_Где = "ГруппыПравил_ПКПД" Тогда
		 СтрокиДереваВсе = ГруппыПравил_ПКПД.ПолучитьЭлементы();
		 ИмяСправочника = "ПравилаКонвертацииПредопределенныхДанных";
	 ИначеЕсли Перетаскивание_Где = "ГруппыПравил_Запросы" Тогда
		 СтрокиДереваВсе = ГруппыПравил_Запросы.ПолучитьЭлементы();
		 ИмяСправочника = "Запросы";
	 ИначеЕсли Перетаскивание_Где = "ГруппыПравил_Алгоритмы" Тогда
		 СтрокиДереваВсе = ГруппыПравил_Алгоритмы.ПолучитьЭлементы();
		 ИмяСправочника = "Алгоритмы";
	 Иначе
		 Возврат;
	 КонецЕсли;
	 СтрокаДереваПослеПеретаскивания = НайтиПоНаименованиюПоиска(СтрокиДереваВсе);
	 Если СтрокаДереваПослеПеретаскивания = Неопределено Тогда
		 Возврат;
	 КонецЕсли;
	 ГруппаИсходная = СтрокаДереваПослеПеретаскивания.НаименованиеПоиска;
	 ГруппаНовая = СтрокаДереваПослеПеретаскивания.Наименование;
	 ТекРодитель = СтрокаДереваПослеПеретаскивания.ПолучитьРодителя();
	 Пока ТекРодитель <> Неопределено Цикл
		 Если ТекРодитель.Наименование = "<Все правила>"
			 Или ТекРодитель.Наименование = "<Без группы>" Тогда
			 Прервать;
		 КонецЕсли;
		 ГруппаНовая = ТекРодитель.Наименование + "\" + ГруппаНовая;
		 ТекРодитель = ТекРодитель.ПолучитьРодителя();
	 КонецЦикла;
	 Если ГруппаИсходная <> ГруппаНовая Тогда
		 ПерезаполнитьГруппуПравил(ГруппаИсходная, ГруппаНовая, ИмяСправочника);
	 КонецЕсли;
	 СтрокаДереваПослеПеретаскивания.НаименованиеПоиска = ГруппаНовая;
	 
 КонецПроцедуры
 
&НаКлиенте 
Функция НайтиПоНаименованиюПоиска(СтрокиДерева)
	Для Каждого Строка Из СтрокиДерева Цикл
		Если Строка.НаименованиеПоиска = Перетаскивание_Что Тогда
			 Возврат Строка;
		Иначе
			 Результат = НайтиПоНаименованиюПоиска(Строка.ПолучитьЭлементы());
			 Если Результат <> Неопределено Тогда
				 Возврат Результат;
			 КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Процедура ПерезаполнитьГруппуПравил(ГруппаИсходная, ГруппаНовая, ИмяСправочника)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ
	|Справочник." + ИмяСправочника + " КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставКонвертации
	|	ПО (СоставКонвертации.ЭлементКонвертации = Правила.Ссылка)
	|		И (СоставКонвертации.Владелец = &ПарКонвертация)
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних КАК ДанныеЗахвата_Мои
	|	ПО Правила.Ссылка = ДанныеЗахвата_Мои.Объект
	|	И ДанныеЗахвата_Мои.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)
	|	И ДанныеЗахвата_Мои.Пользователь = &ТекущийПользователь
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних КАК ДанныеЗахвата_Чужие
	|	ПО Правила.Ссылка = ДанныеЗахвата_Чужие.РабочаяКопия
	|	И ДанныеЗахвата_Чужие.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)
	|	И ДанныеЗахвата_Чужие.Пользователь <> &ТекущийПользователь
	|ГДЕ
	|	Правила.ГруппаПравил ПОДОБНО &парГруппа
	|	И ( НЕ Правила.Захвачен
	|	ИЛИ (ДанныеЗахвата_Мои.Пользователь Is not null И НЕ Правила.Копия)
	|	ИЛИ (ДанныеЗахвата_Чужие.Пользователь Is not null И Правила.Копия)
	|	)";
	Запрос.УстановитьПараметр("парГруппа", ГруппаИсходная);
	Запрос.УстановитьПараметр("ПарКонвертация", Объект.Конвертация);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.ГруппаПравил = ГруппаНовая;
		СпрОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстКнопкиВыгрузки()
	Результат = Обработки.ВыгрузкаМодуля.ПолучитьТекстЗаголовкаКомандыВыгрузкиМодуля(Объект.Конвертация);
	Элементы.ФормаСохранитьМодуль.Заголовок = Результат.ЗаголовокКоманды;
	Элементы.ПодменюСохранитьМодуль.Заголовок = Результат.ЗаголовокКоманды;
	Элементы.ПодменюСохранитьМодуль.Подсказка = Результат.Подсказка;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеЗагрузки", 1, Истина);  
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеЗагрузки() 
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	ДлительнаяОперация = Ложь;
	Если РезультатЗагрузки.Успешно Тогда
		Если РезультатЗагрузки.Свойство("СообщениеОРезультате") И ЗНачениеЗаполнено(РезультатЗагрузки.СообщениеОРезультате) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗагрузки.СообщениеОРезультате);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'При загрузке обработчиков произошли ошибки'") + Символы.ПС + РезультатЗагрузки.Ошибки);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти











