#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	Если ЗначениеЗаполнено(Ссылка) 
		И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		КонвертацияДанныхXDTOСервер.ПроверитьЗахватОбъектаПриПометкеНаУдаление(Ссылка.Захвачен, ПометкаУдаления, Отказ);
		Если НЕ Отказ Тогда
			КонвертацияДанныхXDTOВызовСервера.ОбработатьПометкуНаУдалениеЭлементаКонвертации(Ссылка, ПометкаУдаления);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Запись нового объекта в режиме совместной работы: следует добавить запись в регистр захвата.
	Если ДополнительныеСвойства.Свойство("ЭтоНовый")
		И ДополнительныеСвойства.ЭтоНовый 
		И Захвачен И Константы.СовместнаяРабота.Получить()  Тогда
		КонвертацияДанныхXDTOСервер.ОтразитьЗахватНовогоОбъекта(Ссылка);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
