#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ПравилоРегистрацииОбразец", ПравилоРегистрацииОбразец);
	ДанныеПРО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПравилоРегистрацииОбразец, "Владелец, ОбъектНастройки");
	Регистрация = ДанныеПРО.Владелец;
	ТипОбъектаНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПРО.ОбъектНастройки, "Тип");
	ДанныеФильтра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистрация, "ИмяПланаОбмена, Конфигурация");
	
	ИмяПланаОбмена = ДанныеФильтра.ИмяПланаОбмена;
	Конфигурация = ДанныеФильтра.Конфигурация;
	// Заполнение списка объектов.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	СвойстваТипы.Тип                    КАК Объект,
		|	СвойстваТипы.Ссылка.Авторегистрация КАК Авторегистрация
		|ПОМЕСТИТЬ СоставПланаОбмена
		|ИЗ
		|	Справочник.Свойства.Типы КАК СвойстваТипы
		|ГДЕ
		|	  СвойстваТипы.Ссылка.Владелец.Имя = &ПланОбмена
		|	И СвойстваТипы.Ссылка.Владелец.Владелец = &Владелец
		|	И СвойстваТипы.Ссылка.Вид      = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ЭлементСоставаПланаОбмена)
		|;
		|
		|ВЫБРАТЬ
		|	СправочникОбъекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Объекты КАК СправочникОбъекты
		|
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	СоставПланаОбмена КАК СоставПланаОбмена
		|ПО
		|	СправочникОбъекты.Ссылка = СоставПланаОбмена.Объект
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.ПравилаРегистрацииОбъектов КАК СуществующиеПравила
		|ПО СуществующиеПравила.ОбъектНастройки = СправочникОбъекты.Ссылка
		|	И СуществующиеПравила.Владелец = &Регистрация
		|	И СуществующиеПравила.ПометкаУдаления = ЛОЖЬ
		|
		|ГДЕ
		|	НЕ СправочникОбъекты.ПометкаУдаления
		|	И СправочникОбъекты.ЭтоГруппа = ЛОЖЬ
		|	И СправочникОбъекты.Владелец = &Владелец
		|	И СправочникОбъекты.Наименование <> ""РегистрСведенийЗапись.СоответствиеОбъектовИнформационныхБаз""
		|	И СправочникОбъекты.Тип = &ТипОбъектаНастройки
		|	И СуществующиеПравила.Ссылка ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	СправочникОбъекты.ЭтоГруппа ИЕРАРХИЯ,
		|	СправочникОбъекты.Наименование
		|";
	Запрос.УстановитьПараметр("ТипОбъектаНастройки", ТипОбъектаНастройки);
	Запрос.УстановитьПараметр("Регистрация", Регистрация);
	Запрос.УстановитьПараметр("Владелец", Конфигурация);
	Запрос.УстановитьПараметр("ПланОбмена", ИмяПланаОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектыДляКопирования.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаСервере
Процедура СкопироватьПравилоНаСервере()
	СозданоПравил = 0;
	Неудач = 0;
	КопируемыеРеквизиты = Новый Массив;
	КопируемыеРеквизиты.Добавить("РеквизитРежимаВыгрузкиОбъектовОбмена");
	КопируемыеРеквизиты.Добавить("ОтборПоСвойствамПланаОбмена");
	КопируемыеРеквизиты.Добавить("ОтборПоСвойствамОбъекта");
	КопируемыеРеквизиты.Добавить("АлгоритмПередОбработкойПравила");
	КопируемыеРеквизиты.Добавить("АлгоритмПриОбработкеПравила");
	КопируемыеРеквизиты.Добавить("АлгоритмПриОбработкеДополнительныйПравила");
	КопируемыеРеквизиты.Добавить("АлгоритмПослеОбработкиПравила");
	КопируемыеРеквизиты.Добавить("Родитель");  

	ДанныеДляКопирования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПравилоРегистрацииОбразец, КопируемыеРеквизиты);
	// Преобразуем отборы из хранилища в дерево значений.
	ОтборПоСвойствамХранилище = ДанныеДляКопирования.ОтборПоСвойствамПланаОбмена;
	ОтборПОСвойствамДерево = ОтборПоСвойствамХранилище.Получить();
	Если ТипЗнч(ОтборПОСвойствамДерево) = Тип("ДеревоЗначений") Тогда
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамПланаОбмена", ОтборПОСвойствамДерево);
	Иначе
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамПланаОбмена", Новый ДеревоЗначений);
	КонецЕсли;
	ОтборПоСвойствамХранилище = ДанныеДляКопирования.ОтборПоСвойствамОбъекта;
	ОтборПОСвойствамДерево = ОтборПоСвойствамХранилище.Получить();
	Если ТипЗнч(ОтборПОСвойствамДерево) = Тип("ДеревоЗначений") Тогда
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамОбъекта", ОтборПОСвойствамДерево);
	Иначе
		ДанныеДляКопирования.Вставить("ОтборПоСвойствамОбъекта", Новый ДеревоЗначений);
	КонецЕсли;

	Для Каждого ЭлементСписка Из ОбъектыДляКопирования Цикл
		Если ЭлементСписка.Пометка Тогда
			Отказ = Ложь;
			СоздатьПРОПоОбразцу(ЭлементСписка.Значение, ДанныеДляКопирования, Отказ);
			Если Отказ Тогда
				Неудач = Неудач + 1;
			Иначе
				СозданоПравил = СозданоПравил + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТекстСообщения = НСтр("ru='Создано правил %1, неудачных попыток %2'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СозданоПравил);
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Неудач);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПравило(Команда)
	СкопироватьПравилоНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПРОПоОбразцу(ОбъектНастройки, ДанныеДляКопирования, Отказ)
	НовоеПРО = Справочники.ПравилаРегистрацииОбъектов.СоздатьЭлемент();
	НовоеПРО.Владелец = Регистрация;
	НовоеПРО.ОбъектНастройки = ОбъектНастройки;
	НовоеПРО.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектНастройки, "Синоним");
	ЗаполнитьЗначенияСвойств(НовоеПРО, ДанныеДляКопирования,,"ОтборПоСвойствамОбъекта, ОтборПоСвойствамПланаОбмена");
	// Отборы добавляются с учетом состава реквизитов объекта.
	ОбработатьОтборы(НовоеПРО, "ОтборПоСвойствамОбъекта", ДанныеДляКопирования.ОтборПоСвойствамОбъекта, Ложь);
	ОбработатьОтборы(НовоеПРО, "ОтборПоСвойствамПланаОбмена", ДанныеДляКопирования.ОтборПоСвойствамПланаОбмена, Истина);

	Попытка
		НовоеПРО.Записать();
	Исключение
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтборы(НовоеПРО, ИмяРеквизитаОтбор, ДеревоРеквизитаОтбор, ПроверятьСтрокаКонстанты)
	Если ДеревоРеквизитаОтбор.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ДеревоРезультат = ДеревоРеквизитаОтбор.Скопировать();
	Если ДеревоРезультат.Колонки.Найти("СвойствоОбъекта") <> Неопределено Тогда
		ОбработатьСтрокиДерева(НовоеПРО, ДеревоРезультат.Строки, ПроверятьСтрокаКонстанты);
	КонецЕсли;
	НовоеПРО[ИмяРеквизитаОтбор] = Новый ХранилищеЗначения(ДеревоРезультат);
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокиДерева(НовоеПРО, СтрокиДерева, ПроверятьСтрокаКонстанты)
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если ПроверятьСтрокаКонстанты И СтрокаДерева.ЭтоСтрокаКонстанты Тогда
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СтрокаДерева.СвойствоОбъекта) Тогда
			РеквизитНайден = Истина;
			ПозицияТочки = СтрНайти(СтрокаДерева.СвойствоОбъекта, ".");
			Если ПозицияТочки = 0 Тогда
				РеквизитОбъекта = Справочники.Свойства.НайтиПоНаименованию(СтрокаДерева.СвойствоОбъекта, Истина,Справочники.Свойства.ПустаяСсылка(),НовоеПРО.ОбъектНастройки);
				РеквизитНайден = ЗначениеЗаполнено(РеквизитОбъекта);
			Иначе
				ИмяТЧ = СокрЛП(Лев(СтрокаДерева.СвойствоОбъекта, ПозицияТочки-1));
				ИмяСвойства = СокрЛП(Сред(СтрокаДерева.СвойствоОбъекта, ПозицияТочки+1));
				РеквизитРодитель = Справочники.Свойства.НайтиПоНаименованию(ИмяТЧ, Истина,,НовоеПРО.ОбъектНастройки);
				Если ЗначениеЗаполнено(РеквизитРодитель) Тогда
					РеквизитОбъекта = Справочники.Свойства.НайтиПоНаименованию(ИмяСвойства, Истина,РеквизитРодитель,НовоеПРО.ОбъектНастройки);
					РеквизитНайден = ЗначениеЗаполнено(РеквизитОбъекта);
				Иначе
					РеквизитНайден = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если НЕ РеквизитНайден Тогда
				СтрокиКУдалению.Добавить(СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ОбработатьСтрокиДерева(НовоеПРО, СтрокаДерева.Строки, ПроверятьСтрокаКонстанты);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		СтрокиДерева.Удалить(СтрокаКУдалению);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти