#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Родитель) Тогда
		Объект.Расширение = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Родитель, "Расширение");
	КонецЕсли; 
КонецПроцедуры
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указан родитель'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьСтруктуруФормата(Команда)
	СтруктураПараметров = Новый Структура("парВерсияФормата", Объект.Ссылка);
	ОткрытьФорму("Обработка.ЗагрузкаСтруктурыФормата.Форма", СтруктураПараметров);
КонецПроцедуры


#КонецОбласти
