#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Выполняет выгрузку правил регистрации в файл.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при выгрузке.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения выгрузки.
Процедура ВыполнитьВыгрузкуПравил(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	ОбщиеПеременные.Вставить("ФлагОшибки", Ложь);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");

	мЗаписьXML = Новый ЗаписьXML;
	мЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	ВыгрузитьКонвертацию(мЗаписьXML, ОбщиеПеременные);
	мЗаписьXML.Закрыть();
	мЗаписьXML = Неопределено;
	Результат = Новый Структура("ФлагОшибки", ОбщиеПеременные.ФлагОшибки);
	
	Если Не ОбщиеПеременные.ФлагОшибки Тогда
		Если Не ОбщиеПеременные.ФлагОшибки Тогда
			Результат.Вставить("ПравилаXML", Новый ДвоичныеДанные(ИмяВременногоФайла));
		КонецЕсли;

	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ИмяВременногоФайла = "";
	КонецПопытки;

	ПоместитьВоВременноеХранилище(Результат, АдресВременногоХранилища);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ВыгрузитьКонвертацию(мЗаписьXML, ОбщиеПеременные)
	ОбщиеПеременные.Вставить("СовместнаяРабота", Константы.СовместнаяРабота.Получить());
	мЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаОбмена");
	ВыгрузитьРеквизитыКонвертации(мЗаписьXML, ОбщиеПеременные);
	// Обработки не поддерживаются.
	мЗаписьXML.ЗаписатьНачалоЭлемента("Обработки");
	мЗаписьXML.ЗаписатьКонецЭлемента();
	мЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаКонвертацииОбъектов");
	// Правила конвертации предопределенных данных выгружаются совместно, как правила конвертации объектов.
	ТаблицаПКО = ВыполнитьЗапросПКО(ОбщиеПеременные);
	ОткрытыеГруппы = Новый Массив;
	ВыгрузитьПравилаКонвертацииОбъектов(мЗаписьXML, ТаблицаПКО, ОбщиеПеременные,ОткрытыеГруппы);
	ЗакрытьГруппы(мЗаписьXML, ОткрытыеГруппы);
	мЗаписьXML.ЗаписатьКонецЭлемента();
	
	мЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаВыгрузкиДанных");
	ТаблицаПВД = ВыполнитьЗапросПВД(ОбщиеПеременные);
	ВыгрузитьПравилаВыгрузкиДанных(мЗаписьXML, ОбщиеПеременные, ТаблицаПВД,ОткрытыеГруппы);
	ЗакрытьГруппы(мЗаписьXML, ОткрытыеГруппы);
	мЗаписьXML.ЗаписатьКонецЭлемента();
	
	// Правила очистки данных не поддерживаются.
	мЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаОчисткиДанных");
	мЗаписьXML.ЗаписатьКонецЭлемента();

	мЗаписьXML.ЗаписатьНачалоЭлемента("Алгоритмы");
	ТаблицаАлгоритмы = ВыполнитьЗапросАлгоритмы(ОбщиеПеременные);
	ВыгрузитьАлгоритмы(мЗаписьXML,ТаблицаАлгоритмы, ОткрытыеГруппы);
	ЗакрытьГруппы(мЗаписьXML, ОткрытыеГруппы);
	мЗаписьXML.ЗаписатьКонецЭлемента();
	
	мЗаписьXML.ЗаписатьНачалоЭлемента("Запросы");
	ТаблицаЗапросы = ВыполнитьЗапросЗапросы(ОбщиеПеременные);
	ВыгрузитьЗапросы(мЗаписьXML,ТаблицаЗапросы, ОткрытыеГруппы);
	ЗакрытьГруппы(мЗаписьXML, ОткрытыеГруппы);
	мЗаписьXML.ЗаписатьКонецЭлемента();
	мЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Процедура ВыгрузитьПравилаКонвертацииОбъектов(мЗаписьXML, Объект, ОбщиеПеременные, ОткрытыеГруппы, ПорядокДляГрупп = 0, ПорядокДляЭлемента = 50)

	ОбщиеПеременные.Вставить("ОткрытоПКЗ", Ложь);
	ОбщиеПеременные.Вставить("КодыПКО_ПКЗ", Новый Массив);

	Для каждого Правило Из Объект.Строки Цикл
		
		Если ТипЗнч(Объект) <> Тип("ДеревоЗначений") Тогда
			
			Если Объект.ПравилоКонвертацииСсылка = Правило.ПравилоКонвертацииСсылка Тогда
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		Если ТипЗнч(Правило.ПравилоКонвертацииСсылка) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
			ВыгрузитьПравилоКонвертацииОбъекта(мЗаписьXML,Правило, ОбщиеПеременные, ПорядокДляГрупп, ОткрытыеГруппы);
		Иначе
			ВыгрузитьПравилоКонвертацииПредопределенныхДанных(мЗаписьXML,Правило, ОбщиеПеременные, ПорядокДляГрупп, ПорядокДляЭлемента, ОткрытыеГруппы);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Осуществляет выгрузку ПКО в соответствующий XML-узел
//
// Параметры:
//  Узел           - XML-узел ПКО
//  Объект         - строка коллекции строк дерева значений, содержащая информацию о ПКО
// 
Процедура ВыгрузитьПравилоКонвертацииОбъекта(мЗаписьXML,Объект, ОбщиеПеременные, ПорядокДляГрупп, ОткрытыеГруппы)
	Если ПорядокДляГрупп = 0 Тогда
		ПорядокДляГрупп = 50;
	КонецЕсли;
	СсылкаПКО = Объект.ПравилоКонвертацииСсылка;
	
	Если СсылкаПКО <> null Тогда
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить("Код");
		МассивРеквизитов.Добавить("ОбъектКонфигурации");
		МассивРеквизитов.Добавить("ОбъектКонфигурацииКорреспондент");
		МассивРеквизитов.Добавить("Порядок");
		МассивРеквизитов.Добавить("Описание");
		МассивРеквизитов.Добавить("АлгоритмПередВыгрузкойОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПриВыгрузкеОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПослеВыгрузкиОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПослеВыгрузкиОбъектаВФайлОбмена");
		МассивРеквизитов.Добавить("АлгоритмПередЗагрузкойОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПриЗагрузкеОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПослеЗагрузкиОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПоследовательностьПолейПоиска");
		МассивРеквизитов.Добавить("НеЗамещать");
		МассивРеквизитов.Добавить("НеЗапоминатьВыгруженные");
		МассивРеквизитов.Добавить("ОбъектСДвижениями");
		МассивРеквизитов.Добавить("ВариантИдентификации");
		МассивРеквизитов.Добавить("НеВыгружатьОбъектыСвойствПоСсылкам");
		МассивРеквизитов.Добавить("НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска");
		МассивРеквизитов.Добавить("ИспользоватьБыстрыйПоискПриЗагрузке");
		МассивРеквизитов.Добавить("ГенерироватьНовыйНомерИлиКодЕслиНеУказан");
		МассивРеквизитов.Добавить("ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки");
		МассивРеквизитов.Добавить("ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD");
		МассивРеквизитов.Добавить("НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике");
		МассивРеквизитов.Добавить("ПриоритетОбъектовОбмена");

		ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаПКО, МассивРеквизитов);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИмяНастройкиДляАлгоритма,
		|	ИмяНастройкиДляПользователя,
		|	ОписаниеНастройкиДляПользователя
		|ИЗ Справочник.ПравилаКонвертацииОбъектов.НастройкаВариантовПоискаОбъектовXML
		|ГДЕ Ссылка = &СсылкаПКО";
		Запрос.УстановитьПараметр("СсылкаПКО", СсылкаПКО);
		ТаблицаВариантовПоиска = Запрос.Выполнить().Выгрузить();
		ДанныеПравила.Вставить("НастройкаВариантовПоискаОбъектовXML", ТаблицаВариантовПоиска);
		
		мЗаписьXML.ЗаписатьНачалоЭлемента("Правило");
		
		// Реквизиты правила
		ДобавитьЭлемент("Код", СокрЛП(ДанныеПравила.Код), мЗаписьXML);
		ДобавитьЭлемент("Наименование", ДанныеПравила.Код, мЗаписьXML);
		ДобавитьЭлемент("Порядок", ДанныеПравила.Порядок, мЗаписьXML);
		ДобавитьЭлемент("Описание", ДанныеПравила.Описание, мЗаписьXML);
		
		// СобытияВыгрузкиОбъекта
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПередВыгрузкойОбъекта, "ПередВыгрузкой", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПриВыгрузкеОбъекта, "ПриВыгрузке", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеВыгрузкиОбъекта, "ПослеВыгрузки", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена, "ПослеВыгрузкиВФайл", мЗаписьXML);
		
		// СобытияЗагрузкиОбъекта
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПередЗагрузкойОбъекта, "ПередЗагрузкой", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПриЗагрузкеОбъекта, "ПриЗагрузке", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеЗагрузкиОбъекта, "ПослеЗагрузки", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПоследовательностьПолейПоиска, "ПоследовательностьПолейПоиска", мЗаписьXML);		
		
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.НеЗамещать, "НеЗамещать", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.НеЗапоминатьВыгруженные, "НеЗапоминатьВыгруженные", мЗаписьXML);
		СинхронизироватьПоИдентификатору = (ДанныеПравила.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоУникальномуИдентификатору
									Или ДанныеПравила.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(СинхронизироватьПоИдентификатору, "СинхронизироватьПоИдентификатору", мЗаписьXML);
		ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли = (ДанныеПравила.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли, "ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.НеВыгружатьОбъектыСвойствПоСсылкам, "НеВыгружатьОбъектыСвойствПоСсылкам", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска, "НеСоздаватьЕслиНеНайден", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.ИспользоватьБыстрыйПоискПриЗагрузке, "ИспользоватьБыстрыйПоискПриЗагрузке", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.ГенерироватьНовыйНомерИлиКодЕслиНеУказан, "ГенерироватьНовыйНомерИлиКодЕслиНеУказан", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки, "ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD, "ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике, "НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике", мЗаписьXML);
		
		Если ЗначениеЗаполнено(ДанныеПравила.ПриоритетОбъектовОбмена)
			И ДанныеПравила.ПриоритетОбъектовОбмена <> Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаВыше Тогда
			
			Если ДанныеПравила.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаНиже Тогда
				ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая("Ниже", "ПриоритетОбъектовОбмена", мЗаписьXML);
			ИначеЕсли ДанныеПравила.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаСовпадает Тогда
				ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая("Совпадает", "ПриоритетОбъектовОбмена", мЗаписьXML);
			КонецЕсли;
		КонецЕсли;
				
		// Источник
		ДобавитьЭлемент("Источник", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПравила.ОбъектКонфигурации, "Наименование"), мЗаписьXML);
		
		// Приемник
		ДобавитьЭлемент("Приемник", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПравила.ОбъектКонфигурацииКорреспондент, "Наименование"), мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.ОбъектСДвижениями, "ОбъектСДвижениями", мЗаписьXML);
		// ТЧ настройки вариантов поиска
		ВыгрузитьИнформациюОНастройкахВариантовПоискаДляПКО(ДанныеПравила.НастройкаВариантовПоискаОбъектовXML, мЗаписьXML);
		
		// Свойства
		мЗаписьXML.ЗаписатьНачалоЭлемента("Свойства");
		ВыгрузитьПравилаКонвертацииСвойств(СсылкаПКО, ДанныеПравила, мЗаписьXML, ОбщиеПеременные);
		мЗаписьXML.ЗаписатьКонецЭлемента();
		// Значения (если есть)
		Запрос = Новый Запрос;
		Если ОбщиеПеременные.СовместнаяРабота Тогда
			Если ОбщиеПеременные.ПоСостояниюХранилища Тогда
				КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииПредопределенныхДанных");
			Иначе
				КОбработке = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииПредопределенныхДанных");
				Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			КонецЕсли;
			КОбработке = СтрЗаменить(КОбработке, "ГДЕ", "ГДЕ Правила.Ссылка.Код = &ИмяПравила И ");
			Запрос.Текст = "ВЫБРАТЬ
			|Ссылка
			|ПОМЕСТИТЬ КОбработке
			|ИЗ ( " + КОбработке + " ) КАК Свод
			|;
			|ВЫБРАТЬ
			|	Значения.Ссылка КАК Ссылка,
			|	Значения.НомерСтроки КАК НомерСтроки,
			|	Значения.ЗначениеКонфигурации КАК ЗначениеКонфигурации,
			|	Значения.ЗначениеКонфигурацииКорреспондент КАК ЗначениеКонфигурацииКорреспондент
			|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Значения
			|ГДЕ Значения.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)";

		Иначе
			Запрос.Текст = "ВЫБРАТЬ
			|	Значения.Ссылка КАК Ссылка,
			|	Значения.НомерСтроки КАК НомерСтроки,
			|	Значения.ЗначениеКонфигурации КАК ЗначениеКонфигурации,
			|	Значения.ЗначениеКонфигурацииКорреспондент КАК ЗначениеКонфигурацииКорреспондент
			|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Значения
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
			|ПО Значения.Ссылка = Состав.ЭлементКонвертации
			|ГДЕ Состав.Владелец = &Конвертация И Состав.Отключить = ЛОЖЬ
			|	И Значения.Ссылка.Код = &ИмяПравила И Значения.Ссылка.ПометкаУдаления = ЛОЖЬ";
		КонецЕсли;
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		Запрос.УстановитьПараметр("ИмяПравила", ДанныеПравила.Код);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			мЗаписьXML.ЗаписатьНачалоЭлемента("Значения");
			КоллекцияСтрок = РезультатЗапроса.Выгрузить();
			ПорядокЗначения = 50;
			Для Каждого ПКЗ Из КоллекцияСтрок Цикл
				мЗаписьXML.ЗаписатьНачалоЭлемента("Значение");
				// Реквизиты правила
				ДобавитьЭлемент("Код", ПКЗ.НомерСтроки, мЗаписьXML);
				ДобавитьЭлемент("Наименование", "" + ПКЗ.ЗначениеКонфигурации + " -> " + ПКЗ.ЗначениеКонфигурацииКорреспондент, мЗаписьXML);
				ДобавитьЭлемент("Порядок", ПорядокЗначения, мЗаписьXML);

				// Источник
			    ДобавитьЭлемент("Источник",  ПКЗ.ЗначениеКонфигурации, мЗаписьXML);
				// Приемник
				ДобавитьЭлемент("Приемник",  ПКЗ.ЗначениеКонфигурацииКорреспондент, мЗаписьXML);
				мЗаписьXML.ЗаписатьКонецЭлемента();
				ПорядокЗначения = ПорядокЗначения + 50;
			КонецЦикла;
			мЗаписьXML.ЗаписатьКонецЭлемента();  // Значения.
			
			МассивПКОПКЗ = ОбщиеПеременные.КодыПКО_ПКЗ;
			МассивПКОПКЗ.Добавить(СокрЛП(ДанныеПравила.Код));
			ОбщиеПеременные.Вставить("КодыПКО_ПКЗ", МассивПКОПКЗ);
		Иначе
			// Значения пустые.
			мЗаписьXML.ЗаписатьНачалоЭлемента("Значения");
			мЗаписьXML.ЗаписатьКонецЭлемента();  
		КонецЕсли;

		мЗаписьXML.ЗаписатьКонецЭлемента();

	ИначеЕсли ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
		ОбработатьВыгрузкуГруппыПравил(Объект.ГруппаПравил, ОткрытыеГруппы, мЗаписьXML, ПорядокДляГрупп);

		ВыгрузитьПравилаКонвертацииОбъектов(мЗаписьXML,Объект, ОбщиеПеременные, ПорядокДляГрупп, ОткрытыеГруппы);
	Иначе
		// Пустая группа.
		ВыгрузитьПравилаКонвертацииОбъектов(мЗаписьXML,Объект, ОбщиеПеременные, ПорядокДляГрупп, ОткрытыеГруппы);
	КонецЕсли;

КонецПроцедуры // ВыгрузитьПравилоКонвертацииОбъекта()

Процедура ВыгрузитьИнформациюОНастройкахВариантовПоискаДляПКО(ТаблицаВариантовПоиска, мЗаписьXML)
	Если ТаблицаВариантовПоиска.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	мЗаписьXML.ЗаписатьНачалоЭлемента("НастройкаВариантовПоискаОбъектов");
	Для Каждого СтрокаПоиска Из ТаблицаВариантовПоиска Цикл
		
		мЗаписьXML.ЗаписатьНачалоЭлемента("ВариантПоиска");
		
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(СтрокаПоиска.ИмяНастройкиДляАлгоритма, "ИмяНастройкиДляАлгоритма", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(СтрокаПоиска.ИмяНастройкиДляПользователя, "ИмяНастройкиДляПользователя", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(СтрокаПоиска.ОписаниеНастройкиДляПользователя, "ОписаниеНастройкиДляПользователя", мЗаписьXML);
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	мЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// Осуществляет выгрузку ПКС в соответствующий XML-узел
//
// Параметры:
//  Объект         - коллекция строк дерева значений, содержащая правила
//  Узел           - XML-узел коллекции ПКС
// 
Процедура ВыгрузитьПравилаКонвертацииСвойств(СсылкаНаПКО, ДанныеПКО, мЗаписьXML, ОбщиеПеременные)

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 1
	|ИЗ
	|	Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|ГДЕ
	|	ПравилаКонвертацииСвойств.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", СсылкаНаПКО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
		|	СвойстваИсточника.Ссылка,
		|	СвойстваИсточника.Наименование,
		|	СвойстваИсточника.Вид,
		|	СвойстваТипы.Тип.Наименование КАК НаименованиеТипа,
		|	СвойстваИсточника.Родитель.Наименование КАК Родитель,
		|	СвойстваИсточника.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
		|	ЕстьNULL(СвойстваТипы.НомерСтроки, 1) КАК НомерСтрокиТипа
		|ПОМЕСТИТЬ СвойстваИТипыИсточника
		|ИЗ Справочник.Свойства КАК СвойстваИсточника
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
		|ПО СвойстваТипы.Ссылка = СвойстваИсточника.Ссылка
		|ГДЕ СвойстваИсточника.Владелец = &ОбъектИсточник
		|;
		|ВЫБРАТЬ
		|	СвойстваПриемника.Ссылка,
		|	СвойстваПриемника.Наименование,
		|	СвойстваПриемника.Вид,
		|	СвойстваТипы.Тип.Наименование КАК НаименованиеТипа,
		|	СвойстваПриемника.Родитель.Наименование КАК Родитель,
		|	ЕстьNULL(СвойстваТипы.НомерСтроки, 1) КАК НомерСтрокиТипа
		|ПОМЕСТИТЬ СвойстваИТипыПриемника
		|ИЗ Справочник.Свойства КАК СвойстваПриемника
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
		|ПО СвойстваТипы.Ссылка = СвойстваПриемника.Ссылка
		|ГДЕ СвойстваПриемника.Владелец = &ОбъектПриемник
		|;
		|ВЫБРАТЬ
		|	ПравилаКонвертацииСвойств.Ссылка КАК Ссылка,
		|	ПравилаКонвертацииСвойств.Владелец,
		|	ПравилаКонвертацииСвойств.ЭтоГруппа,
		|	ПравилаКонвертацииСвойств.Код,
		|	ПравилаКонвертацииСвойств.Наименование,
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурации.Наименование КАК Источник,
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурацииКорреспондента.Наименование КАК Приемник,
		|	ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства КАК КодПравилаКонвертации,
		|	ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства КАК ИмяПравилаКонвертации,
		|	ПравилаКонвертацииСвойств.Комментарий,
		|	ПравилаКонвертацииСвойств.ПолучитьИзВходящихДанных,
		|	ПравилаКонвертацииСвойств.АлгоритмПередВыгрузкойСвойства,
		|	ПравилаКонвертацииСвойств.АлгоритмПриВыгрузкеСвойства,
		|	ПравилаКонвертацииСвойств.АлгоритмПослеВыгрузкиСвойства,
		|	ПравилаКонвертацииСвойств.АлгоритмПередОбработкойВыгрузки,
		|	ПравилаКонвертацииСвойств.АлгоритмПослеОбработкиВыгрузки,
		|	ПравилаКонвертацииСвойств.Поиск,
		|	ПравилаКонвертацииСвойств.Порядок,
		|	ПравилаКонвертацииСвойств.Отключить,
		|	ПравилаКонвертацииСвойств.НеЗамещать,
		|	ПравилаКонвертацииСвойств.АвтоматическиПриводитьЗначениеКДлинеПриемника,
		|	ПравилаКонвертацииСвойств.ИмяПараметраДляПередачи,
		|	ПравилаКонвертацииСвойств.ПоискПоДатеНаРавенство,
		|	ПравилаКонвертацииСвойств.ВыгружатьГруппуЧерезФайл,
		|
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурации.Наименование КАК НаименованиеИсточника,
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурации.Вид КАК ВидИсточника,
		|	СвойстваИсточника.НаименованиеТипа КАК НаименованиеТипаИсточника,
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурации.КвалификаторыСтроки_Длина КАК КвалификаторыСтроки_Длина,
		|	ВЫБОР КОГДА &ОбъектИсточникПВХ = ИСТИНА
		|		И ПравилаКонвертацииСвойств.СвойствоКонфигурации.Наименование = ""ТипЗначения"" Тогда
		|	ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ИсточникОпределениеТипа,
		|
		|	ВЫБОР
		|	КОГДА 1 В 
		|	(ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ СвойстваИТипыИсточника Т 
		|		ГДЕ Ссылка = ПравилаКонвертацииСвойств.СвойствоКонфигурации 
		|		СГРУППИРОВАТЬ ПО Ссылка ИМЕЮЩИЕ Количество(*) = 1) 
		|	ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЕдинственныйТипИсточника,
		|
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурацииКорреспондента.Наименование КАК НаименованиеПриемника,
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурацииКорреспондента.Вид КАК ВидПриемника,
		|	СвойстваПриемника.НаименованиеТипа КАК НаименованиеТипаПриемника,
		|
		|	ВЫБОР КОГДА &ОбъектПриемникПВХ = ИСТИНА
		|		И ПравилаКонвертацииСвойств.СвойствоКонфигурацииКорреспондента.Наименование = ""ТипЗначения"" Тогда
		|	ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПриемникОпределениеТипа,
		|	ВЫБОР
		|	КОГДА 1 В 
		|	(ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ СвойстваИТипыПриемника Т 
		|		ГДЕ Т.Ссылка = ПравилаКонвертацииСвойств.СвойствоКонфигурацииКорреспондента 
		|		СГРУППИРОВАТЬ ПО Ссылка ИМЕЮЩИЕ Количество(*) = 1) 
		|	ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЕдинственныйТипПриемника,
		|	ВЫБОР КОГДА СвойстваПриемника.Наименование ПОДОБНО ""%ЭтоГруппа%""
		|	ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОбязательноеСвойство_ЭтоГруппа
		|
		|	ИЗ
		|		Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств

		|ЛЕВОЕ СОЕДИНЕНИЕ СвойстваИТипыИсточника КАК СвойстваИсточника 
		|ПО СвойстваИсточника.Ссылка = ПравилаКонвертацииСвойств.СвойствоКонфигурации
		|		И СвойстваИсточника.НомерСтрокиТипа = 1

		|
		|ЛЕВОЕ СОЕДИНЕНИЕ СвойстваИТипыПриемника КАК СвойстваПриемника 
		|ПО СвойстваПриемника.Ссылка = ПравилаКонвертацииСвойств.СвойствоКонфигурацииКорреспондента
		|		И СвойстваПриемника.НомерСтрокиТипа = 1
		|	ГДЕ ПравилаКонвертацииСвойств.Владелец = &Владелец
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаКонвертацииСвойств.Порядок,
		|	СвойствоКонфигурации.Наименование,
		|	СвойствоКонфигурацииКорреспондента.Наименование,
		|	Код
		|ИТОГИ Максимум(ЭтоГруппа),
		|	Максимум(ПравилаКонвертацииСвойств.СвойствоКонфигурации.Наименование),
		|	Максимум(ПравилаКонвертацииСвойств.СвойствоКонфигурации.Вид),
		|	Максимум(СвойстваИсточника.НаименованиеТипа)

		|ПО 
		|	Ссылка ИЕРАРХИЯ
		|";
	Запрос.УстановитьПараметр("Владелец", СсылкаНаПКО);
	Запрос.УстановитьПараметр("ОбъектИсточник", ДанныеПКО.ОбъектКонфигурации);
	Запрос.УстановитьПараметр("ОбъектПриемник", ДанныеПКО.ОбъектКонфигурацииКорреспондент);
	Запрос.УстановитьПараметр("ОбъектИсточникПВХ", (ДанныеПКО.ОбъектКонфигурации.Тип = Перечисления.ТипыОбъектов.ПланВидовХарактеристик));
	Запрос.УстановитьПараметр("ОбъектПриемникПВХ", (ДанныеПКО.ОбъектКонфигурацииКорреспондент.Тип = Перечисления.ТипыОбъектов.ПланВидовХарактеристик));

	ДеревоРезультата = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ПорядокДляГруппы = 50;
	ПорядокДляЭлемента = 50;
	ВыгрузитьСтрокиДереваПКС(ДеревоРезультата.Строки, ОбщиеПеременные, мЗаписьXML, ПорядокДляГруппы, ПорядокДляЭлемента, Истина);	
	
КонецПроцедуры

Процедура ВыгрузитьСтрокиДереваПКС(Строки, ОбщиеПеременные, мЗаписьXML, ПорядокДляГруппы, ПорядокДляЭлемента, ЗаписыватьЭлементы = Ложь)
	Для Каждого СтрокаДерева Из Строки Цикл
		
		Если ЗаписыватьЭлементы Тогда
			
			Если СтрокаДерева.ЭтоГруппа Тогда
				мЗаписьXML.ЗаписатьНачалоЭлемента("Группа");
			Иначе
				мЗаписьXML.ЗаписатьНачалоЭлемента("Свойство");
			КонецЕсли;
			
		КонецЕсли;
		
		
		СтрокиПодчиненного =  СтрокаДерева.Строки;
		
		КоличествоПодчиненныхСтрок = СтрокаДерева.Строки.Количество();
		
		Если КоличествоПодчиненныхСтрок = 0 Тогда
			
			ВыгрузитьПравилоКонвертацииСвойства(СтрокаДерева, ОбщиеПеременные, мЗаписьXML, ПорядокДляГруппы, ПорядокДляЭлемента);
			
		Иначе
			
			// Это не конечная строка.
			// Спускаемся на самый нижний уровень.
			СтрокаПодчиненная = СтрокиПодчиненного.Найти(СтрокаДерева.Ссылка, "Ссылка");
			Если СтрокаПодчиненная.Строки.Количество() > 0 Тогда
				ВыгрузитьСтрокиДереваПКС(СтрокаПодчиненная.Строки, ОбщиеПеременные, мЗаписьXML, ПорядокДляГруппы, ПорядокДляЭлемента, Ложь);
			Иначе
				ВыгрузитьПравилоКонвертацииСвойства(СтрокаПодчиненная, ОбщиеПеременные, мЗаписьXML, ПорядокДляГруппы, ПорядокДляЭлемента);
			КонецЕсли;
			
			СтрокиПодчиненного.Удалить(СтрокаПодчиненная);
			Если КоличествоПодчиненныхСтрок > 1 Тогда
				ВыгрузитьСтрокиДереваПКС(СтрокиПодчиненного, ОбщиеПеременные, мЗаписьXML, ПорядокДляГруппы, ПорядокДляЭлемента, Истина);
			КонецЕсли;
		КонецЕсли;
		
		
		Если ЗаписыватьЭлементы Тогда	
			мЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

// Осуществляет выгрузку ПКС в соответствующий XML-узел
//
// Параметры:
//  Узел           - XML-узел ПКС
//  Объект         - строка коллекции строк дерева значений, содержащая информацию о ПКС
// 
Процедура ВыгрузитьПравилоКонвертацииСвойства(ОбъектПКС, ОбщиеПеременные, мЗаписьXML, ПорядокДляГруппы, ПорядокДляЭлемента)

	Если НЕ ОбъектПКС.ЭтоГруппа Тогда
		
		Если ОбъектПКС.Отключить Тогда
			УстановитьАтрибут("Отключить", ОбъектПКС.Отключить, мЗаписьXML);
		КонецЕсли;
		
		Если ОбъектПКС.Поиск Тогда
			УстановитьАтрибут("Поиск",     ОбъектПКС.Поиск, мЗаписьXML);
		КонецЕсли;
		
		Если ОбъектПКС.ОбязательноеСвойство_ЭтоГруппа Тогда
			УстановитьАтрибут("Обязательное", Истина, мЗаписьXML);
		КонецЕсли;
		
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ОбъектПКС.НеЗамещать, "НеЗамещать", мЗаписьXML);
						
		// Реквизиты правила
		ДобавитьЭлемент("Код",          ОбъектПКС.Код, мЗаписьXML);
		Наименование = СтрЗаменить(ОбъектПКС.Наименование, "{", "");
		Наименование = СтрЗаменить(Наименование, "}", "");
		ДобавитьЭлемент("Наименование", Наименование, мЗаписьXML);
		//ДобавитьЭлемент("Порядок", ПорядокДляЭлемента, мЗаписьXML);
		Если ЗначениеЗаполнено(ОбъектПКС.Порядок) Тогда
			ДобавитьЭлемент("Порядок", ОбъектПКС.Порядок, мЗаписьXML);

		Иначе
			ДобавитьЭлемент("Порядок", ПорядокДляЭлемента, мЗаписьXML);
			ПорядокДляЭлемента = ПорядокДляЭлемента + 50;
		КонецЕсли;
		ДобавитьЭлемент("Комментарий",  ОбъектПКС.Комментарий, мЗаписьXML);

		// ПолучитьИзВходящихДанных
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ОбъектПКС.ПолучитьИзВходящихДанных, "ПолучитьИзВходящихДанных", мЗаписьXML);
		
		// Источник
		мЗаписьXML.ЗаписатьНачалоЭлемента("Источник");
		
		НаименованиеИсточника = СтрЗаменить(ОбъектПКС.НаименованиеИсточника,"{", "");
		НаименованиеИсточника = СтрЗаменить(НаименованиеИсточника,"}", "");
		УстановитьАтрибут("Имя", НаименованиеИсточника, мЗаписьXML);
		УстановитьАтрибут("Вид", ИмяЗначенияПеречисления(ОбъектПКС.ВидИсточника, ОбщиеПеременные), мЗаписьXML);
		
		Если ОбъектПКС.ЕдинственныйТипИсточника = Истина Тогда
			
			УстановитьАтрибут("Тип", ОбъектПКС.НаименованиеТипаИсточника, мЗаписьXML);
		ИначеЕсли ОбъектПКС.ИсточникОпределениеТипа = Истина Тогда
			УстановитьАтрибут("Тип", "ОпределениеТипа", мЗаписьXML);
		КонецЕсли; 
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
		
		// Приемник
		мЗаписьXML.ЗаписатьНачалоЭлемента("Приемник");
		
		НаименованиеПриемника = СтрЗаменить(ОбъектПКС.НаименованиеПриемника,"{", "");
		НаименованиеПриемника = СтрЗаменить(НаименованиеПриемника,"}", "");  	
		УстановитьАтрибут("Имя", НаименованиеПриемника, мЗаписьXML);
		УстановитьАтрибут("Вид", ИмяЗначенияПеречисления(ОбъектПКС.ВидПриемника, ОбщиеПеременные), мЗаписьXML);
		
		Если ОбъектПКС.ЕдинственныйТипПриемника = Истина Тогда
			
			УстановитьАтрибут("Тип", ОбъектПКС.НаименованиеТипаПриемника, мЗаписьXML);
		ИначеЕсли ОбъектПКС.ПриемникОпределениеТипа = Истина Тогда
			УстановитьАтрибут("Тип", "ОпределениеТипа", мЗаписьXML);	
		КонецЕсли; 
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
		
		// КодПравилаКонвертации
		ДобавитьЭлемент("КодПравилаКонвертации", ОбъектПКС.КодПравилаКонвертации, мЗаписьXML);
		
		Если ОбъектПКС.АвтоматическиПриводитьЗначениеКДлинеПриемника 
			И ОбъектПКС.КвалификаторыСтроки_Длина <> 0 Тогда
			
			ДобавитьЭлемент("ПриводитьКДлине", ОбъектПКС.КвалификаторыСтроки_Длина, мЗаписьXML);
			
		КонецЕсли;
		
		ДобавитьЭлемент("ИмяПараметраДляПередачи", ОбъектПКС.ИмяПараметраДляПередачи, мЗаписьXML);
		
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ОбъектПКС.ПоискПоДатеНаРавенство, "ПоискПоДатеНаРавенство", мЗаписьXML);
		
		// СобытияВыгрузкиСвойства
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПередВыгрузкойСвойства, "ПередВыгрузкой", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПриВыгрузкеСвойства, "ПриВыгрузке", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПослеВыгрузкиСвойства, "ПослеВыгрузки", мЗаписьXML);
	Иначе
		
		// Отключить
		Если ОбъектПКС.Отключить Тогда
			УстановитьАтрибут("Отключить", ОбъектПКС.Отключить, мЗаписьXML);
		КонецЕсли;
		
		// Реквизиты группы правил
		ДобавитьЭлемент("Код",          ОбъектПКС.Код, мЗаписьXML);
		ДобавитьЭлемент("Наименование", ОбъектПКС.Наименование, мЗаписьXML);
		
		Если ЗначениеЗаполнено(ОбъектПКС.Ссылка.Порядок) Тогда
			ДобавитьЭлемент("Порядок", ОбъектПКС.Ссылка.Порядок, мЗаписьXML);
		Иначе
			ДобавитьЭлемент("Порядок", ПорядокДляГруппы, мЗаписьXML); 
			ПорядокДляГруппы = ПорядокДляГруппы + 50;
		КонецЕсли;
		ДобавитьЭлемент("Комментарий",  ОбъектПКС.Комментарий, мЗаписьXML);
		
		// НеЗамещать
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ОбъектПКС.НеЗамещать, "НеЗамещать", мЗаписьXML);
		
		// КодПравилаКонвертации
		ДобавитьЭлемент("КодПравилаКонвертации", ОбъектПКС.КодПравилаКонвертации, мЗаписьXML);

		// ПолучитьИзВходящихДанных
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ОбъектПКС.ПолучитьИзВходящихДанных, "ПолучитьИзВходящихДанных", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ОбъектПКС.ВыгружатьГруппуЧерезФайл, "ВыгружатьГруппуЧерезФайл", мЗаписьXML);
		
		// Источник
		мЗаписьXML.ЗаписатьНачалоЭлемента("Источник");
		НаименованиеИсточника = СтрЗаменить(ОбъектПКС.НаименованиеИсточника,"{", "");
		НаименованиеИсточника = СтрЗаменить(НаименованиеИсточника,"}", "");
		УстановитьАтрибут("Имя", НаименованиеИсточника, мЗаписьXML);
		УстановитьАтрибут("Вид", ИмяЗначенияПеречисления(ОбъектПКС.ВидИсточника, ОбщиеПеременные), мЗаписьXML);
		
		мЗаписьXML.ЗаписатьКонецЭлемента();

		// Приемник
		мЗаписьXML.ЗаписатьНачалоЭлемента("Приемник");
		НаименованиеПриемника = СтрЗаменить(ОбъектПКС.НаименованиеПриемника,"{", "");
		НаименованиеПриемника = СтрЗаменить(НаименованиеПриемника,"}", "");  	
		УстановитьАтрибут("Имя", НаименованиеПриемника, мЗаписьXML);
		УстановитьАтрибут("Вид", ИмяЗначенияПеречисления(ОбъектПКС.ВидПриемника, ОбщиеПеременные), мЗаписьXML);
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
		
		// СобытияВыгрузкиГруппы
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПередОбработкойВыгрузки, "ПередОбработкойВыгрузки", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПередВыгрузкойСвойства, "ПередВыгрузкой", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПриВыгрузкеСвойства, "ПриВыгрузке", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПослеВыгрузкиСвойства, "ПослеВыгрузки", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ОбъектПКС.АлгоритмПослеОбработкиВыгрузки, "ПослеОбработкиВыгрузки", мЗаписьXML);
		
		ПорядокДляЭлемента = 50;
	КонецЕсли;

КонецПроцедуры // ВыгрузитьПравилоКонвертацииСвойства()

Процедура ВыгрузитьПравилоКонвертацииПредопределенныхДанных(мЗаписьXML,Объект, ОбщиеПеременные, ПорядокДляГруппы, ПорядокДляЭлемента, ОткрытыеГруппы)
	СсылкаПКПД = Объект.ПравилоКонвертацииСсылка;
	
	Если СсылкаПКПД <> Null Тогда
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить("Код");
		МассивРеквизитов.Добавить("ОбъектКонфигурации");
		МассивРеквизитов.Добавить("ОбъектКонфигурацииКорреспондент");
		МассивРеквизитов.Добавить("АлгоритмПередВыгрузкойОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПриВыгрузкеОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПослеВыгрузкиОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПослеВыгрузкиОбъектаВФайлОбмена");
		МассивРеквизитов.Добавить("АлгоритмПередЗагрузкойОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПриЗагрузкеОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПослеЗагрузкиОбъекта");

		ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаПКПД, МассивРеквизитов);
		
		// Возможно значения уже выгрузили в составе ПКС.
		Если ОбщиеПеременные.КодыПКО_ПКЗ.Найти(СокрЛП(ДанныеПравила.Код)) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		мЗаписьXML.ЗаписатьНачалоЭлемента("Правило");
		
		// Реквизиты правила
		ДобавитьЭлемент("Код", СокрЛП(ДанныеПравила.Код), мЗаписьXML);
		ДобавитьЭлемент("Наименование", ДанныеПравила.Код, мЗаписьXML);
		ДобавитьЭлемент("Порядок", ПорядокДляЭлемента, мЗаписьXML);
		// Источник
		ДобавитьЭлемент("Источник", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПравила.ОбъектКонфигурации, "Наименование"), мЗаписьXML);
		
		// Приемник
		ДобавитьЭлемент("Приемник", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПравила.ОбъектКонфигурацииКорреспондент, "Наименование"), мЗаписьXML);
		// СобытияВыгрузкиОбъекта
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПередВыгрузкойОбъекта, "ПередВыгрузкой", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПриВыгрузкеОбъекта, "ПриВыгрузке", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеВыгрузкиОбъекта, "ПослеВыгрузки", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена, "ПослеВыгрузкиВФайл", мЗаписьXML);
		
		// СобытияЗагрузкиОбъекта
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПередЗагрузкойОбъекта, "ПередЗагрузкой", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПриЗагрузкеОбъекта, "ПриЗагрузке", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеЗагрузкиОбъекта, "ПослеЗагрузки", мЗаписьXML);

		// Свойства пустые.
		мЗаписьXML.ЗаписатьНачалоЭлемента("Свойства");
		мЗаписьXML.ЗаписатьКонецЭлемента();
		// Значения
		мЗаписьXML.ЗаписатьНачалоЭлемента("Значения");
		
		ЗапросЗначения = Новый Запрос;
		ЗапросЗначения.Текст = "ВЫБРАТЬ
		|	ПКПД.НомерСтроки КАК Код,
		|	ПКПД.ЗначениеКонфигурации КАК ЗначениеКонфигурации,
		|	ПКПД.ЗначениеКонфигурацииКорреспондент КАК ЗначениеКонфигурацииКорреспондент
		|
		|ИЗ
		|	Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК ПКПД
		|ГДЕ ПКПД.Ссылка = &Ссылка
		|УПОРЯДОЧИТЬ ПО Код";
		ЗапросЗначения.УстановитьПараметр("Ссылка", СсылкаПКПД);
		ТабПКЗ = ЗапросЗначения.Выполнить().Выгрузить();
		ОбщиеПеременные.ОткрытоПКЗ = Истина;
		
		// Выгрузка ПКЗ.
		ПорядокДляЗначения = 50;
		Для Каждого ПКЗ Из ТабПКЗ Цикл
			ВыгрузитьПравилоКонвертацииЗначения(мЗаписьXML,ПКЗ, ПорядокДляЗначения);
			ПорядокДляЗначения = ПорядокДляЗначения + 50;
		КонецЦикла;
		// Значения.
		мЗаписьXML.ЗаписатьКонецЭлемента();
		// Правило.
		мЗаписьXML.ЗаписатьКонецЭлемента();
		ПорядокДляЭлемента = ПорядокДляЭлемента + 50;
	ИначеЕсли ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
		ОбработатьВыгрузкуГруппыПравил(Объект.ГруппаПравил, ОткрытыеГруппы, мЗаписьXML, ПорядокДляГруппы);

		ВыгрузитьПравилаКонвертацииОбъектов(мЗаписьXML, Объект, ОбщиеПеременные, ОткрытыеГруппы, ПорядокДляГруппы, ПорядокДляЭлемента);
		
		ПорядокДляЭлемента = 50;
	Иначе
		// Пустая группа.
		ВыгрузитьПравилаКонвертацииОбъектов(мЗаписьXML, Объект, ОбщиеПеременные, ОткрытыеГруппы, ПорядокДляГруппы, ПорядокДляЭлемента);
	КонецЕсли;

КонецПроцедуры

Процедура ВыгрузитьПравилоКонвертацииЗначения(мЗаписьXML,Объект, Порядок)
	мЗаписьXML.ЗаписатьНачалоЭлемента("Значение");

	// Реквизиты правила
	ДобавитьЭлемент("Код", Объект.Код, мЗаписьXML);
	ДобавитьЭлемент("Наименование", "" + Объект.ЗначениеКонфигурации + " --> " + Объект.ЗначениеКонфигурацииКорреспондент, мЗаписьXML);
	ДобавитьЭлемент("Порядок", Порядок, мЗаписьXML);
	// Источник
    ДобавитьЭлемент("Источник",  Объект.ЗначениеКонфигурации, мЗаписьXML);
	
	// Приемник
	ДобавитьЭлемент("Приемник",  Объект.ЗначениеКонфигурацииКорреспондент, мЗаписьXML);
	
	мЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

// Осуществляет выгрузку ПВД в соответствующий XML-узел
//
// Параметры:
//  Объект         - коллекция строк дерева значений, содержащая правила
//  Узел           - XML-узел коллекции ПВД
// 
Процедура ВыгрузитьПравилаВыгрузкиДанных(мЗаписьXML, ОбщиеПеременные, Объект = Неопределено, ОткрытыеГруппы, ПорядокДляГруппы = 50)
	Для каждого Правило Из Объект.Строки Цикл
		
		Если ТипЗнч(Объект) <> Тип("ДеревоЗначений") Тогда
			
			Если Объект.ПравилоВыгрузкиДанныхСсылка = Правило.ПравилоВыгрузкиДанныхСсылка Тогда
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыгрузитьПравилоВыгрузкиДанных(мЗаписьXML, ОбщиеПеременные, Правило, ПорядокДляГруппы, ОткрытыеГруппы);
		
	КонецЦикла;

КонецПроцедуры // ВыгрузитьПравилаВыгрузкиДанных()

// Осуществляет выгрузку ПВД в соответствующий XML-узел
//
// Параметры:
//  Узел           - XML-узел ПВД
//  Объект         - строка коллекции строк дерева значений, содержащая информацию о ПВД
// 
Процедура ВыгрузитьПравилоВыгрузкиДанных(мЗаписьXML, ОбщиеПеременные, Объект, ПорядокДляГруппы, ОткрытыеГруппы)

	ПВД = Объект.ПравилоВыгрузкиДанныхСсылка;
	
	Если ЗначениеЗаполнено(ПВД) Тогда
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить("Наименование");
		МассивРеквизитов.Добавить("ОбъектВыборки");
		МассивРеквизитов.Добавить("ПравилоКонвертацииОбъекта");
		МассивРеквизитов.Добавить("Порядок");
		МассивРеквизитов.Добавить("СпособВыборки");
		МассивРеквизитов.Добавить("Отключить");
		МассивРеквизитов.Добавить("АлгоритмПередОбработкойПравила");
		МассивРеквизитов.Добавить("АлгоритмПослеОбработкиПравила");
		МассивРеквизитов.Добавить("АлгоритмПередВыгрузкойОбъекта");
		МассивРеквизитов.Добавить("АлгоритмПослеВыгрузкиОбъекта");
		МассивРеквизитов.Добавить("ВыбиратьДанныеДляВыгрузкиОднимЗапросом");
		МассивРеквизитов.Добавить("НеВыгружатьОбъектыСозданныеВБазеПриемнике");
		МассивРеквизитов.Добавить("Описание");
		МассивРеквизитов.Добавить("Комментарий");

		ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПВД, МассивРеквизитов);
		мЗаписьXML.ЗаписатьНачалоЭлемента("Правило");

		УстановитьАтрибут("Отключить", ДанныеПравила.Отключить, мЗаписьXML);
		
		// Реквизиты правила
		ДобавитьЭлемент("Код", ДанныеПравила.Наименование, мЗаписьXML);
		ДобавитьЭлемент("Наименование", ДанныеПравила.Наименование, мЗаписьXML);
		ДобавитьЭлемент("Порядок", ДанныеПравила.Порядок, мЗаписьXML);
		ДобавитьЭлемент("КодПравилаКонвертации", ДанныеПравила.ПравилоКонвертацииОбъекта, мЗаписьXML);
		ДобавитьЭлемент("СпособОтбораДанных", ?(ДанныеПравила.СпособВыборки = 0,"СтандартнаяВыборка","ПроизвольныйАлгоритм"), мЗаписьXML);
		ДобавитьЭлемент("ОбъектВыборки", СокрЛП(ДанныеПравила.ОбъектВыборки), мЗаписьXML);
		
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.ВыбиратьДанныеДляВыгрузкиОднимЗапросом, "ВыбиратьДанныеДляВыгрузкиОднимЗапросом", мЗаписьXML);
		ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ДанныеПравила.НеВыгружатьОбъектыСозданныеВБазеПриемнике, "НеВыгружатьОбъектыСозданныеВБазеПриемнике", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.Описание, "Описание", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.Комментарий, "Комментарий", мЗаписьXML);
		
		// СобытияВыгрузкиДанных
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПередОбработкойПравила, "ПередОбработкойПравила", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПередВыгрузкойОбъекта, "ПередВыгрузкойОбъекта", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеВыгрузкиОбъекта, "ПослеВыгрузкиОбъекта", мЗаписьXML);
		ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ДанныеПравила.АлгоритмПослеОбработкиПравила, "ПослеОбработкиПравила", мЗаписьXML);
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
		
		// ищем порядок. 
		СтрПорядок = ОбщиеПеременные.ПорядокГруппПВД.НайтиСтроки(Новый Структура("ГруппаПравил", Объект.ГруппаПравил));
		Если СтрПорядок <> Неопределено Тогда
			ПорядокДляГруппыЛок = СтрПорядок[0].Порядок;
			ОбработатьВыгрузкуГруппыПравил(Объект.ГруппаПравил, ОткрытыеГруппы, мЗаписьXML, ПорядокДляГруппыЛок);
		Иначе
			ОбработатьВыгрузкуГруппыПравил(Объект.ГруппаПравил, ОткрытыеГруппы, мЗаписьXML, ПорядокДляГруппы);
		КонецЕсли;
		
		ВыгрузитьПравилаВыгрузкиДанных(мЗаписьXML,ОбщиеПеременные, Объект, ОткрытыеГруппы, ПорядокДляГруппы);
		
	Иначе
		// Пустая группа.
		ВыгрузитьПравилаВыгрузкиДанных(мЗаписьXML, ОбщиеПеременные, Объект, ОткрытыеГруппы, ПорядокДляГруппы);
	КонецЕсли;

КонецПроцедуры // ВыгрузитьПравилоВыгрузкиДанных()

Процедура ОбработатьВыгрузкуГруппыПравил(ГруппаПравил, ОткрытыеГруппы, мЗаписьXML, ПорядокДляГруппы = 0, ЭтоАлгоритмИлиЗапрос = Ложь)
	ИерархияГруппы = СтрРазделить(СокрЛП(ГруппаПравил), "\", Ложь);
	// Возможно, надо закрыть отркытые ранее группы.
	Если ОткрытыеГруппы.Количество() > 0 Тогда
		ГруппыКУдалению = Новый Массив;
		Для Инд = 1 По ОткрытыеГруппы.Количество() Цикл
			КрайняяГруппа = ОткрытыеГруппы[ОткрытыеГруппы.Количество() - Инд];
			Если ИерархияГруппы.Найти(КрайняяГруппа) = Неопределено Тогда
				мЗаписьXML.ЗаписатьКонецЭлемента();
				ГруппыКУдалению.Добавить(ОткрытыеГруппы.Количество() - Инд);
			КонецЕсли;
		Конеццикла;
		Для Каждого Инд Из ГруппыКУдалению Цикл
			ОткрытыеГруппы.Удалить(Инд);
		КонецЦикла;
	КонецЕсли;
	// Возможно, надо открыть новые группы.
	Для Инд = 0 По ИерархияГруппы.Количество()-1 Цикл
		ВерхняяГруппа = ИерархияГруппы[Инд];
		Если ОткрытыеГруппы.Найти(ВерхняяГруппа) = Неопределено Тогда
			ОткрытыеГруппы.Добавить(ВерхняяГруппа);
			
			мЗаписьXML.ЗаписатьНачалоЭлемента("Группа");
			Если ЭтоАлгоритмИлиЗапрос Тогда
				УстановитьАтрибут("Имя", ВерхняяГруппа, мЗаписьXML);
			Иначе
				УстановитьАтрибут("Отключить", Ложь, мЗаписьXML);
				ДобавитьЭлемент("Код",          ВерхняяГруппа, мЗаписьXML);
				ДобавитьЭлемент("Наименование", ВерхняяГруппа, мЗаписьXML);
				ДобавитьЭлемент("Порядок", ПорядокДляГруппы, мЗаписьXML);
				ПорядокДляГруппы = ПорядокДляГруппы + 50; 				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗакрытьГруппы(мЗаписьXML, ОткрытыеГруппы)
	Если ОткрытыеГруппы.Количество() > 0 Тогда
		Для Инд = 1 По ОткрытыеГруппы.Количество() Цикл
			мЗаписьXML.ЗаписатьКонецЭлемента();
		Конеццикла;
	КонецЕсли;
	ОткрытыеГруппы = Новый Массив;
КонецПроцедуры

// Осуществляет выгрузку Алгоритмов в соответствующий XML-узел
//
// Параметры:
//  Объект         - коллекция строк дерева значений, содержащая правила
//  Узел           - XML-узел коллекции ПВД
// 
Процедура ВыгрузитьАлгоритмы(мЗаписьXML, Объект = Неопределено, ОткрытыеГруппы = Неопределено)

	Для каждого Правило Из Объект.Строки Цикл
		
		Если ТипЗнч(Объект) <> Тип("ДеревоЗначений") Тогда
			
			Если Объект.АлгоритмСсылка = Правило.АлгоритмСсылка Тогда
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыгрузитьАлгоритм(мЗаписьXML,Правило, ОткрытыеГруппы);
		
	КонецЦикла;

КонецПроцедуры // ВыгрузитьЗапросы()

// Осуществляет выгрузку алгоритма в соответствующий XML-узел
//
// Параметры:
//  Узел           - XML-узел ПВД
//  Объект         - строка коллекции строк дерева значений, содержащая информацию о ПВД
// 
Процедура ВыгрузитьАлгоритм(мЗаписьXML,Объект, ОткрытыеГруппы)

	Алгоритм = Объект.АлгоритмСсылка;
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить("Код");
		МассивРеквизитов.Добавить("Алгоритм");
		МассивРеквизитов.Добавить("ИспользуетсяПриЗагрузке");
		МассивРеквизитов.Добавить("Параметры");
		ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Алгоритм, МассивРеквизитов);

		мЗаписьXML.ЗаписатьНачалоЭлемента("Алгоритм");

		УстановитьАтрибут("Имя", СокрЛП(ДанныеПравила.Код), мЗаписьXML);
		УстановитьАтрибут("ИспользуетсяПриЗагрузке", ДанныеПравила.ИспользуетсяПриЗагрузке, мЗаписьXML);

		ДобавитьЭлемент("Текст", ДанныеПравила.Алгоритм, мЗаписьXML);
		ДобавитьЭлемент("Параметры", ДанныеПравила.Параметры, мЗаписьXML);
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
		ОбработатьВыгрузкуГруппыПравил(Объект.ГруппаПравил, ОткрытыеГруппы, мЗаписьXML, 0, Истина);

		ВыгрузитьАлгоритмы(мЗаписьXML,Объект, ОткрытыеГруппы);
		
	Иначе
		// Пустая группа.
		ВыгрузитьАлгоритмы(мЗаписьXML,Объект, ОткрытыеГруппы);
	КонецЕсли;

КонецПроцедуры // ВыгрузитьАлгоритм()

// Осуществляет выгрузку Запросов в соответствующий XML-узел
//
// Параметры:
//  Объект         - коллекция строк дерева значений, содержащая правила
//  Узел           - XML-узел коллекции ПВД
// 
Процедура ВыгрузитьЗапросы(мЗаписьXML, Объект = Неопределено, ОткрытыеГруппы)

	Для каждого Правило Из Объект.Строки Цикл
		
		Если ТипЗнч(Объект) <> Тип("ДеревоЗначений") Тогда
			
			Если Объект.ЗапросСсылка = Правило.ЗапросСсылка Тогда
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВыгрузитьЗапрос(мЗаписьXML,Правило, ОткрытыеГруппы);
		
	КонецЦикла;

КонецПроцедуры // ВыгрузитьЗапросы()

// Осуществляет выгрузку запроса в соответствующий XML-узел
//
// Параметры:
//  Узел           - XML-узел ПВД
//  Объект         - строка коллекции строк дерева значений, содержащая информацию о ПВД
// 
Процедура ВыгрузитьЗапрос(мЗаписьXML,Объект, ОткрытыеГруппы)

	Запрос = Объект.ЗапросСсылка;
	
	Если ЗначениеЗаполнено(Запрос) Тогда
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить("Код");
		МассивРеквизитов.Добавить("ТекстЗапроса");
		МассивРеквизитов.Добавить("ИспользуетсяПриЗагрузке");
		МассивРеквизитов.Добавить("Комментарий");
		ДанныеПравила = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запрос, МассивРеквизитов);

		мЗаписьXML.ЗаписатьНачалоЭлемента("Запрос");

		УстановитьАтрибут("Имя", СокрЛП(ДанныеПравила.Код), мЗаписьXML);
		УстановитьАтрибут("ИспользуетсяПриЗагрузке", ДанныеПравила.ИспользуетсяПриЗагрузке, мЗаписьXML);

		ДобавитьЭлемент("Текст", ДанныеПравила.ТекстЗапроса, мЗаписьXML);
		ДобавитьЭлемент("Комментарий", ДанныеПравила.Комментарий, мЗаписьXML);
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
		ОбработатьВыгрузкуГруппыПравил(Объект.ГруппаПравил, ОткрытыеГруппы, мЗаписьXML, 0, Истина);


		ВыгрузитьЗапросы(мЗаписьXML,Объект, ОткрытыеГруппы);
		
	Иначе
		// Пустая группа.
		ВыгрузитьЗапросы(мЗаписьXML,Объект, ОткрытыеГруппы);
	КонецЕсли;

КонецПроцедуры // ВыгрузитьПравилоВыгрузкиДанных()

// Осуществляет иерархический выбор ПКО с помощью запроса.
// Используется для осуществления выгрузки правил с учетом иерархии.
//
// Возвращаемое значение:
//  Записи результата запроса в виде дерева значений.
// 
Функция ВыполнитьЗапросПКО(ОбщиеПеременные)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		Если ОбщиеПеременные.ПоСостояниюХранилища Тогда
			КОбработке1 = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииОбъектов"); 
			КОбработке2 = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииПредопределенныхДанных");
		Иначе
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			КОбработке1 = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов");
			КОбработке2 = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииПредопределенныхДанных");
		КонецЕсли;
		КОбработке = КОбработке1 + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС + КОбработке2;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|;
		|ВЫБРАТЬ 
		|	ВЫРАЗИТЬ(ПравилаКонвертацииОбъектов.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	ПравилаКонвертацииОбъектов.Порядок КАК Порядок,
		|	ПравилаКонвертацииОбъектов.Код КАК Код,
		|	ИСТИНА КАК ЕстьПКС,
		|	ПравилаКонвертацииОбъектов.Ссылка КАК ПравилоКонвертацииСсылка
		|ПОМЕСТИТЬ ТабПравилаВсе
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
		|ГДЕ
		|	ПравилаКонвертацииОбъектов.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ 
		|	ВЫРАЗИТЬ(ПравилаКонвертацииПредопределенныхДанных.ГруппаПравил КАК Строка(100)),
		|	ПравилаКонвертацииПредопределенныхДанных.Порядок,
		|	ПравилаКонвертацииПредопределенныхДанных.Код,
		|	ЛОЖЬ,
		|	ПравилаКонвертацииПредопределенныхДанных.Ссылка
		|ИЗ
		|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПравилаКонвертацииПредопределенныхДанных
		|ГДЕ
		|	ПравилаКонвертацииПредопределенныхДанных.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке) 
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппаПравил,
		|	Порядок,
		|	Код,
		|	ЕстьПКС,
		|	ПравилоКонвертацииСсылка
		|ИЗ ТабПравилаВсе
		|УПОРЯДОЧИТЬ ПО
		|	ТабПравилаВсе.ГруппаПравил,
		|	ТабПравилаВсе.Порядок,
		|	ТабПравилаВсе.Код,
		|	ТабПравилаВсе.ЕстьПКС УБЫВ
		|ИТОГИ ПО ГруппаПравил
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ 
		|	ВЫРАЗИТЬ(ПравилаКонвертацииОбъектов.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	ПравилаКонвертацииОбъектов.Порядок,
		|	ПравилаКонвертацииОбъектов.Код КАК Код,
		|	ИСТИНА КАК ЕстьПКС,
		|	ПравилаКонвертацииОбъектов.Ссылка КАК ПравилоКонвертацииСсылка
		|ПОМЕСТИТЬ ТабПравилаВсе
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК Состав
		|	ПО
		|		Состав.ЭлементКонвертации = ПравилаКонвертацииОбъектов.Ссылка
		|	ГДЕ
		|		Состав.Владелец = &Конвертация И Состав.Отключить = ЛОЖЬ
		|ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ 
		|	ВЫРАЗИТЬ(ПравилаКонвертацииПредопределенныхДанных.ГруппаПравил КАК Строка(100)),
		|	ПравилаКонвертацииПредопределенныхДанных.Порядок,
		|	ПравилаКонвертацииПредопределенныхДанных.Код КАК Код,
		|	ЛОЖЬ КАК ЕстьПКС,
		|	ПравилаКонвертацииПредопределенныхДанных.Ссылка
		|ИЗ
		|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПравилаКонвертацииПредопределенныхДанных
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК Состав
		|	ПО
		|		Состав.ЭлементКонвертации = ПравилаКонвертацииПредопределенныхДанных.Ссылка
		|	ГДЕ
		|		Состав.Владелец = &Конвертация И Состав.Отключить = ЛОЖЬ 
		|
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппаПравил,
		|	Порядок,
		|	Код,
		|	ЕстьПКС,
		|	ПравилоКонвертацииСсылка
		|ИЗ ТабПравилаВсе
		|УПОРЯДОЧИТЬ ПО
		|	ТабПравилаВсе.ГруппаПравил,
		|	ТабПравилаВсе.Порядок,
		|	ТабПравилаВсе.Код,
		|	ТабПравилаВсе.ЕстьПКС УБЫВ
		|ИТОГИ ПО ГруппаПравил
		|";
	КонецЕсли;

	РезЗапроса = Запрос.Выполнить();

	Возврат РезЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции // ВыполнитьЗапросПКО()

// Осуществляет иерархический выбор ПВД с помощью запроса.
// Используется для осуществления выгрузки правил с учетом иерархии.
//
// Возвращаемое значение:
//  Записи результата запроса в виде дерева значений.
// 
Функция ВыполнитьЗапросПВД(ОбщиеПеременные)

	Запрос = Новый Запрос;  
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	ТекстЗапросаПорядокГрупп = "";
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		
		Если ОбщиеПеременные.ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаОбработкиДанных");
		Иначе
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			КОбработке = ТекстЗапросаСвоиДоработки("ПравилаОбработкиДанных");
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|;
		|";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПравилаВыгрузкиДанных.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ КОбработке
		|
		|ИЗ
		|	Справочник.ПравилаОбработкиДанных КАК ПравилаВыгрузкиДанных
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК Состав
		|	ПО
		|		Состав.ЭлементКонвертации = ПравилаВыгрузкиДанных.Ссылка
		|ГДЕ
		|	Состав.Владелец = &Конвертация И Состав.Отключить = ЛОЖЬ
		|;
		|";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ПравилаВыгрузкиДанных.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	ПравилаВыгрузкиДанных.Ссылка КАК ПравилоВыгрузкиДанныхСсылка
		|
		|ИЗ
		|	Справочник.ПравилаОбработкиДанных КАК ПравилаВыгрузкиДанных
		|ГДЕ
		|	ПравилаВыгрузкиДанных.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫРАЗИТЬ(ПравилаВыгрузкиДанных.ГруппаПравил КАК Строка(100)),
		|	ПравилаВыгрузкиДанных.Порядок,
		|	ПравилаВыгрузкиДанных.Наименование
		|ИТОГИ ПО
		|	ГруппаПравил
		|
		|";
	
	РезЗапроса = Запрос.Выполнить();
	ТаблицаПВД = РезЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);   
	ЗапросПорядокГрупп = Новый Запрос;
	ЗапросПорядокГрупп.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросПорядокГрупп.Текст = "ВЫБРАТЬ 
	|	ВЫРАЗИТЬ(ПравилаВыгрузкиДанных.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
	|	МИНИМУМ(ПравилаВыгрузкиДанных.Порядок) КАК Порядок
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПравилаВыгрузкиДанных
	|ГДЕ
	|	ПравилаВыгрузкиДанных.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|СГРУППИРОВАТЬ ПО 
	|	ВЫРАЗИТЬ(ПравилаВыгрузкиДанных.ГруппаПравил КАК Строка(100))
	|"; 
	ТаблицаПорядокГрупп = ЗапросПорядокГрупп.Выполнить().Выгрузить();
	ОбщиеПеременные.Вставить("ПорядокГруппПВД", ТаблицаПорядокГрупп);
	
	Возврат ТаблицаПВД;
	
КонецФункции // ВыполнитьЗапросПВД()

// Осуществляет иерархический выбор Алгоритмов с помощью запроса.
// Используется для осуществления выгрузки алгоритмов с учетом иерархии.
//
// Возвращаемое значение:
//  Записи результата запроса в виде дерева значений.
// 
Функция ВыполнитьЗапросАлгоритмы(ОбщиеПеременные)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		Если ОбщиеПеременные.ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("Алгоритмы");
		Иначе
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			КОбработке = ТекстЗапросаСвоиДоработки("Алгоритмы");
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|;
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Алгоритмы.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	Алгоритмы.Ссылка КАК АлгоритмСсылка,
		|	Алгоритмы.Код
		|
		|ИЗ
		|	Справочник.Алгоритмы КАК Алгоритмы
		|ГДЕ
		|	Алгоритмы.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
		|УПОРЯДОЧИТЬ ПО
		|	ВЫРАЗИТЬ(Алгоритмы.ГруппаПравил КАК Строка(100)),
		|	Алгоритмы.Код
		|ИТОГИ ПО
		|	ГруппаПравил	
		|
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Алгоритмы.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	Алгоритмы.Ссылка КАК АлгоритмСсылка,
		|	Алгоритмы.Код
		|
		|ИЗ
		|	Справочник.Алгоритмы КАК Алгоритмы
		|	
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК Состав
		|	ПО
		|		Состав.ЭлементКонвертации = Алгоритмы.Ссылка
		|ГДЕ
		|	Состав.Владелец = &Конвертация И Состав.Отключить = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		|	ВЫРАЗИТЬ(Алгоритмы.ГруппаПравил КАК Строка(100)),
		|	Алгоритмы.Код
		|ИТОГИ ПО
		|	ГруппаПравил		
		|
		|";
	КонецЕсли;

	РезЗапроса = Запрос.Выполнить();

	Возврат РезЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции // ВыполнитьЗапросАлгоритмы()

// Осуществляет иерархический выбор Запросов с помощью запроса.
// Используется для осуществления выгрузки запросов с учетом иерархии.
//
// Возвращаемое значение:
//  Записи результата запроса в виде дерева значений.
// 
Функция ВыполнитьЗапросЗапросы(ОбщиеПеременные)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		Если ОбщиеПеременные.ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("Запросы");
		Иначе
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			КОбработке = ТекстЗапросаСвоиДоработки("Запросы");
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|;
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Запросы.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	Запросы.Код,
		|	Запросы.Ссылка КАК ЗапросСсылка
		|	
		|ИЗ
		|	Справочник.Запросы КАК Запросы
		|ГДЕ
		|	Запросы.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫРАЗИТЬ(Запросы.ГруппаПравил КАК Строка(100)),
		|	Запросы.Код
		|ИТОГИ ПО
		|	ГруппаПравил";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Запросы.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	Запросы.Код,
		|	Запросы.Ссылка КАК ЗапросСсылка
		|	
		|ИЗ
		|	Справочник.Запросы КАК Запросы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК Состав
		|	ПО
		|		Состав.ЭлементКонвертации = Запросы.Ссылка
		|ГДЕ
		|	Состав.Владелец = &Конвертация И Состав.Отключить = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		|	ВЫРАЗИТЬ(Запросы.ГруппаПравил КАК Строка(100)),
		|	Запросы.Код
		|ИТОГИ ПО
		|	ГруппаПравил		
		|
		|";
	КонецЕсли;

	РезЗапроса = Запрос.Выполнить();

	Возврат РезЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции // ВыполнитьЗапросЗапросы()

// Осуществляет выгрузку реквизитов конвертации в соответствующий XML-узел
//
// Параметры:
//  Узел           - XML-узел реквизитов конвертации
// 
Процедура ВыгрузитьРеквизитыКонвертации(мЗаписьXML, ОбщиеПеременные)
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Наименование");
	МассивРеквизитов.Добавить("Конфигурация");
	МассивРеквизитов.Добавить("КонфигурацияКорреспондент");
	МассивРеквизитов.Добавить("АлгоритмПослеЗагрузкиПравилОбмена");
	МассивРеквизитов.Добавить("АлгоритмПередПолучениемИзмененныхОбъектов");
	МассивРеквизитов.Добавить("АлгоритмПослеПолученияИнформацииОбУзлахОбмена");
	МассивРеквизитов.Добавить("АлгоритмПередВыгрузкойДанных");
	МассивРеквизитов.Добавить("АлгоритмПослеВыгрузкиДанных");
	МассивРеквизитов.Добавить("АлгоритмПередВыгрузкойОбъекта");
	МассивРеквизитов.Добавить("АлгоритмПередКонвертациейОбъекта");
	МассивРеквизитов.Добавить("АлгоритмПослеВыгрузкиОбъекта");
	МассивРеквизитов.Добавить("АлгоритмПередЗагрузкойОбъекта");
	МассивРеквизитов.Добавить("АлгоритмПослеЗагрузкиОбъекта");
	МассивРеквизитов.Добавить("АлгоритмПередОтправкойИнформацииОбУдалении");
	МассивРеквизитов.Добавить("АлгоритмПриПолученииИнформацииОбУдалении");
	МассивРеквизитов.Добавить("АлгоритмПослеЗагрузкиПараметров");
	МассивРеквизитов.Добавить("АлгоритмПередЗагрузкойДанных");
	МассивРеквизитов.Добавить("АлгоритмПослеЗагрузкиДанных");


	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбщиеПеременные.Конвертация, 
		МассивРеквизитов);
	ОбщиеПеременные.Вставить("Конфигурация", ДанныеКонвертации.Конфигурация);
	ОбщиеПеременные.Вставить("КонфигурацияКорреспондент", ДанныеКонвертации.КонфигурацияКорреспондент);

	мЗаписьXML.ЗаписатьНачалоЭлемента("ВерсияФормата");
	Стр = XMLСтрока("2.01");
	мЗаписьXML.ЗаписатьТекст(Стр);
	мЗаписьXML.ЗаписатьКонецЭлемента();
	ДобавитьЭлемент("Ид", Строка(ОбщиеПеременные.Конвертация.УникальныйИдентификатор()), мЗаписьXML);
	ДобавитьЭлемент("Наименование",      Строка(ДанныеКонвертации.Наименование), мЗаписьXML);
	ДобавитьЭлемент("ДатаВремяСоздания", ТекущаяДатаСеанса(), мЗаписьXML);

	ВыгрузитьДанныеПоКонфигурации("Источник", ДанныеКонвертации.Конфигурация, мЗаписьXML);
	ВыгрузитьДанныеПоКонфигурации("Приемник", ДанныеКонвертации.КонфигурацияКорреспондент, мЗаписьXML);
	
	
	// События конвертации.
	ДобавитьЭлемент("ПослеЗагрузкиПравилОбмена",     Строка(ДанныеКонвертации.АлгоритмПослеЗагрузкиПравилОбмена), мЗаписьXML);
	ДобавитьЭлемент("ПередПолучениемИзмененныхОбъектов",     Строка(ДанныеКонвертации.АлгоритмПередПолучениемИзмененныхОбъектов), мЗаписьXML);
	ДобавитьЭлемент("ПослеПолученияИнформацииОбУзлахОбмена",  Строка(ДанныеКонвертации.АлгоритмПослеПолученияИнформацииОбУзлахОбмена), мЗаписьXML);
		
	ДобавитьЭлемент("ПередВыгрузкойДанных",     Строка(ДанныеКонвертации.АлгоритмПередВыгрузкойДанных), мЗаписьXML);
	ДобавитьЭлемент("ПослеВыгрузкиДанных",      Строка(ДанныеКонвертации.АлгоритмПослеВыгрузкиДанных), мЗаписьXML);
		
	ДобавитьЭлемент("ПередЗагрузкойДанных",     Строка(ДанныеКонвертации.АлгоритмПередЗагрузкойДанных), мЗаписьXML);
	ДобавитьЭлемент("ПослеЗагрузкиДанных",      Строка(ДанныеКонвертации.АлгоритмПослеЗагрузкиДанных), мЗаписьXML);
		
	ДобавитьЭлемент("ПередВыгрузкойОбъекта",    Строка(ДанныеКонвертации.АлгоритмПередВыгрузкойОбъекта), мЗаписьXML);
	ДобавитьЭлемент("ПередКонвертациейОбъекта", Строка(ДанныеКонвертации.АлгоритмПередКонвертациейОбъекта), мЗаписьXML);
		
	ДобавитьЭлемент("ПослеВыгрузкиОбъекта",     Строка(ДанныеКонвертации.АлгоритмПослеВыгрузкиОбъекта), мЗаписьXML);
	ДобавитьЭлемент("ПередЗагрузкойОбъекта",    Строка(ДанныеКонвертации.АлгоритмПередЗагрузкойОбъекта), мЗаписьXML);
	ДобавитьЭлемент("ПослеЗагрузкиОбъекта",     Строка(ДанныеКонвертации.АлгоритмПослеЗагрузкиОбъекта), мЗаписьXML);
		
	ДобавитьЭлемент("ПередОтправкойИнформацииОбУдалении",   Строка(ДанныеКонвертации.АлгоритмПередОтправкойИнформацииОбУдалении), мЗаписьXML);
	ДобавитьЭлемент("ПриПолученииИнформацииОбУдалении",     Строка(ДанныеКонвертации.АлгоритмПриПолученииИнформацииОбУдалении), мЗаписьXML);
		
	ДобавитьЭлемент("ПослеЗагрузкиПараметров",     Строка(ДанныеКонвертации.АлгоритмПослеЗагрузкиПараметров), мЗаписьXML);
		
	// Выгрузка параметров конвертации
	мЗаписьXML.ЗаписатьНачалоЭлемента("Параметры");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Параметр КАК Имя,
	|	ИспользуетсяПриЗагрузке КАК ИспользуетсяПриЗагрузке,
	|	УстанавливатьВДиалоге КАК УстанавливатьВДиалоге,
	|	ТипОбъекта КАК ТипОбъекта,
	|	ТипОбъекта.Наименование КАК ТипОбъектаНаименование,
	|	ПередаватьПараметрПриВыгрузке КАК ПередаватьПараметрПриВыгрузке,
	|	ПравилоКонвертации КАК ПравилоКонвертации
	|ИЗ Справочник.Конвертации.Параметры
	|ГДЕ Ссылка = &Конвертация";
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		мЗаписьXML.ЗаписатьНачалоЭлемента("Параметр");
		
		УстановитьАтрибут("Имя",                   СокрЛП(Выборка.Имя), мЗаписьXML);
		УстановитьАтрибут("Наименование",          СокрЛП(Выборка.Имя), мЗаписьXML);
		УстановитьАтрибут("ИспользуетсяПриЗагрузке", XMLСтрока(Выборка.ИспользуетсяПриЗагрузке), мЗаписьXML);
		УстановитьАтрибут("УстанавливатьВДиалоге", XMLСтрока(Выборка.УстанавливатьВДиалоге), мЗаписьXML);
		Если ЗначениеЗаполнено(Выборка.ТипОбъекта) Тогда
			УстановитьАтрибут("ТипЗначения", Выборка.ТипОбъектаНаименование, мЗаписьXML);
		КонецЕсли;
		
		УстановитьАтрибут("ПередаватьПараметрПриВыгрузке", XMLСтрока(Выборка.ПередаватьПараметрПриВыгрузке), мЗаписьXML);
		
		Если ЗначениеЗаполнено(Выборка.ПравилоКонвертации) Тогда
			УстановитьАтрибут("ПравилоКонвертации", XMLСтрока(Выборка.ПравилоКонвертации), мЗаписьXML);
		КонецЕсли;
		
		мЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	мЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры // ВыгрузитьРеквизитыКонвертации()

Процедура ВыгрузитьДанныеПоКонфигурации(Имя, Конфигурация, мЗаписьXML)
	ДанныеКонфигурации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конфигурация, "Приложение, Имя, Версия, Синоним");
	мЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	
	Стр = XMLСтрока(ДанныеКонфигурации.Имя);
	УстановитьАтрибут("ВерсияПлатформы",     ПолучитьПредставлениеПриложения(ДанныеКонфигурации.Приложение), мЗаписьXML);
	УстановитьАтрибут("ВерсияКонфигурации",  ДанныеКонфигурации.Версия, мЗаписьXML);
	УстановитьАтрибут("СинонимКонфигурации", ДанныеКонфигурации.Синоним, мЗаписьXML);
	
	мЗаписьXML.ЗаписатьТекст(Стр);
	
	мЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ПолучитьПредставлениеПриложения(Приложение)
	
	Если      Приложение = Перечисления.Приложения.Предприятие77         Тогда Возврат "7.7";
	ИначеЕсли Приложение = Перечисления.Приложения.Предприятие80         Тогда Возврат "8.0";
	ИначеЕсли Приложение = Перечисления.Приложения.УправляемоеПриложение Тогда Возврат "8.0";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ВыгрузитьБулевоЗначениеТолькоЕслиИстина(ЗначениеЭлемента, ИмяСохранения, мЗаписьXML)
	
	Если Не ЗначениеЭлемента Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЭлемент(ИмяСохранения, ЗначениеЭлемента, мЗаписьXML);
	
КонецПроцедуры

Процедура ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(ЗначениеЭлемента, ИмяСохранения, мЗаписьXML)
	
	Если ПустаяСтрока(ЗначениеЭлемента) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЭлемент(ИмяСохранения, ЗначениеЭлемента, мЗаписьXML);
	
КонецПроцедуры


Процедура ДобавитьЭлемент(Имя, Значение, мЗаписьXML)

	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	мЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	Стр = XMLСтрока(Значение);
	
	мЗаписьXML.ЗаписатьТекст(Стр);
	мЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

// Устанавливает атрибут указанного xml-узла
//
// Параметры: 
//  Узел           - xml-узел
//  Имя            - имя атрибута
//  Значение       - устанавливаемое значение
//
Процедура УстановитьАтрибут(Имя, Значение, мЗаписьXML)

	Если Значение = Null Тогда
		СтрокаЗаписи = "";
	Иначе
		СтрокаЗаписи = XMLСтрока(Значение);
	КонецЕсли;
	
	мЗаписьXML.ЗаписатьАтрибут(Имя, СтрокаЗаписи);
	
КонецПроцедуры

// Возвращает строку - имя переданного значения перечисления
//
// Параметры:
//  Значение       - Значение перечисления
//  ОбщиеПеременные - Структура, содержит общие переменные обработки.
//
// Возвращаемое значение:
//  Строка - имя переданного значения перечисления
//
Функция ИмяЗначенияПеречисления(Значение, ОбщиеПеременные)
	Если Значение = Null
		Или Значение.Пустая() Тогда
	
		Возврат "";
	КонецЕсли;

	СоответствиеПеречисленийИИмен = Неопределено;
	ОбщиеПеременные.Свойство("СоответствиеПеречисленийИИмен", СоответствиеПеречисленийИИмен);
	Если СоответствиеПеречисленийИИмен = Неопределено Тогда
		СоответствиеПеречисленийИИмен = Новый Соответствие;
		ЗначениеСоответствия = Неопределено;
	Иначе
		ЗначениеСоответствия = СоответствиеПеречисленийИИмен.Получить(Значение);
	КонецЕсли;
	Если ЗначениеСоответствия <> Неопределено Тогда
		Возврат ЗначениеСоответствия;
	КонецЕсли;
	ОбъектМД = Значение.Метаданные();
	ИндексЗначения = Перечисления[ОбъектМД.Имя].Индекс(Значение);

	ЗначениеСоответствия = ОбъектМД.ЗначенияПеречисления[ИндексЗначения].Имя;
	СоответствиеПеречисленийИИмен.Вставить(Значение, ЗначениеСоответствия);
	ОбщиеПеременные.Вставить("СоответствиеПеречисленийИИмен", СоответствиеПеречисленийИИмен);
	Возврат ЗначениеСоответствия;
КонецФункции // ИмяЗначенияПеречисления()

Функция ТекстЗапросаВсеИзХранилища(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И (Правила.Захвачен = ЛОЖЬ
	|	ИЛИ Правила.Копия = ИСТИНА)";
КонецФункции

Функция ТекстЗапросаСвоиДоработки(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Захвачен = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник." + ИмяСправочника +"
	|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
	|ПО ДанныеЗахвата.РабочаяКопия = Правила.Ссылка
	|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Копия = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник." + ИмяСправочника +"
	|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
	|ПО ДанныеЗахвата.Объект = Правила.Ссылка
	|	И ДанныеЗахвата.Пользователь = &ТекущийПользователь
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Копия = ЛОЖЬ И Правила.Захвачен = ИСТИНА
	|";
	
КонецФункции

#КонецОбласти
#КонецЕсли