#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныйПрограммныйИнтерфейс

// Формирует настройки для последующей выгрузки и сохранения модулей.
// Параметры:
//		Конвертация - СправочникСсылка.Конвертации - Конвертация модули которой выгружаются
//		ИменаФайловДляСохранения - Структура - содержит имена файлов для выгрузки каждого модуля.
//		НастройкиВыгрузки - Структура - содержит общие настройки выгрузки модулей.
Процедура ПодготовитьНастройкиВыгрузкиМодулей(Конвертация, ИменаФайловДляСохранения, НастройкиВыгрузки) Экспорт
	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конвертация, "ИмяФайлаДляСохранения, ИспользоватьРазделениеМодуля, СпособВыгрузкиРазделенногоМодуля"); 
	Если ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		НастройкиВыгрузки.Вставить("ИмяКаталога", ДанныеКонвертации.ИмяФайлаДляСохранения);
		НастройкиВыгрузки.Вставить("ВыгрузкаВТХТ", ДанныеКонвертации.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ФайлыTXT); 
		НастройкиВыгрузки.Вставить("ВыгрузкаВХМЛ", ДанныеКонвертации.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ФайлыXML);  
		НастройкиВыгрузки.Вставить("ТегиДляМодуляМенеджера", КонвертацияДанныхXDTOСервер.ТегиДляМодуляМенеджераОбъекта());
		РежимОчисткиМодулейМенеджера = Неопределено;
		НастройкиВыгрузки.Свойство("РежимОчисткиМодулейМенеджера", РежимОчисткиМодулейМенеджера);
		Если РежимОчисткиМодулейМенеджера = Истина Тогда
			Возврат;
		КонецЕсли;

		Если ДанныеКонвертации.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ФайлыXML Тогда
			МестоВыгрузки = "" + ДанныеКонвертации.ИмяФайлаДляСохранения + "\CommonModules\%ИмяМодуля%\Ext\Module.bsl";
		Иначе 
			МестоВыгрузки = "" + ДанныеКонвертации.ИмяФайлаДляСохранения + "\%ИмяМодуля%.txt";
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Наименование
		|ИЗ Справочник.ДополнительныеМодули
		|ГДЕ Владелец = &Конвертация";
		Запрос.УстановитьПараметр("Конвертация", Конвертация);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			МестоВыгрузкиМодуля = СтрЗаменить(МестоВыгрузки, "%ИмяМодуля%", СокрЛП(Выборка.Наименование));
			ИменаФайловДляСохранения.Вставить(СокрЛП(Выборка.Наименование), МестоВыгрузкиМодуля);
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(ДанныеКонвертации.ИмяФайлаДляСохранения) Тогда
		ИменаФайловДляСохранения.Вставить("МенеджерОбменаЧерезУниверсальныйФормат", ДанныеКонвертации.ИмяФайлаДляСохранения);
	КонецЕсли;

КонецПроцедуры

// Определяет текст заголовка команды выгрузки модуля в зависимости от настроек конвертации.
// Параметры:
//		Конвертация - СправочникСсылка.Конвертации 
// Возвращаемое значение:
//		Структура
//			* ЗаголовокКоманды
//			* Подсказка
Функция ПолучитьТекстЗаголовкаКомандыВыгрузкиМодуля(Конвертация) Экспорт 
	ТекстКнопки = НСтр("ru='Сохранить модуль менеджера обмена'");
	Подсказка = НСтр("ru='Модуль будет помещен в буфер обмена'");
	Результат = Новый Структура("ЗаголовокКоманды, Подсказка", ТекстКнопки, Подсказка);
	Если НЕ ЗначениеЗаполнено(Конвертация) Тогда
		Возврат Результат;
	КонецЕсли;
	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конвертация, "СпособВыгрузкиРазделенногоМодуля, ИспользоватьРазделениеМодуля, ИмяФайлаДляСохранения");
	Если НЕ ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		Если ЗначениеЗаполнено(ДанныеКонвертации.ИмяФайлаДляСохранения) Тогда
			Подсказка = НСтр("ru='Модуль будет сохранен в текстовый файл'");
			Результат.Вставить("Подсказка", Подсказка);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	Если ДанныеКонвертации.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ФайлыTXT Тогда
		ТекстКнопки = НСтр("ru='Сохранить модули в общий каталог'");
		Подсказка = НСтр("ru='Модули будут сохранены в текстовые файлы'");
	Иначе
		ТекстКнопки = НСтр("ru='Сохранить модуль в файлы конфигурации'");
		Подсказка = НСтр("ru='Будут обновлены файлы в которые выгружалась конфигурация'");
	КонецЕсли; 
	Результат.Вставить("Подсказка", Подсказка);
	Результат.Вставить("ЗаголовокКоманды", ТекстКнопки);
	Возврат Результат;
КонецФункции
#КонецОбласти	
#КонецЕсли