#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ЗаполнитьНаименованиеПКС(Наименование, ПараметрыПКС) Экспорт
	Если ПараметрыПКС.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO Тогда
		// Для конвертаций XDTO наименование перезаполняем всегда т.к. оно не выведено на форму.
		Если ПараметрыПКС.ИспользоватьДляОтправки И ПараметрыПКС.ИспользоватьДляПолучения Тогда
			Разделитель = " <--> ";
		ИначеЕсли ПараметрыПКС.ИспользоватьДляОтправки Тогда
			Разделитель = " --> ";
		Иначе
			Разделитель = " <-- ";
		КонецЕсли;
		Если ПараметрыПКС.ЭтоГруппа Тогда
			Если НЕ ЗНачениеЗаполнено(ПараметрыПКС.СвойствоКонфигурации) И ЗначениеЗаполнено(ПараметрыПКС.СвойствоКонфигурацииСтрокой) Тогда
				Наименование = "" + СокрЛП(ПараметрыПКС.СвойствоКонфигурацииСтрокой) + Разделитель + ПараметрыПКС.СвойствоФормата;
			Иначе
				Наименование = "" + СокрЛП(ПараметрыПКС.СвойствоКонфигурации) + Разделитель + ПараметрыПКС.СвойствоФормата;
			КонецЕсли;
		Иначе
			Наименование = "" + ПараметрыПКС.ПолноеИмяСвойстваКонфигурации + Разделитель + ПараметрыПКС.ПолноеИмяСвойстваФормата;
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(Наименование) Тогда
		// Для конвертаций XML заполняем только пустое наименование, т.к. оно может загрузиться из файла правил либо быть заполнено вручную.
		Если ПараметрыПКС.ЭтоГруппа Тогда
			Наименование = "" + СокрЛП(ПараметрыПКС.СвойствоКонфигурации) + " --> " + СокрЛП(ПараметрыПКС.СвойствоКонфигурацииКорреспондента);
		Иначе
			Наименование = "" + СокрЛП(ПараметрыПКС.СвойствоКонфигурации) + " --> " + 
				?(ПустаяСтрока(ПараметрыПКС.ИмяПараметраДляПередачи), СокрЛП(ПараметрыПКС.СвойствоКонфигурацииКорреспондента), ПараметрыПКС.ИмяПараметраДляПередачи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли