#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭлементКонвертации", ПараметрКоманды);
	ПараметрыФормы.Вставить("СписокКонвертаций",  ПараметрыВыполненияКоманды.Источник.СписокКонвертаций);
	
	ОткрытьФорму("ОбщаяФорма.ВопросВхождениеВСоставКонвертаций",
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

#КонецОбласти