#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Заголовок = Параметры.ЗаголовокФормыВыбора;
	МассивПереданныхЗначений = Параметры.МассивВыбранныхЗначений;
	// Если есть выбранные значения их добавляем первыми.
	Для Каждого Элемент Из МассивПереданныхЗначений Цикл
		Если  Параметры.МассивДоступныхЗначений.Найти(Элемент) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НовоеЗначение = СписокВыбираемыхЗначений.Добавить();
		НовоеЗначение.Представление = Элемент;
		НовоеЗначение.Ключ = Элемент;
		НовоеЗначение.Идентификатор = Элемент;
		НовоеЗначение.Пометка = Истина;
	КонецЦикла;
	// Добавляем остальные доступные значения
	Для Каждого Элемент Из Параметры.МассивДоступныхЗначений Цикл
		Если  МассивПереданныхЗначений.Найти(Элемент) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НовоеЗначение = СписокВыбираемыхЗначений.Добавить();
		НовоеЗначение.Представление = Элемент;
		НовоеЗначение.Ключ = Элемент;
		НовоеЗначение.Идентификатор = Элемент;
		НовоеЗначение.Пометка = Ложь;  		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	МассивВыбранныхЗначений = Новый Массив;
	Для Каждого Элемент Из СписокВыбираемыхЗначений Цикл
		Если Элемент.Пометка Тогда
			МассивВыбранныхЗначений.Добавить(Элемент.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗакрытияФормы = Новый Структура();
	ПараметрыЗакрытияФормы.Вставить("МассивВыбранныхЗначений", МассивВыбранныхЗначений);
	
	ОповеститьОВыборе(ПараметрыЗакрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	
	ЗаполнитьОтметки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ЗаполнитьОтметки(Истина);
	
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОтметки(ЗначениеОтметки)
	
	ТаблицаЗаполняемыхЗначений = СписокВыбираемыхЗначений.Выгрузить();
	ТаблицаЗаполняемыхЗначений.ЗаполнитьЗначения(ЗначениеОтметки, "Пометка");
	СписокВыбираемыхЗначений.Загрузить(ТаблицаЗаполняемыхЗначений);
	
КонецПроцедуры
#КонецОбласти