#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
	Элементы.ОтборПоРодителю.Доступность = ИспользоватьОтборПоРодителю;
	Элементы.ОтборПоСтатусу.Доступность = ИспользоватьОтборПоСтатусу;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонвертацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	Если Элементы.Конвертации.ТекущиеДанные.ЭтоГруппа = Истина Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("парКонвертация", Элементы.Конвертации.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Обработка.НастройкаПравилОбмена.Форма", ПараметрыФормы,, Элементы.Конвертации.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяКонфигурацияИсточникПриИзменении(Элемент)
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяКонфигурацияПриемникПриИзменении(Элемент)
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдалениеПриИзменении(Элемент)
	ОбновитьСписокКонвертаций();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИзменитьПометкуНаУдалениеКонвертации(Команда)
	ТекКонвертация = Элементы.Конвертации.ТекущиеДанные.Ссылка;
	ТекПометкаУдаления = Элементы.Конвертации.ТекущиеДанные.ПометкаУдаления;
	ТекстВопроса = НСтр("ru='Выполнить %1% для %2%?'");
	Если ТекПометкаУдаления Тогда
		НовПометкаУдаления = Ложь;
		ТекстВопроса = НСтр("ru='Снять с %1% пометку удаления?'");
	Иначе
		НовПометкаУдаления = Истина;
		ТекстВопроса = НСтр("ru='Пометить %1% на удаление?'");
	КонецЕсли;
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%1%", СокрЛП(ТекКонвертация));
	ОповещениеОтвет = Новый ОписаниеОповещения("ВыборИзменитьПометкуНаУдалениеКонвертации", ЭтотОбъект, Новый Структура("НовПометкаУдаления, Ссылка", НовПометкаУдаления, ТекКонвертация));
	ПоказатьВопрос(ОповещениеОтвет, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СохранитьЗначенияНастроек()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ТекущаяКонфигурацияИсточник", ТекущаяКонфигурацияИсточник);
	СтруктураНастроек.Вставить("ТекущаяКонфигурацияПриемник", ТекущаяКонфигурацияПриемник);
	СтруктураНастроек.Вставить("ОтборПоСтатусу", ОтборПоСтатусу);
	СтруктураНастроек.Вставить("ИспользоватьОтборПоСтатусу", ИспользоватьОтборПоСтатусу);


	КонвертацияДанныхXDTOВызовСервера.ЗаписатьНастройкиПользователя(СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначенияНастроек()
	
	СтруктураНастроек = КонвертацияДанныхXDTOВызовСервера.НастройкиПользователя();
	ТекущаяКонфигурацияИсточник = СтруктураНастроек.ТекущаяКонфигурацияИсточник;
	ТекущаяКонфигурацияПриемник = СтруктураНастроек.ТекущаяКонфигурацияПриемник;
	ИспользоватьОтборПоСтатусу = СтруктураНастроек.ИспользоватьОтборПоСтатусу;
	ОтборПоСтатусу = СтруктураНастроек.ОтборПоСтатусу;
	Элементы.ГруппаОтборПоСтатусу.Видимость = Истина;
	Если Константы.СовместнаяРабота.Получить() = Ложь Тогда
		ИспользоватьОтборПоСтатусу = Ложь;
		Элементы.ГруппаОтборПоСтатусу.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокКонвертаций()
	Конвертации.ПолучитьЭлементы().Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Конвертации.Родитель,
	|	Конвертации.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
	|	Конвертации.Ссылка,
	|	Конвертации.Наименование КАК Наименование,
	|	Конвертации.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР 
	|		КОГДА Конвертации.ПометкаУдаления И Конвертации.ЭтоГруппа ТОГДА 1
	|		КОГДА НЕ Конвертации.ПометкаУдаления И Конвертации.ЭтоГруппа ТОГДА 0
	|		КОГДА НЕ Конвертации.ПометкаУдаления И НЕ Конвертации.ЭтоГруппа ТОГДА 3 
	|		КОГДА Конвертации.ПометкаУдаления И НЕ Конвертации.ЭтоГруппа ТОГДА 4
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	Справочник.Конвертации КАК Конвертации
	|ГДЕ 
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО Конвертации.Ссылка ИЕРАРХИЯ
	|";
	ТекстУсловия = "";
	Если ЗначениеЗаполнено(ТекущаяКонфигурацияИсточник) ИЛИ ЗначениеЗаполнено(ТекущаяКонфигурацияПриемник) Тогда
		ТекстУсловия = "(
			|(Конфигурация В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XDTO))
			| ИЛИ (Конфигурация В (&МассивКонфигураций) И КонфигурацияКорреспондент В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XML))
			|)";
		МассивКонфигураций = Новый Массив;
		Если ЗначениеЗаполнено(ТекущаяКонфигурацияИсточник) Тогда
			МассивКонфигураций.Добавить(ТекущаяКонфигурацияИсточник);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущаяКонфигурацияПриемник) Тогда
			МассивКонфигураций.Добавить(ТекущаяКонфигурацияПриемник);
		КонецЕсли;
		Если МассивКонфигураций.Количество() = 1 Тогда
			ТекстУсловия = "(
			|(Конфигурация В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XDTO))
			| ИЛИ ((Конфигурация В (&МассивКонфигураций) ИЛИ КонфигурацияКорреспондент В (&МассивКонфигураций)) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XML))
			|)";
		Иначе
			ТекстУсловия = "(
			|(Конфигурация В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XDTO))
			| ИЛИ (Конфигурация В (&МассивКонфигураций) И КонфигурацияКорреспондент В (&МассивКонфигураций) И ТипКонвертации = ЗНАЧЕНИЕ(Перечисление.ТипыКонвертаций.XML))
			|)";
		КонецЕсли;
		Запрос.УстановитьПараметр("МассивКонфигураций", МассивКонфигураций);
	КонецЕсли;
	Если ИспользоватьОтборПоСтатусу Тогда
		Если ТекстУсловия <> "" Тогда
			ТекстУсловия = ТекстУсловия + " И ";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + "Статус = &Статус";
		Запрос.УстановитьПараметр("Статус", ОтборПоСтатусу);
	КонецЕсли;
	Если ИспользоватьОтборПоРодителю Тогда
		Если ТекстУсловия <> "" Тогда
			ТекстУсловия = ТекстУсловия + " И ";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + "Ссылка В ИЕРАРХИИ (&Родитель)";
		Запрос.УстановитьПараметр("Родитель", ОтборПоРодителю);
	КонецЕсли;
	Если НЕ ПоказыватьПомеченныеНаУдаление Тогда
		Если ТекстУсловия <> "" Тогда
			ТекстУсловия = ТекстУсловия + " И ";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + "ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	Если ТекстУсловия = "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "ГДЕ " + ТекстУсловия);
	КонецЕсли;
	

	ДеревоРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ОбработатьСтрокиДерева(ДеревоРезультат.Строки, Конвертации.ПолучитьЭлементы());
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокиДерева(СтрокиИсходные, СтрокиКДобавлению)
	Для Каждого СтрокаДерева Из СтрокиИсходные Цикл
		Если СтрокаДерева.Родитель <> Неопределено И СтрокаДерева.Родитель.Ссылка = СтрокаДерева.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		СтрокаКДобавлению = СтрокиКДобавлению.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКДобавлению, СтрокаДерева);
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ОбработатьСтрокиДерева(СтрокаДерева.Строки, СтрокаКДобавлению.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоСтатусуПриИзменении(Элемент)
	Элементы.ОтборПоСтатусу.Доступность = ИспользоватьОтборПоСтатусу;
	Если НЕ ИспользоватьОтборПоСтатусу Тогда
		ОтборПоСтатусу = Неопределено;
	КонецЕсли;
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоРодителюПриИзменении(Элемент)
	Элементы.ОтборПоРодителю.Доступность = ИспользоватьОтборПоРодителю;
	Если НЕ ИспользоватьОтборПоРодителю Тогда
		ОтборПоРодителю = Неопределено;
	КонецЕсли;
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоРодителюПриИзменении(Элемент) 	
	СохранитьЗначенияНастроек();
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзменитьПометкуНаУдалениеКонвертации(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПометкуУдаления(ДополнительныеПараметры);
	ОбновитьСписокКонвертаций();
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометкуУдаления(ПараметрыВыполнения)
	КонвОбъект = ПараметрыВыполнения.Ссылка.ПолучитьОбъект();
	Попытка
		КонвОбъект.УстановитьПометкуУдаления(ПараметрыВыполнения.НовПометкаУдаления);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось выполнить операцию: '") + ОписаниеОшибки());
	КонецПопытки
КонецПроцедуры
#КонецОбласти




