#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Имя группы объектов по наименованию объекта метаданных.
// Параметры:
//  Наименование - Строка - Наименование объекта метаданных
// Возвращаемое значение:
//  Строка - имя группы объектов.
Функция ПолучитьИмяГруппыОбъектовПоНаименованию(Знач Наименование) Экспорт
	
	Если      Наименование = "Справочники"             Тогда Возврат НСтр("ru='Справочники'");
	ИначеЕсли Наименование = "Документы"               Тогда Возврат НСтр("ru='Документы'");
	ИначеЕсли Наименование = "Перечисления"            Тогда Возврат НСтр("ru='Перечисления'");
	ИначеЕсли Наименование = "РегистрыСведений"        Тогда Возврат НСтр("ru='Регистры сведений'");
	ИначеЕсли Наименование = "ПланыОбмена"             Тогда Возврат НСтр("ru='Планы обмена'");
	ИначеЕсли Наименование = "ПланыВидовХарактеристик" Тогда Возврат НСтр("ru='Планы видов характеристик'");
	ИначеЕсли Наименование = "ПланыВидовРасчета"       Тогда Возврат НСтр("ru='Планы видов расчета'");
	ИначеЕсли Наименование = "РегистрыБухгалтерии"     Тогда Возврат НСтр("ru='Регистры бухгалтерии'");
	ИначеЕсли Наименование = "РегистрыРасчета"         Тогда Возврат НСтр("ru='Регистры расчета'");
	ИначеЕсли Наименование = "БизнесПроцессы"          Тогда Возврат НСтр("ru='Бизнес-процессы'");
	ИначеЕсли Наименование = "КонстантыНабор"          Тогда Возврат НСтр("ru='Набор констант'");
	ИначеЕсли Наименование = "Задачи"                  Тогда Возврат НСтр("ru='Задачи'");
	ИначеЕсли Наименование = "РегистрыНакопления"      Тогда Возврат НСтр("ru='Регистры накопления'");
	ИначеЕсли Наименование = "ПланыСчетов"             Тогда Возврат НСтр("ru='Планы счетов'");
	ИначеЕсли Наименование = "ХранилищеЗначения"       Тогда Возврат НСтр("ru='Хранилище значения'");
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции
#КонецОбласти
#КонецЕсли