#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипЭлемента = Перечисления.ТипыЭлементовОписания.ОписаниеОбъектаФормата Тогда
		ПроверяемыеРеквизиты.Добавить("ОбъектФормата");
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	// Проверка Типов описаний: не должно быть дублей
	ТаблицаТипов = ОписанияТипов.Выгрузить();
	ТаблицаТипов.Колонки.Добавить("Количество");
	ТаблицаТипов.ЗаполнитьЗначения(1,"Количество");
	ТаблицаТипов.Свернуть("Тип", "Количество");
	ТаблицаТипов.Сортировать("Количество УБЫВ");
	ТекстСообщенияПользователю = НСтр("ru='В таблице описаний типов формата обнаружены дублирующиеся типы: %1%'");
	ТекстДубли = "";
	Для Каждого СтрТипов Из ТаблицаТипов Цикл
		Если СтрТипов.Количество = 1 Тогда
			Прервать;
		Иначе
			Отказ = Истина;
			ТекстДубли = ТекстДубли + СтрТипов.Тип + ", ";
		КонецЕсли;
	КонецЦикла;
	Если Отказ Тогда
		ТекстДубли = Лев(ТекстДубли, СтрДлина(ТекстДубли)-2);
		ТекстСообщенияПользователю = СтрЗаменить(ТекстСообщенияПользователю, "%1%", ТекстДубли);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// Проверка что заполнены описания для типов.
	Если ТипЭлемента = Перечисления.ТипыЭлементовОписания.Типы И ОписанияТипов.Количество() = 0 Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнена таблица описаний типов формата'"));
		Возврат;
	КонецЕсли;
	Если ТипЭлемента <> Перечисления.ТипыЭлементовОписания.Типы И ОписанияТипов.Количество() > 0 Тогда
		ОписанияТипов.Очистить();
	КонецЕсли;
	Если ТипЭлемента <> Перечисления.ТипыЭлементовОписания.ОписаниеОбъектаФормата 
		И (ОписанияРеквизитовШапки.Количество() > 0
			Или ОписанияРеквизитовТабличнойЧасти.Количество() > 0) Тогда
		ОписанияРеквизитовШапки.Очистить();
		ОписанияРеквизитовТабличнойЧасти.Очистить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
#КонецЕсли
