#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Выполняет выгрузку правил регистрации в файл.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при выгрузке.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения выгрузки.
Процедура ВыполнитьВыгрузкуПравил(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	ОбщиеПеременные.Вставить("ФлагОшибки", Ложь);
	ОбщиеПеременные.Вставить("СовместнаяРабота", Константы.СовместнаяРабота.Получить());
	
	Если ОбщиеПеременные.НомерВерсии = 1 Тогда
		// Выгрузка в файл
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		мЗаписьXML = Новый ЗаписьXML;
		мЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
		Попытка
			ВыгрузитьРегистрациюВФайл(мЗаписьXML, ОбщиеПеременные);
		Исключение
			ОбщиеПеременные.ФлагОшибки = Истина;
			СообщитьОбОшибкеОбработки(1, ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		мЗаписьXML.Закрыть();
		мЗаписьXML = Неопределено;
		Результат = Новый Структура("Успешно", НЕ ОбщиеПеременные.ФлагОшибки);

		Если Не ОбщиеПеременные.ФлагОшибки Тогда
			Результат.Вставить("ПравилаXML", Новый ДвоичныеДанные(ИмяВременногоФайла));
		КонецЕсли;
		
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			ИмяВременногоФайла = "";
		КонецПопытки;

	Иначе
		ОбщиеПеременные.Вставить("ТекстМодуля", Новый ТекстовыйДокумент);
		Попытка
			ВыгрузитьРегистрациюВМакет(ОбщиеПеременные);
		Исключение
			ОбщиеПеременные.ФлагОшибки = Истина;
			СообщитьОбОшибкеОбработки(6, ОписаниеОшибки());
			Возврат;
		КонецПопытки;

		Результат = Новый Структура("Успешно, ТекстМодуля", НЕ ОбщиеПеременные.ФлагОшибки, ОбщиеПеременные.ТекстМодуля);
	КонецЕсли;
	ПоместитьВоВременноеХранилище(Результат, АдресВременногоХранилища);

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
#Область ВыгрузкаРегистрацииВМакет
Процедура ВыгрузитьРегистрациюВМакет(ОбщиеПеременные)
	МакетТекстовМодулей = ПолучитьМакет("ШаблоныТекстовМодулей");
	ОбщийТекстМодуля = Новый ТекстовыйДокумент;
	ТекстПроцедурыВызоваОбработчика = Новый Структура("ПередОбработкой, ПриОбработке, ПриОбработкеДополнительный, ПослеОбработки, ПакетнаяОбработка", "", "", "", "", "");
	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбщиеПеременные.Регистрация,
		"Наименование, ИмяПланаОбмена, Конфигурация");
	ОбщиеПеременные.Вставить("Конфигурация", ДанныеРегистрации.Конфигурация);
	ОбщиеПеременные.Вставить("ИмяПланаОбмена", ДанныеРегистрации.ИмяПланаОбмена);

	// Дочерние конфигурации и их тэги.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Конфигурация,
	|	Тэг,
	|	НомерСтроки
	|ИЗ Справочник.Регистрации.ДочерниеКонфигурации
	|ГДЕ Ссылка = &Регистрация";
	Запрос.УстановитьПараметр("Регистрация", ОбщиеПеременные.Регистрация);
	ДочерниеКонфигурации = Запрос.Выполнить().Выгрузить();
	ОбщиеПеременные.Вставить("ДочерниеКонфигурации", ДочерниеКонфигурации);
	ОбщиеПеременные.Вставить("ИспользоватьТэгиПоДочернимКонфигурациям", ДочерниеКонфигурации.Количество() > 0);
	
	ДанныеКонфигурации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеРегистрации.Конфигурация, "Имя, Синоним, Версия");
	
	ДатаВыгрузки = ТекущаяДатаСеанса();
	// Первая строка - имя регистрации.
	СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '// Регистрация %1 от %2'"),
		ДанныеРегистрации.Наименование, ДатаВыгрузки);
	
	ОбщийТекстМодуля.ДобавитьСтроку(СтрокаЗаголовка);
	ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныйПрограммныйИнтерфейс");
	
	// Экспортная функция ПараметрыРегистрации.
	ТекстПроцедуры_Параметры = МакетТекстовМодулей.ПолучитьОбласть("ПараметрыРегистрации").ПолучитьТекст();
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры,
		"#Область ПараметрыРегистрации" + Символы.ПС, "");
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&ИмяПланаОбмена", ДанныеРегистрации.ИмяПланаОбмена); 
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&ГодСоздания", Формат(Год(ДатаВыгрузки),"ЧГ=0"));
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&МесяцСоздания", Месяц(ДатаВыгрузки));
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&ДеньСоздания", День(ДатаВыгрузки));
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&ЧасСоздания", Час(ДатаВыгрузки));
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&МинутаСоздания", Минута(ДатаВыгрузки));
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&Наименование", ДанныеРегистрации.Наименование);
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&Конфигурация", ДанныеКонфигурации.Имя);
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&Синоним", СтрЗаменить(ДанныеКонфигурации.Синоним, """", """"""));
	ТекстПроцедуры_Параметры = СтрЗаменить(ТекстПроцедуры_Параметры, "&ВерсияКонфигурации", ДанныеКонфигурации.Версия);
	
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_Параметры);
	
	Запрос = ПолучитьЗапросПравилаРегистрацииОбъектов(ОбщиеПеременные);
	// Дополнить запрос: отдельная таблица для получения сводных отборов
	Запрос.Текст = Запрос.Текст + "
	|;
	|ВЫБРАТЬ
	|	Ссылка                              КАК Ссылка,
	|	ОтборПоСвойствамОбъекта             КАК ОтборПоСвойствамОбъекта,
	|	ОтборПоСвойствамПланаОбмена         КАК ОтборПоСвойствамПланаОбмена,
	|	ОбъектНастройки                     КАК ОбъектНастройкиСсылка,
	|	ОбъектНастройки.Наименование 		КАК ОбъектНастройкиНаименование
	|ИЗ ТаблицаПРО КАК ПРО  
	|ГДЕ ЭтоГруппа = ЛОЖЬ
	|";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ИндексТаблицыОтборов = РезультатЗапроса.Количество() - 1;
	ВыборкаОтборов = РезультатЗапроса[ИндексТаблицыОтборов].Выбрать();
	ПроцедурыОбщихОтборов = Новый ТекстовыйДокумент;
	ТаблицаОтборов = ОбработатьТаблицуОтборов(ВыборкаОтборов, ПроцедурыОбщихОтборов, ОбщиеПеременные);
	
	Выборка = РезультатЗапроса[ИндексТаблицыОтборов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТелоПроцедуры_ЗаполнитьПРО = Новый ТекстовыйДокумент;
	
	// На случай отсутствия колонки Идентификатор в таблице ПРО ее надо добавить.
	ТелоПроцедуры_ЗаполнитьПРО.ДобавитьСтроку("Если ПравилаРегистрацииОбъектов.Колонки.Найти(""Идентификатор"") = Неопределено Тогда"); 
	ТелоПроцедуры_ЗаполнитьПРО.ДобавитьСтроку(Символы.Таб + "ПравилаРегистрацииОбъектов.Колонки.Добавить(""Идентификатор"");"); 
	ТелоПроцедуры_ЗаполнитьПРО.ДобавитьСтроку("КонецЕсли;");
	
	ВсяПроцедура = Новый ТекстовыйДокумент;
	СлужебныеПроцедуры = Новый ТекстовыйДокумент;
	ДублиОбъектаНастройки = Новый Структура;
	ТекстЗапросаПустойОтбор = Неопределено;
	
	ЕстьВыполнитьПравилаРегистрацииДляОбъекта = Ложь;
	ЕстьОпределитьПолучателей = Ложь;
	ЕстьВсеУзлыПланаОбмена = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Отключить Или Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		ОбщиеПеременные.Вставить("ТаблицаСвойствОбъекта", Неопределено);
		
		ТекущийТэг = ОпределитьТекущийТэг(Выборка, ОбщиеПеременные);
		Если ТекущийТэг.ТегОткрыт <> "" Тогда
			// Читаем предыдущую строку - возможно там был закрыт тег.
			ПоследняяСтрока = "";
			Если ТелоПроцедуры_ЗаполнитьПРО.КоличествоСтрок() > 0 Тогда
				ПоследняяСтрока = ТелоПроцедуры_ЗаполнитьПРО.ПолучитьСтроку(ТелоПроцедуры_ЗаполнитьПРО.КоличествоСтрок());
			КонецЕсли;
			Если СтрНайти(ПоследняяСтрока, "//--") Тогда
				ТелоПроцедуры_ЗаполнитьПРО.ДобавитьСтроку(Символы.ПС + ТекущийТэг.ТегОткрыт);
			Иначе
				ТелоПроцедуры_ЗаполнитьПРО.ДобавитьСтроку(ТекущийТэг.ТегОткрыт);
			КонецЕсли;
		КонецЕсли;
		ТипОбъекта = ИмяЗначенияПеречисления(ОбщиеПеременные, Выборка.ОбъектНастройкиТип);
		ОбъектМетаданныхИмя = ТипОбъекта + "." + СокрЛП(Выборка.ОбъектНастройкиИмя);
		ИДПравила = СтрЗаменить(ОбъектМетаданныхИмя, ".", "_");
		// Может быть несколько правил на один и тот же объект настройки.
		// Дубли содержат постфикс - порядковый номер.
		НомерДубля = 0;
		Если ДублиОбъектаНастройки.Свойство(ИДПравила, НомерДубля) Тогда
			НомерДубля = НомерДубля + 1;
		Иначе
			НомерДубля = 1;
		КонецЕсли;
		ДублиОбъектаНастройки.Вставить(ИДПравила, НомерДубля);
		Если НомерДубля > 1 Тогда
			ИДПравила = ИДПравила + СокрЛП(НомерДубля);
		КонецЕсли;
		СтрокаВызова = "ДобавитьПРО_" + ИДПравила + "(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);";
		ТелоПроцедуры_ЗаполнитьПРО.ДобавитьСтроку(СтрокаВызова);
		Если ТекущийТэг.ТегЗакрыт <> "" Тогда
			// Закрыть тэг
			ТелоПроцедуры_ЗаполнитьПРО.ДобавитьСтроку(ТекущийТэг.ТегЗакрыт);
		КонецЕсли;
		
		ОбластьПРОТекст = МакетТекстовМодулей.ПолучитьОбласть("ПРО").ПолучитьТекст();
		УбратьПоследнийПереводСтроки(ОбластьПРОТекст);
		Если ТекущийТэг.ТегОткрыт <> "" Тогда
			ОбластьПРОТекст = ТекущийТэг.ТегОткрыт + Символы.ПС + ОбластьПРОТекст + Символы.ПС + ТекущийТэг.ТегЗакрыт;
			// Читаем предыдущую строку - возможно там был закрыт тег. 
			Если СлужебныеПроцедуры.КоличествоСтрок() > 0 Тогда
				ПоследняяСтрока = СлужебныеПроцедуры.ПолучитьСтроку(СлужебныеПроцедуры.КоличествоСтрок()); 
				Если СтрНайти(ПоследняяСтрока, "//--") Тогда
					 ОбластьПРОТекст = Символы.ПС + ОбластьПРОТекст;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "#Область ПРО" + Символы.ПС, "");
		ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&КонецОбласти", "#КонецОбласти");
		ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ОбъявлениеОбласти", "#Область " + СокрЛП(ИДПравила));
		
		ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ИмяПРО", СокрЛП(ИДПравила));
		
		ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ОбъектМетаданныхИмя", ОбъектМетаданныхИмя);
		
		ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&НаименованиеПланаОбмена", СокрЛП(ОбщиеПеременные.ИмяПланаОбмена));
		ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ИмяРеквизитаФлага", СокрЛП(Выборка.РеквизитРежимаВыгрузки)); 
		Если ЗначениеЗаполнено(СокрЛП(Выборка.АлгоритмПакетнаяОбработкаРегистрации)) Тогда
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПакетноеВыполнениеОбработчиков", "Истина");
		Иначе
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПакетноеВыполнениеОбработчиков", "Ложь");
		КонецЕсли;
		
		// Отборы
		СтПоиск = Новый Структура("Ссылка", Выборка.Ссылка);
		СтрОтбор = ТаблицаОтборов.Найти(Выборка.Ссылка, "Ссылка"); 
		Если СтрОтбор <> Неопределено Тогда
			Если ЗначениеЗаполнено(СтрОтбор.ИмяПроцедурыОтборПланаОбмена) Тогда
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&Вызов_ОтборПоСвойствамПланаОбмена", СтрОтбор.ИмяПроцедурыОтборПланаОбмена);
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ТелоОтборПоСвойствамПланаОбмена", "---");
			Иначе
				ИмяВызова = СокрЛП(ИДПравила) + "_ОтборПоСвойствамПланаОбмена()";
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&Вызов_ОтборПоСвойствамПланаОбмена", ИмяВызова);
				ТекстОтбора = СтрЗаменить(ЗначениеИзСтрокиВнутр(СтрОтбор.ОтборПоСвойствамПланаОбменаСтрокой), "|", Символы.Таб + Символы.Таб + Символы.Таб + "|");
				ТекстПроцедурыЛокально = "Функция " + ИмяВызова + Символы.ПС + Символы.Таб +
					"Возврат """ + ТекстОтбора + """;" + Символы.ПС + "КонецФункции";
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ТелоОтборПоСвойствамПланаОбмена", Символы.ПС + ТекстПроцедурыЛокально);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрОтбор.ИмяПроцедурыОтборОбъекта) Тогда
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&Вызов_ОтборПоСвойствамОбъекта", СтрОтбор.ИмяПроцедурыОтборОбъекта);
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ТелоОтборПоСвойствамОбъекта", "---");
			Иначе
				ИмяВызова = СокрЛП(ИДПравила) + "_ОтборПоСвойствамОбъекта()";
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&Вызов_ОтборПоСвойствамОбъекта", ИмяВызова);
				ТекстОтбора = СтрЗаменить(ЗначениеИзСтрокиВнутр(СтрОтбор.ОтборПоСвойствамОбъектаСтрокой), "|", Символы.Таб + Символы.Таб + Символы.Таб + "|");
				ТекстПроцедурыЛокально = "Функция " + ИмяВызова + Символы.ПС + Символы.Таб +
					"Возврат """ + ТекстОтбора + """;" + Символы.ПС + "КонецФункции";
				ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ТелоОтборПоСвойствамОбъекта", Символы.ПС + ТекстПроцедурыЛокально);
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыПравила = Новый Структура("ИмяПравила, ТекущийТэг, ОбъектМетаданныхИмя", ИДПравила, ТекущийТэг, ОбъектМетаданныхИмя);
		ТекстОбработчики = Новый ТекстовыйДокумент;
		Если ЗначениеЗаполнено(Выборка.АлгоритмПередОбработкойПравила) Тогда
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьПередОбработкой", "Истина");
			ИмяОбработчика = "ПРО_" + ИДПравила + "_ПередОбработкой";
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПередОбработкой", ИмяОбработчика);
			ПараметрыОбработчика = Новый Структура("ИмяОбработчика, АлгоритмОбработчика",
					ИмяОбработчика, Выборка.АлгоритмПередОбработкойПравила);
			
			ДобавитьОбработчикВТекстМодуля(ПараметрыПравила, ПараметрыОбработчика, ТекстОбработчики, ТекстПроцедурыВызоваОбработчика);
		Иначе
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьПередОбработкой", "Ложь");
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПередОбработкой", "---");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.АлгоритмПриОбработкеДополнительныйПравила) Тогда
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьДопПриОбработке", "Истина");
			ИмяОбработчика = "ПРО_" + ИДПравила + "_ПриОбработкеДополнительный";
			
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПриОбработкеДополнительный", ИмяОбработчика);
			ПараметрыОбработчика = Новый Структура("ИмяОбработчика, АлгоритмОбработчика",
					ИмяОбработчика, Выборка.АлгоритмПриОбработкеДополнительныйПравила);
			
			ДобавитьОбработчикВТекстМодуля(ПараметрыПравила, ПараметрыОбработчика, ТекстОбработчики, ТекстПроцедурыВызоваОбработчика); 
		Иначе
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьДопПриОбработке", "Ложь");
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПриОбработкеДополнительный", "---");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.АлгоритмПриОбработкеПравила) Тогда
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьПриОбработке", "Истина");
			ИмяОбработчика = "ПРО_" + ИДПравила + "_ПриОбработке";
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПриОбработке", ИмяОбработчика);
			ПараметрыОбработчика = Новый Структура("ИмяОбработчика, АлгоритмОбработчика",
					ИмяОбработчика, Выборка.АлгоритмПриОбработкеПравила);
			ДобавитьОбработчикВТекстМодуля(ПараметрыПравила, ПараметрыОбработчика, ТекстОбработчики, ТекстПроцедурыВызоваОбработчика); 
		Иначе
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьПриОбработке", "Ложь");
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПриОбработке", "---");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.АлгоритмПослеОбработкиПравила) Тогда
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьПослеОбработки", "Истина");
			ИмяОбработчика = "ПРО_" + ИДПравила + "_ПослеОбработки";
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПослеОбработки", ИмяОбработчика);
			ПараметрыОбработчика = Новый Структура("ИмяОбработчика, АлгоритмОбработчика",
					ИмяОбработчика, Выборка.АлгоритмПослеОбработкиПравила);
			ДобавитьОбработчикВТекстМодуля(ПараметрыПравила, ПараметрыОбработчика, ТекстОбработчики, ТекстПроцедурыВызоваОбработчика); 
		Иначе
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ЕстьПослеОбработки", "Ложь");
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ПослеОбработки", "---");
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.АлгоритмПакетнаяОбработкаРегистрации) Тогда
			ИмяОбработчика = "ПРО_" + ИДПравила + "_ПакетнаяОбработка";
			ПараметрыОбработчика = Новый Структура("ИмяОбработчика, АлгоритмОбработчика",
					ИмяОбработчика, Выборка.АлгоритмПакетнаяОбработкаРегистрации);
			ДобавитьОбработчикВТекстМодуля(ПараметрыПравила, ПараметрыОбработчика, ТекстОбработчики, ТекстПроцедурыВызоваОбработчика); 
		КонецЕсли;
		
		Если ТекстОбработчики.КоличествоСтрок() > 0 Тогда
			ТекстОбработчикиСтрокой = ТекстОбработчики.ПолучитьТекст();
			УбратьПоследнийПереводСтроки(ТекстОбработчикиСтрокой);
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ОбработчикиПРО", ТекстОбработчикиСтрокой);
		Иначе
			ОбластьПРОТекст = СтрЗаменить(ОбластьПРОТекст, "&ОбработчикиПРО", "---");
		КонецЕсли;
		ПРОЗаполнено = СтрНайти(ОбластьПРОТекст, "---") = 0;
		
		СлужебныеПроцедуры.ДобавитьСтроку(ОбластьПРОТекст);
		
		ВсеОбработчикиОбъекта = Выборка.АлгоритмПередОбработкойПравила
			+ Выборка.АлгоритмПриОбработкеДополнительныйПравила
			+ Выборка.АлгоритмПриОбработкеПравила
			+ Выборка.АлгоритмПослеОбработкиПравила
			+ Выборка.АлгоритмПакетнаяОбработкаРегистрации;
			
		Если НЕ ЕстьВыполнитьПравилаРегистрацииДляОбъекта И СтрНайти(ВсеОбработчикиОбъекта, "ВыполнитьПравилаРегистрацииДляОбъекта") Тогда
			ЕстьВыполнитьПравилаРегистрацииДляОбъекта = Истина;
		КонецЕсли;
		
		Если НЕ ЕстьОпределитьПолучателей И СтрНайти(ВсеОбработчикиОбъекта, "ОпределитьПолучателей") Тогда
			ЕстьОпределитьПолучателей = Истина;
		КонецЕсли;
		
		Если НЕ ЕстьВсеУзлыПланаОбмена И СтрНайти(ВсеОбработчикиОбъекта, "ВсеУзлыПланаОбмена") Тогда
			ЕстьВсеУзлыПланаОбмена = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстТелаПроцедуры = ДобавитьОтступыВСтроку(ТелоПроцедуры_ЗаполнитьПРО.ПолучитьТекст());
	ЗаполнитьПРОТекст = МакетТекстовМодулей.ПолучитьОбласть("ЗаполнитьПравилаРегистрацииОбъектов").ПолучитьТекст();
	УбратьПоследнийПереводСтроки(ЗаполнитьПРОТекст);
	ЗаполнитьПРОТекст = СтрЗаменить(ЗаполнитьПРОТекст,
		"#Область ЗаполнитьПравилаРегистрацииОбъектов", "---");
	ЗаполнитьПРОТекст = СтрЗаменить(ЗаполнитьПРОТекст, "&ТелоПроцедуры", ТекстТелаПроцедуры);
	ВсяПроцедура.ВставитьСтроку(1, ЗаполнитьПРОТекст);
	
	ОбщийТекстМодуля.ДобавитьСтроку(ВсяПроцедура.ПолучитьТекст());
	// Вызовы обработчиков
	ТекстПроцедуры_Общие = ЗаполнитьТекстПроцедурыОбщие(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_Общие);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	
	ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныеПроцедурыИФункции");
	
	Если ЕстьВыполнитьПравилаРегистрацииДляОбъекта Тогда
		СлужебныеПроцедурыТекст = МакетТекстовМодулей.ПолучитьОбласть("ВыполнитьПравилаРегистрацииДляОбъекта").ПолучитьТекст();
		УбратьПоследнийПереводСтроки(СлужебныеПроцедурыТекст);
		СлужебныеПроцедурыТекст = СтрЗаменить(СлужебныеПроцедурыТекст, "#Область ВыполнитьПравилаРегистрацииДляОбъекта", "---");
		ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедурыТекст);
	КонецЕсли;
	
	Если ЕстьОпределитьПолучателей Тогда
		СлужебныеПроцедурыТекст = МакетТекстовМодулей.ПолучитьОбласть("ОпределитьПолучателей").ПолучитьТекст();
		УбратьПоследнийПереводСтроки(СлужебныеПроцедурыТекст);
		СлужебныеПроцедурыТекст = СтрЗаменить(СлужебныеПроцедурыТекст, "#Область ОпределитьПолучателей", "---");
		ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедурыТекст);
	КонецЕсли;
	
	Если ЕстьВсеУзлыПланаОбмена Тогда
		СлужебныеПроцедурыТекст = МакетТекстовМодулей.ПолучитьОбласть("ВсеУзлыПланаОбмена").ПолучитьТекст();
		УбратьПоследнийПереводСтроки(СлужебныеПроцедурыТекст);
		СлужебныеПроцедурыТекст = СтрЗаменить(СлужебныеПроцедурыТекст, "#Область ВсеУзлыПланаОбмена", "---");
		ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедурыТекст);
	КонецЕсли;
	
	СлужебныеПроцедурыТекст = МакетТекстовМодулей.ПолучитьОбласть("УстановитьОтборы").ПолучитьТекст();
	СлужебныеПроцедурыТекст = СтрЗаменить(СлужебныеПроцедурыТекст, "#Область УстановитьОтборы", "---");
	ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедурыТекст);
	ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедуры.ПолучитьТекст());
	
	// Процедуры общих отборов
	ОбщийТекстМодуля.ДобавитьСтроку(ПроцедурыОбщихОтборов.ПолучитьТекст());
	
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	
	// Удаление лишних кусков из текста.
	КоличествоСтрок = ОбщийТекстМодуля.КоличествоСтрок();
	
	Для ОбратныйСчетчик = 0 По КоличествоСтрок - 1 Цикл
		НомерСтроки = КоличествоСтрок - ОбратныйСчетчик;
		Строка = ОбщийТекстМодуля.ПолучитьСтроку(НомерСтроки);
		Если Найти(Строка, "---") > 0 Тогда
			ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки);
		КонецЕсли; 
	КонецЦикла;
	// Схлопывание идентичных тегов - нужны 3 прохода для многоуровневых тегов.
	Для Проход = 1 По 3 Цикл
		КоличествоСтрок = ОбщийТекстМодуля.КоличествоСтрок();
		ОткрывающийТэг = "";
		НомерСтрокиОткрытТэг = 0;
		Для ОбратныйСчетчик = 0 По КоличествоСтрок - 1 Цикл
			НомерСтроки = КоличествоСтрок - ОбратныйСчетчик;
			Строка = ОбщийТекстМодуля.ПолучитьСтроку(НомерСтроки);
			Если Найти(Строка, "//--") > 0 И ОткрывающийТэг <> "" Тогда
				Если СтрЗаменить(Строка, "--", "++") = ОткрывающийТэг
					И НомерСтрокиОткрытТэг = НомерСтроки + 1 Тогда
					ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки + 1);
					ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки);
				КонецЕсли;
				ОткрывающийТэг = "";
				НомерСтрокиОткрытТэг = 0;
				Продолжить;
			ИначеЕсли Найти(Строка, "//++") > 0 Тогда
				ОткрывающийТэг = Строка;
				НомерСтрокиОткрытТэг = НомерСтроки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОбщиеПеременные.Вставить("ТекстМодуля", ОбщийТекстМодуля);
	
КонецПроцедуры

Процедура ДобавитьОбработчикВТекстМодуля(ПараметрыПравила, ПараметрыОбработчика, ТекстОбработчики, ТекстПроцедурыВызоваОбработчика)
	ИмяОбработчика = ПараметрыОбработчика.ИмяОбработчика;
	АлгоритмОбработчика = ПараметрыОбработчика.АлгоритмОбработчика;
	МакетТекстовМодулей = ПолучитьМакет("ШаблоныТекстовМодулей");
	ПараметрыДляВызова = "";
	ТекстЛокальнойПроцедуры = "";
	ИмяЭлемента = "";
	Если СтрНайти(ИмяОбработчика, "_ПередОбработкой") Тогда
		ИмяОбласти = "Обработчик_ПередОбработкой_Заголовок";		
		ПараметрыДляВызова = ПараметрыДляВызова + "ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка";
		ИмяЭлемента = "ПередОбработкой";
	ИначеЕсли СтрНайти(ИмяОбработчика, "_ПослеОбработки") Тогда
		ИмяОбласти = "Обработчик_ПослеОбработки_Заголовок";
		ПараметрыДляВызова = ПараметрыДляВызова + "ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка";
		ИмяЭлемента = "ПослеОбработки";
	ИначеЕсли СтрНайти(ИмяОбработчика, "_ПриОбработкеДополнительный") Тогда
		ИмяОбласти = "Обработчик_ПриОбработкеДополнительный_Заголовок";
		ПараметрыДляВызова = ПараметрыДляВызова + "Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства";
		ИмяЭлемента = "ПриОбработкеДополнительный";
	ИначеЕсли СтрНайти(ИмяОбработчика, "_ПриОбработке") Тогда
		ИмяОбласти = "Обработчик_ПриОбработке_Заголовок";
		ПараметрыДляВызова = ПараметрыДляВызова + "Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства";
		ИмяЭлемента = "ПриОбработке";
	ИначеЕсли СтрНайти(ИмяОбработчика, "_ПакетнаяОбработка") Тогда
		ИмяОбласти = "Обработчик_ПакетнаяОбработка_Заголовок";
		ПараметрыДляВызова = ПараметрыДляВызова + "ПРО, МассивСсылок, Узел";
		ИмяЭлемента = "ПакетнаяОбработка";
	КонецЕсли;
	Если ИмяЭлемента = "" Тогда
		Возврат;
	КонецЕсли;
	ТекстЛокальнойПроцедуры = ТекстПроцедурыВызоваОбработчика[ИмяЭлемента];
	
	НачалоОбработчика = МакетТекстовМодулей.ПолучитьОбласть(ИмяОбласти).ПолучитьТекст();
	УбратьПоследнийПереводСтроки(НачалоОбработчика);
	НачалоОбработчика = СтрЗаменить(НачалоОбработчика, "#Область " + ИмяОбласти, "---");
	НачалоОбработчика = СтрЗаменить(НачалоОбработчика, "&ИмяПравила", ПараметрыПравила.ИмяПравила);
	НачалоОбработчика = СтрЗаменить(НачалоОбработчика, "&ИмяОбработчика", ИмяОбработчика);
	
	Если ТекстОбработчики.КоличествоСтрок() > 0 Тогда
		НачалоОбработчика = Символы.ПС + НачалоОбработчика;
	КонецЕсли;
	
	ТекстОбработчики.ДобавитьСтроку(НачалоОбработчика);
	ТекстОбработчики.ДобавитьСтроку(ДобавитьОтступыВСтроку(АлгоритмОбработчика));
	ТекстОбработчики.ДобавитьСтроку("КонецПроцедуры");
	
	ВставлятьПервым = Ложь;
	// Если в первом по счету вызове нужен тэг, то этот кусок вставляется в ветвь ИначеЕсли.
	//	с Если в таком случае будет начинаться первый попавший обработчик без тэга.
	Если ПараметрыПравила.ТекущийТэг.ТегОткрыт = ""
		И (ТекстЛокальнойПроцедуры = "" Или Лев(ТекстЛокальнойПроцедуры,3) = Символы.ПС + "//") Тогда
		ВетвьУсловия = "Если ";
		ВставлятьПервым = Истина;
	Иначе
		ВетвьУсловия = Символы.ПС + "ИначеЕсли ";
	КонецЕсли; 
	ВетвьУсловия = ВетвьУсловия + "ПРО.Идентификатор = """ + ПараметрыПравила.ИмяПравила + """ Тогда " + Символы.ПС + Символы.Таб 
		+ ИмяОбработчика + "(" + ПараметрыДляВызова + ");";
	
	Если ПараметрыПравила.ТекущийТэг.ТегОткрыт <> "" Тогда
		ВетвьУсловия = Символы.ПС + ПараметрыПравила.ТекущийТэг.ТегОткрыт + ВетвьУсловия 
			+ Символы.ПС + ПараметрыПравила.ТекущийТэг.ТегЗакрыт;
		// Читаем предыдущую строку - возможно там был закрыт тег.
		ПоследняяСтрока = СтрПолучитьСтроку(ТекстЛокальнойПроцедуры, СтрЧислоСтрок(ТекстЛокальнойПроцедуры));
		Если СтрНайти(ПоследняяСтрока, "//--") Тогда
			ВетвьУсловия = Символы.ПС + ВетвьУсловия;
		КонецЕсли;
	КонецЕсли;
	Если ВставлятьПервым Тогда
		ТекстЛокальнойПроцедуры = ВетвьУсловия + ТекстЛокальнойПроцедуры;
	Иначе
		ТекстЛокальнойПроцедуры = ТекстЛокальнойПроцедуры + ВетвьУсловия;
	КонецЕсли;
	ТекстПроцедурыВызоваОбработчика.Вставить(ИмяЭлемента, ТекстЛокальнойПроцедуры);
КонецПроцедуры

Функция ЗаполнитьТекстПроцедурыОбщие(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика)
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	Для Каждого Обработчик Из ТекстПроцедурыВызоваОбработчика Цикл
		Если НЕ ЗначениеЗаполнено(Обработчик.Значение) Тогда
			Продолжить;
		КонецЕсли;
		Если ТекстПроцедуры.КоличествоСтрок() > 0 Тогда
			ТекстПроцедуры.ДобавитьСтроку("");
		КонецЕсли;
		КлючОбработчика = "Обработчик_" + Обработчик.Ключ;
		КомментарийПроцедуры = МакетТекстовМодулей.ПолучитьОбласть(КлючОбработчика + "_Комментарий").ПолучитьТекст();
		КомментарийПроцедуры = СтрЗаменить(КомментарийПроцедуры,"#Область " + КлючОбработчика + "_Комментарий", "---");
		Если Прав(КомментарийПроцедуры, 1) = Символы.ПС Тогда
			КомментарийПроцедуры = Лев(КомментарийПроцедуры, СтрДлина(КомментарийПроцедуры) - 1);
		КонецЕсли;
		
		ТекстПроцедуры.ДобавитьСтроку(КомментарийПроцедуры);
		
		ЗаголовокПроцедуры = МакетТекстовМодулей.ПолучитьОбласть(КлючОбработчика + "_Заголовок").ПолучитьТекст();
		ЗаголовокПроцедуры = СтрЗаменить(ЗаголовокПроцедуры, "#Область " + КлючОбработчика + "_Заголовок", "---");
		ЗаголовокПроцедуры = СтрЗаменить(ЗаголовокПроцедуры, "&ИмяОбработчика", Обработчик.Ключ);
		Если Прав(ЗаголовокПроцедуры, 1) = Символы.ПС Тогда
			ЗаголовокПроцедуры = Лев(ЗаголовокПроцедуры, СтрДлина(ЗаголовокПроцедуры) - 1) + " Экспорт";
		Иначе
			ЗаголовокПроцедуры = ЗаголовокПроцедуры + " Экспорт";
		КонецЕсли;
		ТекстПроцедуры.ДобавитьСтроку(ЗаголовокПроцедуры);
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Обработчик.Значение));
		ТекстПроцедуры.ДобавитьСтроку(Символы.Таб + "КонецЕсли;");
		ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	КонецЦикла;
	
	Возврат ТекстПроцедуры.ПолучитьТекст();

КонецФункции

#Область ТекстЗапросаПланаОбмена
		 
Функция ПолучитьТекстУсловияДляГруппыСвойств(СвойстваГруппы, БулевоЗначениеГруппы, Знач Смещение, СвойстваОбъекта, ОбщиеПеременные)
	
	СтрокаСмещения = "";
	
	// Получаем строку смещения для группы свойств.
	Для НомерИтерации = 0 По Смещение Цикл
		СтрокаСмещения = СтрокаСмещения + " ";
	КонецЦикла;
	
	ТекстУсловия = "";
	
	Для Каждого ПРПС Из СвойстваГруппы Цикл
		
		Если ПРПС.ЭтоГруппа Тогда
			
			ПрефиксУсловия = ?(ПустаяСтрока(ТекстУсловия), "", Символы.ПС + Символы.Таб + "|" + СтрокаСмещения + БулевоЗначениеГруппы + " ");
			
			ТекстУсловия = ТекстУсловия + ПрефиксУсловия + ПолучитьТекстУсловияДляГруппыСвойств(ПРПС.Строки, ПРПС.БулевоЗначениеГруппы, Смещение + 10, СвойстваОбъекта, ОбщиеПеременные);
			
		Иначе
			
			ПрефиксУсловия = ?(ПустаяСтрока(ТекстУсловия), "", Символы.ПС + Символы.Таб + "|" + СтрокаСмещения + БулевоЗначениеГруппы + " ");
			
			ТекстУсловия = ТекстУсловия + ПрефиксУсловия + ПолучитьТекстУсловияДляСвойства(ПРПС, СвойстваОбъекта, ОбщиеПеременные);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстУсловия = "(" + ТекстУсловия + Символы.ПС + Символы.Таб + "|" + СтрокаСмещения + ")";
	
	Возврат ТекстУсловия;
	
КонецФункции

Функция ПолучитьТекстУсловияДляСвойства(Правило, СвойстваОбъекта, ОбщиеПеременные)
	
	ВидСравненияПравила = Правило.ВидСравнения;
	
	// Необходимо инвертировать вид сравнения,
	// потому что таблицы Плана обмена и регистрируемого Объекта расположены по разному
	// в конфигурации КД 2.0 при настройке ПРО и в запросе к Планам обмена в данном модуле.
	
	ТекстОператора = ПолучитьТекстОператораСравнения(ВидСравненияПравила);
	
	СинонимТаблицы = ?(ПустаяСтрока(Правило.ТабличнаяЧастьПараметраУзла),
	                              "ПланОбменаОсновнаяТаблица",
	                               ОбщиеПеременные.ИмяПланаОбмена + Правило.ТабличнаяЧастьПараметраУзла);
	//
	
	// В качестве литерала параметра запроса может быть как сам параметр запроса, так и значение константы.
	//
	// Пример:
	// СвойствоПланаОбмена <вид сравнения> &СвойствоОбъекта_МоеСвойство
	// СвойствоПланаОбмена <вид сравнения> ДАТАВРЕМЯ(1987,10,19,0,0,0).
	
	Если Правило.ЭтоСтрокаКонстанты Тогда
		
		ТипЗначенияКонстанты = ТипЗнч(Правило.СвойствоОбъекта);
		
		Если ТипЗначенияКонстанты = Тип("Булево") Тогда // Булево
			
			ЛитералПараметраЗапроса = Формат(Правило.СвойствоОбъекта, "БЛ=Ложь; БИ=Истина");
			
		ИначеЕсли ТипЗначенияКонстанты = Тип("Число") Тогда // Число
			
			ЛитералПараметраЗапроса = Формат(Правило.СвойствоОбъекта, "ЧРД=.; ЧН=0; ЧГ=0; ЧО=1");
			
		ИначеЕсли ТипЗначенияКонстанты = Тип("Дата") Тогда // Дата
			
			СтрокаГод     = Формат(Год(Правило.СвойствоОбъекта),     "ЧН=0; ЧГ=0");
			СтрокаМесяц   = Формат(Месяц(Правило.СвойствоОбъекта),   "ЧН=0; ЧГ=0");
			СтрокаДень    = Формат(День(Правило.СвойствоОбъекта),    "ЧН=0; ЧГ=0");
			СтрокаЧас     = Формат(Час(Правило.СвойствоОбъекта),     "ЧН=0; ЧГ=0");
			СтрокаМинута  = Формат(Минута(Правило.СвойствоОбъекта),  "ЧН=0; ЧГ=0");
			СтрокаСекунда = Формат(Секунда(Правило.СвойствоОбъекта), "ЧН=0; ЧГ=0");
			
			ЛитералПараметраЗапроса = "ДАТАВРЕМЯ("
			+ СтрокаГод + ","
			+ СтрокаМесяц + ","
			+ СтрокаДень + ","
			+ СтрокаЧас + ","
			+ СтрокаМинута + ","
			+ СтрокаСекунда
			+ ")";
			
		Иначе // Строка
			
			// строку заключаем в кавычки
			ЛитералПараметраЗапроса = """""" + Правило.СвойствоОбъекта + """""";
			
		КонецЕсли;
		
	Иначе
		
		КлючСвойстваОбъекта = СтрЗаменить(Правило.СвойствоОбъекта, ".", "_");
		
		ЛитералПараметраЗапроса = "&СвойствоОбъекта_" + КлючСвойстваОбъекта + "";
		
		СвойстваОбъекта.Вставить(КлючСвойстваОбъекта, Правило.СвойствоОбъекта);
		
	КонецЕсли;
	
	ТекстУсловия = СинонимТаблицы + "." + Правило.ПараметрУзла + " " + ТекстОператора + " " + ЛитералПараметраЗапроса;
	
	Возврат ТекстУсловия;
	
КонецФункции

Функция ПолучитьТекстОператораСравнения(ВидСравнения)
	
	// Возвращаемое значение функции по умолчанию.
	ТекстОператора = "=";
	
	// Необходимо инвертировать вид сравнения в случае Больше и Меньше,
	// потому что таблицы Плана обмена и регистрируемого Объекта расположены по разному
	// в конфигурации КД при настройке ПРО и в запросе к Планам обмена в данном модуле.
	Если      ВидСравнения = Перечисления.ВидыСравнения.Равно          Тогда ТекстОператора = "=";
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнения.НеРавно        Тогда ТекстОператора = "<>";
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнения.Больше         Тогда ТекстОператора = "<";
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнения.БольшеИлиРавно Тогда ТекстОператора = "<=";
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнения.Меньше         Тогда ТекстОператора = ">";
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнения.МеньшеИлиРавно Тогда ТекстОператора = ">=";
	КонецЕсли;
	
	Возврат ТекстОператора;
КонецФункции
#КонецОбласти

Функция ДобавитьОтступыВСтроку(СтрокаАлгоритма)
	ТекСтрокаАлгоритма = СокрЛП(СтрокаАлгоритма);
	Возврат Символы.Таб + СтрЗаменить(ТекСтрокаАлгоритма, Символы.ПС, Символы.ПС+Символы.Таб);
КонецФункции

Функция ОпределитьТекущийТэг(Выборка, ОбщиеПеременные)
	ТегиРезультат = Новый Структура("ТегОткрыт, ТегЗакрыт", "", "");
	ИмяОбъектаМетаданных = Выборка.ОбъектНастройкиНаименование; 
	// К тегам на основании реквизитов частица НЕ не добавляется, т.к. есть служебные теги напр. Локализация
	СтрокТега = Выборка.Ссылка.Теги.Количество();
	
	Если СтрокТега > 0 Тогда
		Если СтрокТега > 1 Тогда
			Для с = 1 По СтрокТега Цикл
				ПодстрокаТега = СокрЛП(Выборка.Ссылка.Теги[с-1].Тег);
				ТегиРезультат.ТегОткрыт = ТегиРезультат.ТегОткрыт + ?(ТегиРезультат.ТегОткрыт = "", "", Символы.ПС) + "//++ " + ПодстрокаТега + Символы.ПС;
				ТегиРезультат.ТегЗакрыт = "//-- " + ПодстрокаТега + Символы.ПС + ?(ТегиРезультат.ТегЗакрыт = "", "", Символы.ПС + ТегиРезультат.ТегЗакрыт);
			КонецЦикла;
		Иначе
			ПодстрокаТега = СокрЛП(Выборка.Ссылка.Теги[0].Тег);
			ТегиРезультат.ТегОткрыт = "//++ " + ПодстрокаТега;
			ТегиРезультат.ТегЗакрыт = "//-- " + ПодстрокаТега;
		КонецЕсли;
	КонецЕсли;
	Если ОбщиеПеременные.ДочерниеКонфигурации.Количество() = 0 Тогда 
		Возврат ТегиРезультат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Таб.Конфигурация,
	|	Таб.Тэг,
	|	Таб.НомерСтроки
	|ПОМЕСТИТЬ ДочерниеКонфигурации
	|ИЗ &ДочерниеКонфигурации КАК Таб
	|;
	|ВЫБРАТЬ
	|	Объекты.Ссылка КАК Ссылка,
	|	Объекты.Владелец КАК Владелец
	|ПОМЕСТИТЬ Объекты
	|ИЗ Справочник.Объекты КАК Объекты
	|ГДЕ Объекты.Наименование = &ИмяОбъекта И Объекты.ПометкаУдаления = ЛОЖЬ
	|	И (Объекты.Владелец = &Конфигурация
	|		ИЛИ Объекты.Владелец В (ВЫБРАТЬ Конфигурация ИЗ ДочерниеКонфигурации))
	|;
	|ВЫБРАТЬ
	|	Объекты.Ссылка КАК Ссылка,
	|	ДочерниеКонфигурации.Тэг КАК Тэг,
	|	ДочерниеКонфигурации.НомерСтроки КАК НомерСтроки
	|ИЗ Объекты КАК Объекты
	|ПОЛНОЕ СОЕДИНЕНИЕ
	|	ДочерниеКонфигурации КАК ДочерниеКонфигурации
	|ПО ДочерниеКонфигурации.Конфигурация = Объекты.Владелец
	|УПОРЯДОЧИТЬ ПО НомерСтроки";
	Запрос.УстановитьПараметр("ДочерниеКонфигурации", ОбщиеПеременные.ДочерниеКонфигурации);
	Запрос.УстановитьПараметр("Конфигурация", ОбщиеПеременные.Конфигурация);
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъектаМетаданных);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТегиРезультат;
	КонецЕсли;

	ВыборкаТегов = РезультатЗапроса.Выбрать();
	Пока ВыборкаТегов.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаТегов.Ссылка) Тогда
			// Есть объект метаданных в составе конфигурации.
			Продолжить;
		КонецЕсли;
		// К тегам на основании расхождений в структуре метаданных добавляется частица НЕ
		ПодстрокаТега = "НЕ " + СокрЛП(ВыборкаТегов.Тэг);
		ТегиРезультат.ТегОткрыт = ТегиРезультат.ТегОткрыт + ?(ТегиРезультат.ТегОткрыт = "", "", Символы.ПС) + "//++ " + ПодстрокаТега;	
 		ТегиРезультат.ТегЗакрыт = "//-- " + ПодстрокаТега + ?(ТегиРезультат.ТегЗакрыт = "", "", Символы.ПС + ТегиРезультат.ТегЗакрыт);	
	КонецЦикла;
	Возврат ТегиРезультат;
КонецФункции
#КонецОбласти
#Область ВыгрузкаРегистрацииВФайл
Процедура ВыгрузитьРегистрациюВФайл(мЗаписьXML, ОбщиеПеременные)
	мЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаРегистрации");
	// Регистрация
	ДобавитьЭлемент(мЗаписьXML, "ВерсияФормата",     "2.01");
	ДобавитьЭлемент(мЗаписьXML, "Ид",                Строка(ОбщиеПеременные.Регистрация.УникальныйИдентификатор()));
	ДобавитьЭлемент(мЗаписьXML, "Наименование",      Строка(ОбщиеПеременные.Регистрация.Наименование));
	ДобавитьЭлемент(мЗаписьXML, "ДатаВремяСоздания", ТекущаяДатаСеанса());
	
	// Регистрация - План обмена.
	ПланОбмена = СокрЛП(ОбщиеПеременные.Регистрация.ИмяПланаОбмена);
	Конфигурация = ОбщиеПеременные.Регистрация.Конфигурация;
	ОбщиеПеременные.Вставить("Конфигурация", Конфигурация);
	мЗаписьXML.ЗаписатьНачалоЭлемента("ПланОбмена"); // ПланОбмена
	
	УстановитьАтрибут(мЗаписьXML, "Имя", ПланОбмена);
	
	Если СтрНайти(ПланОбмена, "ПланОбменаСсылка.") = 0 Тогда
		ПланОбмена = "ПланОбменаСсылка." + ПланОбмена;
	КонецЕсли;
	
	Стр = XMLСтрока(ПланОбмена);
	
	мЗаписьXML.ЗаписатьТекст(Стр);
	мЗаписьXML.ЗаписатьКонецЭлемента(); // ПланОбмена
	
	// Регистрация - Конфигурация.
	мЗаписьXML.ЗаписатьНачалоЭлемента("Конфигурация");
	
	Стр = XMLСтрока(Конфигурация.Имя);
	УстановитьАтрибут(мЗаписьXML, "ВерсияПлатформы",     ПолучитьПредставлениеПриложения(Конфигурация.Приложение));
	УстановитьАтрибут(мЗаписьXML, "ВерсияКонфигурации",  Конфигурация.Версия);
	УстановитьАтрибут(мЗаписьXML, "СинонимКонфигурации", Конфигурация.Синоним);
	
	мЗаписьXML.ЗаписатьТекст(Стр);
	
	мЗаписьXML.ЗаписатьКонецЭлемента(); // Конфигурация
	
	ДобавитьЭлемент(мЗаписьXML, "Комментарий", Строка(ОбщиеПеременные.Регистрация.Описание));
	
	ВыгрузитьСоставПланаОбмена(мЗаписьXML, ПланОбмена, Конфигурация);
	
	мЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаРегистрацииОбъектов");
	
	ВыгрузитьПравилаРегистрацииОбъектов(мЗаписьXML, ОбщиеПеременные);
	
	мЗаписьXML.ЗаписатьКонецЭлемента(); //ПравилаРегистрацииОбъектов
	
	мЗаписьXML.ЗаписатьКонецЭлемента(); // ПравилаРегистрации

КонецПроцедуры

Процедура ВыгрузитьПравилаРегистрацииОбъектов(мЗаписьXML, ОбщиеПеременные)
	Запрос = ПолучитьЗапросПравилаРегистрацииОбъектов(ОбщиеПеременные);
	ДеревоРезультата = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ВыгрузитьСтрокиДереваПРО(мЗаписьXML, ОбщиеПеременные, ДеревоРезультата);

КонецПроцедуры

Процедура ВыгрузитьСтрокиДереваПРО(мЗаписьXML, ОбщиеПеременные, Дерево)
	Для Каждого ПРО Из Дерево.Строки Цикл
		Если НЕ ПРО.ЭтоГруппа Тогда
			// Очищаем таблицу свойств объекта.
			ОбщиеПеременные.Вставить("ТаблицаСвойствОбъекта", Неопределено);
			мЗаписьXML.ЗаписатьНачалоЭлемента("Правило");
			ЕстьТеги = (ПРО.Ссылка.Теги.Количество() > 0);
			Если ЕстьТеги Тогда
				// Правила с тегами принудительно отключаются при выгрузке
				УстановитьАтрибут(мЗаписьXML,"Отключить", Истина);
			Иначе
				УстановитьАтрибут(мЗаписьXML,"Отключить", ПРО.Отключить);
			КонецЕсли;
			УстановитьАтрибут(мЗаписьXML,"Валидное",  Истина);
			
			// Реквизиты правила
			ДобавитьЭлемент(мЗаписьXML,"Код",                         ПРО.Код);
			ДобавитьЭлемент(мЗаписьXML,"Наименование",                ПРО.Наименование);
			ДобавитьЭлемент(мЗаписьXML,"Описание",                    ПРО.Описание);
			ДобавитьЭлемент(мЗаписьXML,"Комментарий",                 ПРО.Комментарий);
			
			ДобавитьЭлемент(мЗаписьXML,"ОбъектНастройки",             ПРО.ОбъектНастройкиНаименование);
			Если ЕстьТеги Тогда
				ТегВырезкиСтрокой = "";
				Для Каждого СтрТег Из ПРО.Ссылка.Теги Цикл
					ТегВырезкиСтрокой = ТегВырезкиСтрокой + ?(ТегВырезкиСтрокой = "", "", Символы.ПС) + СокрЛП(СтрТег.Тег);
				КонецЦикла;
				ДобавитьЭлемент(мЗаписьXML,"ТегВырезки",             	  ТегВырезкиСтрокой);
			КонецЕсли;
			
			ТипОбъекта = ИмяЗначенияПеречисления(ОбщиеПеременные, ПРО.ОбъектНастройкиТип);
			
			// Свойства объекта настройки
			ДобавитьЭлемент(мЗаписьXML,"ОбъектМетаданныхИмя", ТипОбъекта + "." + СокрЛП(ПРО.ОбъектНастройкиИмя));
			ДобавитьЭлемент(мЗаписьXML,"ОбъектМетаданныхТип", ТипОбъекта);
			
			ДобавитьЭлемент(мЗаписьXML,"РеквизитРежимаВыгрузки", ПРО.РеквизитРежимаВыгрузки);
			
			ОтборПоСвойствамПланаОбмена = ПРО.ОтборПоСвойствамПланаОбмена.Получить();
			
			// Выгружаем элементы отбора по свойствам Плана обмена
			Если ТипЗнч(ОтборПоСвойствамПланаОбмена) = Тип("ДеревоЗначений") Тогда
				
				мЗаписьXML.ЗаписатьНачалоЭлемента("ОтборПоСвойствамПланаОбмена");
				Для Каждого ЭлементОтбора Из ОтборПоСвойствамПланаОбмена.Строки Цикл
					ВыгрузитьЭлементОтбораПланаОбмена(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, ПРО.ОбъектНастройкиСсылка);
				КонецЦикла;
				мЗаписьXML.ЗаписатьКонецЭлемента(); // ОтборПоСвойствамПланаОбмена
				
			КонецЕсли;
			
			ОтборПоСвойствамОбъекта = ПРО.ОтборПоСвойствамОбъекта.Получить();
			
			// Выгружаем элементы отбора по свойствам Объекта
			Если ТипЗнч(ОтборПоСвойствамОбъекта) = Тип("ДеревоЗначений") Тогда
				
				мЗаписьXML.ЗаписатьНачалоЭлемента("ОтборПоСвойствамОбъекта");
				
				Для Каждого ЭлементОтбора Из ОтборПоСвойствамОбъекта.Строки Цикл
					ВыгрузитьЭлементОтбораОбъекта(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, ПРО.ОбъектНастройкиСсылка);
				КонецЦикла;
				
				мЗаписьXML.ЗаписатьКонецЭлемента(); // ОтборПоСвойствамОбъекта
				
			КонецЕсли;
			
			// Выгружаем события правила
			ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(мЗаписьXML, ДобавитьПереводСтрокиЕслиЕстьТег(ПРО.АлгоритмПередОбработкойПравила),            "ПередОбработкой");
			ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(мЗаписьXML, ДобавитьПереводСтрокиЕслиЕстьТег(ПРО.АлгоритмПриОбработкеПравила),               "ПриОбработке");
			ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(мЗаписьXML, ДобавитьПереводСтрокиЕслиЕстьТег(ПРО.АлгоритмПриОбработкеДополнительныйПравила), "ПриОбработкеДополнительный");
			ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(мЗаписьXML, ДобавитьПереводСтрокиЕслиЕстьТег(ПРО.АлгоритмПослеОбработкиПравила),             "ПослеОбработки");
			ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(мЗаписьXML, ДобавитьПереводСтрокиЕслиЕстьТег(ПРО.АлгоритмПакетнаяОбработкаРегистрации),      "ПакетнаяОбработка");
			
			мЗаписьXML.ЗаписатьКонецЭлемента(); // Правило
			
		Иначе
			
			мЗаписьXML.ЗаписатьНачалоЭлемента("Группа");
			
			УстановитьАтрибут(мЗаписьXML, "Отключить", ПРО.Отключить);
			
			// Реквизиты группы
			ДобавитьЭлемент(мЗаписьXML,"Код",          ПРО.Код);
			ДобавитьЭлемент(мЗаписьXML,"Наименование", ПРО.Наименование);
			ДобавитьЭлемент(мЗаписьXML,"Описание",     ПРО.Описание);
			ДобавитьЭлемент(мЗаписьXML,"Комментарий",  ПРО.Комментарий);
			ДобавитьЭлемент(мЗаписьXML,"ТипГруппы",    ИмяЗначенияПеречисления(ОбщиеПеременные, ПРО.ТипГруппы));
			
			ВыгрузитьСтрокиДереваПРО(мЗаписьXML, ОбщиеПеременные, ПРО);
			
			мЗаписьXML.ЗаписатьКонецЭлемента(); // Группа
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура ВыгрузитьЭлементОтбораОбъекта(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, ОбъектНастройкиСсылка)
	Если НЕ ЭлементОтбора.ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(ЭлементОтбора.СвойствоОбъекта) Тогда
			Возврат;
		КонецЕсли;
		
		мЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементОтбора");
		
		// Свойства элемента отбора
		ДобавитьЭлемент(мЗаписьXML, "ТипСвойстваОбъекта",  ЭлементОтбора.ТипСвойстваОбъекта);
		ДобавитьЭлемент(мЗаписьXML, "ВидСравнения",        ИмяЗначенияПеречисления(ОбщиеПеременные, ЭлементОтбора.ВидСравнения));
		ДобавитьЭлемент(мЗаписьXML, "СвойствоОбъекта",    ЭлементОтбора.СвойствоОбъекта);
		Если ЭлементОтбора.Владелец().Колонки.Найти("ВидЭлементаОтбора") <> Неопределено Тогда
			ДобавитьЭлемент(мЗаписьXML, "Вид", ЭлементОтбора["ВидЭлементаОтбора"]);
		КонецЕсли;
		// Значение константы может содержать дефолтное значение типа; его тоже выгружаем
		ДобавитьЭлементСПустымЗначением(мЗаписьXML, "ЗначениеКонстанты", ЭлементОтбора.ЗначениеКонстанты);
		Если ОбщиеПеременные.ТаблицаСвойствОбъекта = Неопределено Тогда
			ЗаполнитьТаблицуСвойствОбъекта(ОбщиеПеременные, ОбъектНастройкиСсылка);
		КонецЕсли;
		// Выгружаем свойства объекта 
		ВыгрузитьТаблицуСвойств(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора.СвойствоОбъекта, "ТаблицаСвойствОбъекта");
		
		мЗаписьXML.ЗаписатьКонецЭлемента(); // ЭлементОтбора
		
	Иначе
		ВыгрузитьГруппуСвойств(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, ОбъектНастройкиСсылка, Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ВыгрузитьЭлементОтбораПланаОбмена(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, ОбъектНастройкиСсылка)
	Если НЕ ЭлементОтбора.ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(ЭлементОтбора.СвойствоПланаОбмена) Тогда
			Возврат;
		КонецЕсли;
		
		мЗаписьXML.ЗаписатьНачалоЭлемента("ЭлементОтбора");
		// Свойства элемента отбора
		ДобавитьЭлемент(мЗаписьXML, "ЭтоСтрокаКонстанты",  ЭлементОтбора.ЭтоСтрокаКонстанты);
		ДобавитьЭлемент(мЗаписьXML, "ТипСвойстваОбъекта",  ЭлементОтбора.ТипСвойстваОбъекта);
		ДобавитьЭлемент(мЗаписьXML, "СвойствоПланаОбмена", ЭлементОтбора.СвойствоПланаОбмена);
		ДобавитьЭлемент(мЗаписьXML, "ВидСравнения",        ИмяЗначенияПеречисления(ОбщиеПеременные, ЭлементОтбора.ВидСравнения));
		// Свойство объекта - строка или значение константы;
		// Значение константы может содержать дефолтное значение типа; его тоже выгружаем.
		ДобавитьЭлементСПустымЗначением(мЗаписьXML, "СвойствоОбъекта", ЭлементОтбора.СвойствоОбъекта);
		Если ОбщиеПеременные.ТаблицаСвойствОбъекта = Неопределено Тогда
			ЗаполнитьТаблицуСвойствОбъекта(ОбщиеПеременные, ОбъектНастройкиСсылка);
		КонецЕсли;
		// Выгружаем свойства объекта 
		Если СтрНайти(ЭлементОтбора.ТипСвойстваОбъекта, ",") > 0 Тогда  
			ИмяРодителя = "";
			СтруктураПоискаСвойствПланаОбмена = Новый Структура("Наименование", ЭлементОтбора.СвойствоПланаОбмена);
			ПозицияТочки = СтрНайти(ЭлементОтбора.СвойствоПланаОбмена, ".");
			Если ПозицияТочки > 0 Тогда 
				СтруктураПоискаСвойствПланаОбмена.Наименование = Сред(ЭлементОтбора.СвойствоПланаОбмена, ПозицияТочки + 1);  
				ИмяРодителя = Сред(ЭлементОтбора.СвойствоПланаОбмена, 2, ПозицияТочки-3);      // Из имени ТЧ убираем []

			КонецЕсли;
			СтрокиТаблицыСвойствПланаОбмена = ОбщиеПеременные.ТаблицаСвойствПланаОбмена.НайтиСтроки(СтруктураПоискаСвойствПланаОбмена);  
			Если СтрокиТаблицыСвойствПланаОбмена.Количество() > 0 Тогда
				ИскомыйТипСвойства = "";
				Для Каждого СтрокаТабСвойств Из СтрокиТаблицыСвойствПланаОбмена Цикл 
					Если ИмяРодителя = "" И НЕ ЗначениеЗаполнено(СтрокаТабСвойств.Родитель) Тогда
						ИскомыйТипСвойства = СтрокаТабСвойств.Тип;
						Прервать;
					КонецЕсли; 
					Если ИмяРодителя <> "" И СтрокаТабСвойств.Родитель.Наименование = ИмяРодителя Тогда
						ИскомыйТипСвойства = СтрокаТабСвойств.Тип;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ИскомыйТипСвойства = "";
			КонецЕсли;
		Иначе  
			ИскомыйТипСвойства = ЭлементОтбора.ТипСвойстваОбъекта;
		КонецЕсли;
		ВыгрузитьТаблицуСвойств(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора.СвойствоОбъекта, "ТаблицаСвойствОбъекта", ИскомыйТипСвойства);
		
		// Выгружаем свойства плана обмена
		Если НЕ ОбщиеПеременные.Свойство("ТаблицаСвойствПланаОбмена") Тогда
			ЗаполнитьТаблицуСвойствПланаОбмена(ОбщиеПеременные);
		КонецЕсли;
		
		ВыгрузитьТаблицуСвойств(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора.СвойствоПланаОбмена, "ТаблицаСвойствПланаОбмена");
		мЗаписьXML.ЗаписатьКонецЭлемента(); // ЭлементОтбора
		
	Иначе
		ВыгрузитьГруппуСвойств(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, ОбъектНастройкиСсылка, Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ВыгрузитьГруппуСвойств(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, ОбъектНастройкиСсылка, ЭтоОтборПоПлануОбмена)
	мЗаписьXML.ЗаписатьНачалоЭлемента("Группа");

	// Свойства группы элементов отбора
	ДобавитьЭлемент(мЗаписьXML, "БулевоЗначениеГруппы", ИмяЗначенияПеречисления(ОбщиеПеременные, ЭлементОтбора.БулевоЗначениеГруппы));
	
	Для Каждого ЭлементОтбораВложенный Из ЭлементОтбора.Строки Цикл
		Если ЭтоОтборПоПлануОбмена Тогда
			ВыгрузитьЭлементОтбораПланаОбмена(мЗаписьXML, ОбщиеПеременные, ЭлементОтбораВложенный, ОбъектНастройкиСсылка);
		Иначе
			ВыгрузитьЭлементОтбораОбъекта(мЗаписьXML, ОбщиеПеременные, ЭлементОтбораВложенный, ОбъектНастройкиСсылка);
		КонецЕсли;
	КонецЦикла;
	
	мЗаписьXML.ЗаписатьКонецЭлемента(); // Группа

КонецПроцедуры

Процедура СообщитьОбОшибкеОбработки(Код = -1, ОписаниеОшибки = "")
	Сообщения = Новый Соответствие;
	
	Сообщения.Вставить(0,  НСтр("ru = 'Внутренняя ошибка'"));
	Сообщения.Вставить(1,  НСтр("ru = 'Ошибка при выгрузке правил регистрации в XML-файл данных'"));
	Сообщения.Вставить(2,  НСтр("ru = 'Не указана регистрация для выгрузки в XML-файл данных'"));
	Сообщения.Вставить(3,  НСтр("ru = 'Не указано имя файла для выгрузки правил регистрации'"));
	Сообщения.Вставить(4,  НСтр("ru = 'Ошибка при архивировании файла выгрузки'"));
	Сообщения.Вставить(5,  НСтр("ru = 'Ошибка при копировании файла выгрузки'"));
	Сообщения.Вставить(6,  НСтр("ru = 'Ошибка при выгрузке правил регистрации в модуль'"));
	
	ТекстСообщения = Сообщения[Код];
	
	ТекстСообщения = ?(ТекстСообщения = Неопределено, "", ТекстСообщения);
	
	ТекстСообщения = Сообщения.Получить(Код);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	ЗаписьЖурналаРегистрации(НСтр("ru='Выгрузка правил регистрации'"), УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);
	
КонецПроцедуры

Функция ПолучитьПредставлениеПриложения(Приложение)
	
	Если      Приложение = Перечисления.Приложения.Предприятие77         Тогда Возврат "7.7";
	ИначеЕсли Приложение = Перечисления.Приложения.Предприятие80         Тогда Возврат "8.1";
	ИначеЕсли Приложение = Перечисления.Приложения.УправляемоеПриложение Тогда Возврат "8.2";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Возвращает строку - имя переданного значения перечисления
//
// Параметры:
//  Значение       - Значение перечисления
//
// Возвращаемое значение:
//  Строка - имя переданного значения перечисления
//
Функция ИмяЗначенияПеречисления(ОбщиеПеременные, Значение)
	Если Значение = Null
		Или Значение.Пустая() Тогда
		
		Возврат "";
	КонецЕсли;
	Если ОбщиеПеременные.Свойство("СоответствиеПеречисленийИИмен") Тогда
		СоответствиеПеречисленийИИмен = ОбщиеПеременные.СоответствиеПеречисленийИИмен;
		ЗначениеСоответствия = СоответствиеПеречисленийИИмен.Получить(Значение);
	Иначе
		СоответствиеПеречисленийИИмен = Новый Соответствие;
		ЗначениеСоответствия = Неопределено;
	КонецЕсли;
	
	Если ЗначениеСоответствия = Неопределено Тогда
		
		ОбъектМД = Значение.Метаданные();
		ИндексЗначения = Перечисления[ОбъектМД.Имя].Индекс(Значение);

		ЗначениеСоответствия = ОбъектМД.ЗначенияПеречисления[ИндексЗначения].Имя;
		
		СоответствиеПеречисленийИИмен.Вставить(Значение, ЗначениеСоответствия); 
		ОбщиеПеременные.Вставить("СоответствиеПеречисленийИИмен", СоответствиеПеречисленийИИмен);
	КонецЕсли;
	
	Возврат ЗначениеСоответствия;
			
КонецФункции // ИмяЗначенияПеречисления()

Процедура ЗаполнитьТаблицуСвойствПланаОбмена(ОбщиеПеременные)
	// Поиск объекта - плана обмена.
	ИмяПланаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщиеПеременные.Регистрация, "ИмяПланаОбмена");
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ПОМЕСТИТЬ ПланОбмена
	|ИЗ Справочник.Объекты
	|ГДЕ Владелец = &Конфигурация И Наименование ПОДОБНО &ИмяПланаОбмена И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланОбмена)
	|;
	|ВЫБРАТЬ
	|	Свойства.ЭтоГруппа,
	|	Свойства.Ссылка,
	|	Свойства.Наименование,
	|	Свойства.Вид,
	|	Свойства.Родитель,
	|	ВЫБОР КОГДА Свойства.ЭтоГруппа ТОГДА """"
	|	ИНАЧЕ ЕстьNULL(ТипыСвойства.Тип.Наименование,"""")
	|	КОНЕЦ КАК Тип, 
	|	ВЫБОР КОГДА Свойства.ЭтоГруппа ТОГДА NULL
	|	ИНАЧЕ ТипыСвойства.Тип
	|	КОНЕЦ КАК ТипСсылкаОбъект 
	|ИЗ Справочник.Свойства КАК Свойства
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК ТипыСвойства
	|ПО Свойства.Ссылка = ТипыСвойства.Ссылка
	|ГДЕ Свойства.Владелец В (ВЫБРАТЬ Ссылка ИЗ ПланОбмена) И 
	|	(ЕстьNULL(Свойства.Родитель.Вид,"""") = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть) ИЛИ Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка))";
	Запрос.УстановитьПараметр("ИмяПланаОбмена", "%" + ИмяПланаОбмена);
	Запрос.УстановитьПараметр("Конфигурация", ОбщиеПеременные.Конфигурация);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ОбщиеПеременные.Вставить("ТаблицаСвойствПланаОбмена", РезультатЗапроса);
КонецПроцедуры

Процедура ЗаполнитьТаблицуСвойствОбъекта(ОбщиеПеременные, ОбъектНастройкиСсылка)
	ИмяПланаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщиеПеременные.Регистрация, "ИмяПланаОбмена");
			
	Запрос = ЗапросСвойстваОбъекта(ОбъектНастройкиСсылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	// Для ссылочных типов добавляем свойство Ссылка.
	ТипОбъектаНастройки = ОбъектНастройкиСсылка.Тип;
	Если ТипОбъектаНастройки = Перечисления.ТипыОбъектов.БизнесПроцесс
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.ВидСубконто
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.Документ
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.Задача
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.ПланВидовРасчета
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.ПланОбмена
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.ПланСчетов
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.Справочник Тогда
		СвойствоСсылка = РезультатЗапроса.Добавить();
		СвойствоСсылка.ЭтоГруппа = Ложь;
		СвойствоСсылка.Наименование = "Ссылка";
		СвойствоСсылка.Вид = Перечисления.ВидыСвойств.Свойство;
		СвойствоСсылка.Тип = ОбъектНастройкиСсылка;
	КонецЕсли;
		
	ОбщиеПеременные.Вставить("ТаблицаСвойствОбъекта", РезультатЗапроса);
КонецПроцедуры

Функция ЗапросСвойстваОбъекта(ОтборОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Свойства.ЭтоГруппа,
	|	Свойства.Ссылка,
	|	Свойства.Наименование,
	|	Свойства.Вид,
	|	Свойства.Родитель,
	|	ВЫБОР КОГДА Свойства.ЭтоГруппа ТОГДА """"
	|	ИНАЧЕ ЕстьNULL(ТипыСвойства.Тип.Наименование,"""")
	|	КОНЕЦ КАК Тип,
	|	ВЫБОР КОГДА Свойства.ЭтоГруппа ТОГДА NULL
	|	ИНАЧЕ ТипыСвойства.Тип
	|	КОНЕЦ КАК ТипСсылкаОбъект
	|ИЗ Справочник.Свойства КАК Свойства
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК ТипыСвойства
	|ПО Свойства.Ссылка = ТипыСвойства.Ссылка
	|ГДЕ Свойства.Владелец В (&ОбъектыНастройки)
	|	И (Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|		ИЛИ ЕстьNULL(Свойства.Родитель.Вид, """") = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть)
	|	)
	|";
	Если ТипЗнч(ОтборОбъект) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ОбъектыНастройки", ОтборОбъект);
	Иначе
		ОбъектыНастройки = Новый Массив;
		ОбъектыНастройки.Добавить(ОтборОбъект);
		Запрос.УстановитьПараметр("ОбъектыНастройки", ОбъектыНастройки);
	КонецЕсли;
	Возврат Запрос;
КонецФункции

Процедура ВыгрузитьТаблицуСвойств(мЗаписьXML, ОбщиеПеременные, СвойствоОбъекта, ИмяУзла, ТипСвойстваОбъекта = Неопределено)
	Если ПустаяСтрока(СвойствоОбъекта)
		Или ОбщиеПеременные[ИмяУзла].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Свойство может быть "через точку" - реквизит шапки или табличной части.
	Если СтрНайти(СвойствоОбъекта, ".") > 0 Тогда
		ВыгрузитьТаблицуСвойствСИерархией(мЗаписьXML, ОбщиеПеременные, СвойствоОбъекта, ИмяУзла, ТипСвойстваОбъекта);
		Возврат;
	КонецЕсли;
	ТаблицаСвойств = ОбщиеПеременные[ИмяУзла];
	СтруктураПоиска = Новый Структура("Наименование", СвойствоОбъекта);
	СтрокиСвойств = ТаблицаСвойств.НайтиСтроки(СтруктураПоиска);
	ИндексСтрокиСвойств = 0;
	ТипСвойстваНайден = Ложь;
	
	Если СтрокиСвойств.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли СтрокиСвойств.Количество() > 1 И ТипСвойстваОбъекта <> Неопределено Тогда
		Для Каждого СтрокаСв Из СтрокиСвойств Цикл
			Если СтрокаСв.Тип = ТипСвойстваОбъекта Тогда
				ТипСвойстваНайден = Истина;
				Прервать;
			КонецЕсли;
			ИндексСтрокиСвойств = ИндексСтрокиСвойств + 1;
		КонецЦикла;
	КонецЕсли;
	Если НЕ ТипСвойстваНайден Тогда
		ИндексСтрокиСвойств = 0;	
	КонецЕсли;
	мЗаписьXML.ЗаписатьНачалоЭлемента(ИмяУзла);
	ДобавитьСвойствоВТаблицуСвойств(мЗаписьXML, СтрокиСвойств[ИндексСтрокиСвойств]);
	
	мЗаписьXML.ЗаписатьКонецЭлемента(); // ИмяУзла
КонецПроцедуры

Процедура ВыгрузитьТаблицуСвойствСИерархией(мЗаписьXML, ОбщиеПеременные, СвойствоОбъекта, ИмяУзла, ТипСвойстваОбъекта)
	ТаблицаСвойств = ОбщиеПеременные[ИмяУзла];

	НаборРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СвойствоОбъекта, ".");
	КоличествоРеквизитов = НаборРеквизитов.Количество();
	ТегОткрыт = Ложь;
	ЭтоТабличнаяЧасть = Ложь;
	ОбъектГлавногоРеквизита = Новый Массив;
	Для СчетчикРеквизитов = 0 По КоличествоРеквизитов-1 Цикл
		ИмяСвойства = НаборРеквизитов[СчетчикРеквизитов];
		// Табличная часть может быть забрана в []
		ИмяСвойстваДляПоиска = СтрЗаменить(ИмяСвойства, "[", "");
		ИмяСвойстваДляПоиска = СтрЗаменить(ИмяСвойстваДляПоиска, "]", "");
		Если ИмяСвойства <> ИмяСвойстваДляПоиска Тогда
			ЭтоТабличнаяЧасть = Истина;
		КонецЕсли;
		СтруктураПоиска = Новый Структура("Наименование", ИмяСвойстваДляПоиска);
		// Обрабатываем реквизит объекта.
		Если СчетчикРеквизитов = 0 Или ЭтоТабличнаяЧасть Или ИмяУзла = "ТаблицаСвойствПланаОбмена" Тогда
			СтрокиСвойств = ТаблицаСвойств.НайтиСтроки(СтруктураПоиска);
		Иначе
			ЗапросПодчиненные = ЗапросСвойстваОбъекта(ОбъектГлавногоРеквизита);
			ТаблицаПодчиненные = ЗапросПодчиненные.Выполнить().Выгрузить();
			СтрокиСвойств = ТаблицаПодчиненные.НайтиСтроки(СтруктураПоиска);
		КонецЕсли;
		Если СтрокиСвойств.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ИндексСтрокиСвойств = 0;
		Если СтрокиСвойств.Количество() > 1 И ТипСвойстваОбъекта <> Неопределено Тогда
			Для Каждого СтрокаСв Из СтрокиСвойств Цикл
				Если СтрокаСв.Тип = ТипСвойстваОбъекта Тогда
					Прервать;
				КонецЕсли;
				ИндексСтрокиСвойств = ИндексСтрокиСвойств + 1;
			КонецЦикла;
		КонецЕсли;
		Если ИндексСтрокиСвойств > СтрокиСвойств.Количество() - 1 Тогда
			// Несколько свойств но ни одно не подходит по типу - берем первое.
			ИндексСтрокиСвойств = 0;
		КонецЕсли;
		Если НЕ ТегОткрыт Тогда
			мЗаписьXML.ЗаписатьНачалоЭлемента(ИмяУзла);
			ТегОткрыт = Истина;
		КонецЕсли;
		Если СчетчикРеквизитов = 0 И НЕ ЭтоТабличнаяЧасть Тогда
			Для Каждого СтрокаСвойства Из СтрокиСвойств Цикл
				Если ЗначениеЗаполнено(СтрокаСвойства.ТипСсылкаОбъект) Тогда
					ОбъектГлавногоРеквизита.Добавить(СтрокаСвойства.ТипСсылкаОбъект);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ДобавитьСвойствоВТаблицуСвойств(мЗаписьXML, СтрокиСвойств[ИндексСтрокиСвойств]); 		
	КонецЦикла;
	Если ТегОткрыт Тогда
		мЗаписьXML.ЗаписатьКонецЭлемента(); // ИмяУзла
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСвойствоВТаблицуСвойств(мЗаписьXML, Выборка)
	мЗаписьXML.ЗаписатьНачалоЭлемента("Свойство");
	НаименованиеСвойства = СокрЛП(Выборка.Наименование);
	Если Выборка.Вид = Перечисления.ВидыСвойств.ТабличнаяЧасть Тогда
		НаименованиеСвойства = "["+НаименованиеСвойства+"]"
	КонецЕсли;
	ДобавитьЭлемент(мЗаписьXML, "Наименование", НаименованиеСвойства);
	ДобавитьЭлемент(мЗаписьXML, "Тип",          Выборка.Тип);
	ДобавитьЭлемент(мЗаписьXML, "Вид",          Выборка.Вид);
	
	мЗаписьXML.ЗаписатьКонецЭлемента(); // Свойство
КонецПроцедуры

Процедура ВыгрузитьСоставПланаОбмена(мЗаписьXML, ПланОбмена, Конфигурация)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СвойстваТипы.Ссылка.Авторегистрация КАК Авторегистрация,
	|	СвойстваТипы.Тип.Наименование       КАК Тип
	|ИЗ
	|	Справочник.Свойства.Типы КАК СвойстваТипы
	|ГДЕ
	|	  СвойстваТипы.Ссылка.Владелец.Наименование ПОДОБНО &ПланОбмена
	|	И СвойстваТипы.Ссылка.Владелец.Владелец = &Конфигурация
	|	И СвойстваТипы.Ссылка.Вид      = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ЭлементСоставаПланаОбмена)
	|УПОРЯДОЧИТЬ ПО СвойстваТипы.Тип.Наименование";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПланОбмена", "%"+ПланОбмена);
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Запрос.Текст = ТекстЗапроса;
	
	СоставПланаОбмена = Запрос.Выполнить().Выгрузить();
	мЗаписьXML.ЗаписатьНачалоЭлемента("СоставПланаОбмена");
	Для Каждого СтрокаТаблицы Из СоставПланаОбмена Цикл
		
		мЗаписьXML.ЗаписатьНачалоЭлемента("Элемент");
		
		ДобавитьЭлемент(мЗаписьXML, "Тип",             СтрокаТаблицы.Тип);
		ДобавитьЭлемент(мЗаписьXML, "Авторегистрация", СтрокаТаблицы.Авторегистрация);
		
		мЗаписьXML.ЗаписатьКонецЭлемента(); // Элемент
		
	КонецЦикла;
	мЗаписьXML.ЗаписатьКонецЭлемента(); // СоставПланаОбмена
КонецПроцедуры

#Область ПроцедурыРаботыСОбъектамиXML
// Добавляет новый xml-узел, устанавливает значение
//
// Параметры: 
//  Имя            - имя добавляемого узла
//  Значение       - значение добавляемого узла
//
Процедура ДобавитьЭлемент(мЗаписьXML, Имя, Значение)

	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	мЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	Стр = XMLСтрока(Значение);
	
	мЗаписьXML.ЗаписатьТекст(Стр);
	мЗаписьXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

// Добавляет новый xml-узел, устанавливает значение
//
// Параметры: 
//  Имя            - имя добавляемого узла
//  Значение       - значение добавляемого узла
//
Процедура ДобавитьЭлементСПустымЗначением(мЗаписьXML, Имя, Значение)
	
	Если ПустаяСтрока(Строка(Значение)) Тогда
		Возврат;
	КонецЕсли;
	
	мЗаписьXML.ЗаписатьНачалоЭлемента(Имя);
	Стр = XMLСтрока(Значение);
	
	мЗаписьXML.ЗаписатьТекст(Стр);
	мЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры


// Устанавливает атрибут xml-узла
//
// Параметры: 
//  Имя            - имя атрибута
//  Значение       - устанавливаемое значение
//
Процедура УстановитьАтрибут(мЗаписьXML, Имя, Значение)

	Если Значение = Null Тогда
		СтрокаЗаписи = "";
	Иначе
		СтрокаЗаписи = XMLСтрока(Значение);
	КонецЕсли;
	
	мЗаписьXML.ЗаписатьАтрибут(Имя, СтрокаЗаписи);
	
КонецПроцедуры

Процедура ВыгрузитьСтроковоеЗначениеТолькоЕслиНеПустая(мЗаписьXML, ЗначениеЭлемента, ИмяСохранения)
	
	Если ПустаяСтрока(ЗначениеЭлемента) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЭлемент(мЗаписьXML, ИмяСохранения, ЗначениеЭлемента);
	
КонецПроцедуры

Функция ДобавитьПереводСтрокиЕслиЕстьТег(ТекстОбработчика)
	Если ПустаяСтрока(ТекстОбработчика) Тогда
		Возврат ТекстОбработчика;
	КонецЕсли; 
	ДлинаСтроки = СтрДлина(ТекстОбработчика);
	Если Сред(ТекстОбработчика, ДлинаСтроки, 1) = Символы.ПС Тогда
		Возврат ТекстОбработчика;
	КонецЕсли;
	// получаем первую и последнюю строку. 
	ПерваяСтрокаОбработчика = СтрПолучитьСтроку(ТекстОбработчика, 1);
	Если СтрНайти(ПерваяСтрокаОбработчика, "//++") > 0 Тогда
		ТекстОбработчика = Символы.ПС + ТекстОбработчика;
	КонецЕсли; 
	// В последнюю строку перевод строки добавляется безусловно.
	ТекстОбработчика = ТекстОбработчика + Символы.ПС;
	Возврат ТекстОбработчика;
КонецФункции

#КонецОбласти
#КонецОбласти
#Область ЗапросыПоПравиламРегистрации
Функция ПолучитьЗапросПравилаРегистрацииОбъектов(ОбщиеПеременные)
	Запрос = Новый Запрос();
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		Если ОбщиеПеременные.ПоСостояниюХранилища Тогда
			КОбработке = "ВЫБРАТЬ
			|	Правила.Ссылка КАК Ссылка
			|ИЗ Справочник.ПравилаРегистрацииОбъектов КАК Правила
			|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
			|	И Правила.Владелец = &Регистрация
			|	И (Правила.ЭтоГруппа 
			|	ИЛИ Правила.Захвачен = ЛОЖЬ
			|	ИЛИ Правила.Копия = ИСТИНА)";
		Иначе
			КОбработке = "
			|ВЫБРАТЬ
			|	Правила.Ссылка КАК Ссылка
			|ИЗ Справочник.ПравилаРегистрацииОбъектов КАК Правила
			|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
			|	И (Правила.ЭтоГруппа
			|	ИЛИ Правила.Захвачен = ЛОЖЬ)
			|	И Правила.Владелец = &Регистрация
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	Правила.Ссылка
			|ИЗ Справочник.ПравилаРегистрацииОбъектов КАК Правила
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник.ПравилаРегистрацииОбъектов
			|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
			|ПО ДанныеЗахвата.РабочаяКопия = Правила.Ссылка
			|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
			|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
			|	И Правила.Владелец = &Регистрация
			|	И (Правила.ЭтоГруппа ИЛИ Правила.Копия = ИСТИНА)
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	Правила.Ссылка
			|ИЗ Справочник.ПравилаРегистрацииОбъектов КАК Правила
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник.ПравилаРегистрацииОбъектов
			|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
			|ПО ДанныеЗахвата.Объект = Правила.Ссылка
			|	И ДанныеЗахвата.Пользователь = &ТекущийПользователь
			|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
			|	И Правила.Владелец = &Регистрация
			|	И (Правила.ЭтоГруппа ИЛИ (Правила.Копия = ЛОЖЬ И Правила.Захвачен = ИСТИНА))
			|";
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ
		|	Свод.Ссылка.ЭтоГруппа                           КАК ЭтоГруппа,
		|	Свод.Ссылка.Отключить                           КАК Отключить,
		|	Свод.Ссылка.Код                                 КАК Код,
		|	Свод.Ссылка.Наименование                        КАК Наименование,
		|	ВЫРАЗИТЬ(Свод.Ссылка.Описание КАК Строка(1000)) КАК Описание,
		|	Свод.Ссылка.Комментарий                         КАК Комментарий,
		|	Свод.Ссылка.ОбъектНастройки                     КАК ОбъектНастройки,
		|	Свод.Ссылка.ТипГруппы                           КАК ТипГруппы,
		|	Свод.Ссылка.ОтборПоСвойствамОбъекта             КАК ОтборПоСвойствамОбъекта,
		|	Свод.Ссылка.ОтборПоСвойствамПланаОбмена         КАК ОтборПоСвойствамПланаОбмена,
		|	Свод.Ссылка.АлгоритмПередОбработкойПравила            КАК АлгоритмПередОбработкойПравила,
		|	Свод.Ссылка.АлгоритмПриОбработкеПравила               КАК АлгоритмПриОбработкеПравила,
		|	Свод.Ссылка.АлгоритмПриОбработкеДополнительныйПравила КАК АлгоритмПриОбработкеДополнительныйПравила,
		|	Свод.Ссылка.АлгоритмПослеОбработкиПравила             КАК АлгоритмПослеОбработкиПравила, 
		|	Свод.Ссылка.АлгоритмПакетнаяОбработкаРегистрации 	  КАК АлгоритмПакетнаяОбработкаРегистрации,
		|
		|	Свод.Ссылка.РеквизитРежимаВыгрузкиОбъектовОбмена КАК РеквизитРежимаВыгрузкиОбъектовОбмена,		
		|	Свод.Ссылка							   КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаПРО
		|ИЗ (" + КОбработке +") КАК Свод
		|;";		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ПравилаРегистрацииОбъектов.ЭтоГруппа                           КАК ЭтоГруппа,
		|	ПравилаРегистрацииОбъектов.Отключить                           КАК Отключить,
		|	ПравилаРегистрацииОбъектов.Код                                 КАК Код,
		|	ПравилаРегистрацииОбъектов.Наименование                        КАК Наименование,
		|	ВЫРАЗИТЬ(ПравилаРегистрацииОбъектов.Описание КАК Строка(1000)) КАК Описание,
		|	ПравилаРегистрацииОбъектов.Комментарий                         КАК Комментарий,
		|	ПравилаРегистрацииОбъектов.ОбъектНастройки                     КАК ОбъектНастройки,
		|	ПравилаРегистрацииОбъектов.ТипГруппы                           КАК ТипГруппы,
		|	ПравилаРегистрацииОбъектов.ОтборПоСвойствамОбъекта             КАК ОтборПоСвойствамОбъекта,
		|	ПравилаРегистрацииОбъектов.ОтборПоСвойствамПланаОбмена         КАК ОтборПоСвойствамПланаОбмена,
		|
		|	ПравилаРегистрацииОбъектов.АлгоритмПередОбработкойПравила            КАК АлгоритмПередОбработкойПравила,
		|	ПравилаРегистрацииОбъектов.АлгоритмПриОбработкеПравила               КАК АлгоритмПриОбработкеПравила,
		|	ПравилаРегистрацииОбъектов.АлгоритмПриОбработкеДополнительныйПравила КАК АлгоритмПриОбработкеДополнительныйПравила,
		|	ПравилаРегистрацииОбъектов.АлгоритмПослеОбработкиПравила             КАК АлгоритмПослеОбработкиПравила,
		|	ПравилаРегистрацииОбъектов.АлгоритмПакетнаяОбработкаРегистрации 	 КАК АлгоритмПакетнаяОбработкаРегистрации,
		|
		|	ПравилаРегистрацииОбъектов.РеквизитРежимаВыгрузкиОбъектовОбмена КАК РеквизитРежимаВыгрузкиОбъектовОбмена,		
		|	ПравилаРегистрацииОбъектов.Ссылка							   КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаПРО
		|ИЗ 
		|	Справочник.ПравилаРегистрацииОбъектов КАК ПравилаРегистрацииОбъектов
		|ГДЕ
		|	ПравилаРегистрацииОбъектов.Владелец = &Регистрация
		|;";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	ПравилаРегистрацииОбъектов.Ссылка                              КАК Ссылка,
	|	ПравилаРегистрацииОбъектов.ЭтоГруппа                           КАК ЭтоГруппа,
	|	ПравилаРегистрацииОбъектов.Отключить                           КАК Отключить,
	|	ПравилаРегистрацииОбъектов.Код                                 КАК Код,
	|	ПравилаРегистрацииОбъектов.Наименование                        КАК Наименование,
	|	ПравилаРегистрацииОбъектов.Описание							   КАК Описание,
	|	ПравилаРегистрацииОбъектов.Комментарий                         КАК Комментарий,
	|	ПравилаРегистрацииОбъектов.ОбъектНастройки.Наименование        КАК ОбъектНастройкиНаименование,
	|	Объекты.Тип                                                    КАК ОбъектНастройкиТип,
	|	Объекты.Имя                                                    КАК ОбъектНастройкиИмя,
	|	ПравилаРегистрацииОбъектов.ОбъектНастройки                     КАК ОбъектНастройкиСсылка,
	|	ПравилаРегистрацииОбъектов.ТипГруппы                           КАК ТипГруппы,
	|	ПравилаРегистрацииОбъектов.ОтборПоСвойствамОбъекта             КАК ОтборПоСвойствамОбъекта,
	|	ПравилаРегистрацииОбъектов.ОтборПоСвойствамПланаОбмена         КАК ОтборПоСвойствамПланаОбмена,
	|
	|	ПравилаРегистрацииОбъектов.АлгоритмПередОбработкойПравила            КАК АлгоритмПередОбработкойПравила,
	|	ПравилаРегистрацииОбъектов.АлгоритмПриОбработкеПравила               КАК АлгоритмПриОбработкеПравила,
	|	ПравилаРегистрацииОбъектов.АлгоритмПриОбработкеДополнительныйПравила КАК АлгоритмПриОбработкеДополнительныйПравила,
	|	ПравилаРегистрацииОбъектов.АлгоритмПослеОбработкиПравила             КАК АлгоритмПослеОбработкиПравила,
	|	ПравилаРегистрацииОбъектов.АлгоритмПакетнаяОбработкаРегистрации 	 КАК АлгоритмПакетнаяОбработкаРегистрации,
	|
	|	ПравилаРегистрацииОбъектов.РеквизитРежимаВыгрузкиОбъектовОбмена КАК РеквизитРежимаВыгрузки
	|ИЗ
	|	ТаблицаПРО КАК ПравилаРегистрацииОбъектов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК Объекты
	|	ПО Объекты.Ссылка = ПравилаРегистрацииОбъектов.ОбъектНастройки
	|		И Объекты.Владелец = &Конфигурация
	|УПОРЯДОЧИТЬ ПО
	|	ПравилаРегистрацииОбъектов.Ссылка ИЕРАРХИЯ,
	|	ПравилаРегистрацииОбъектов.Наименование
	|";
	
	Запрос.УстановитьПараметр("Регистрация", ОбщиеПеременные.Регистрация);
	Запрос.УстановитьПараметр("Конфигурация", ОбщиеПеременные.Конфигурация);
	Возврат Запрос;
КонецФункции 

Функция ОбработатьТаблицуОтборов(ВыборкаОтборов, ПроцедурыОбщихОтборов, ОбщиеПеременные)
	ТаблицаОтборов = Новый ТаблицаЗначений;
	ТаблицаОтборов.Колонки.Добавить("ОбъектНастройкиСсылка");
	ТаблицаОтборов.Колонки.Добавить("Ссылка");
	ТаблицаОтборов.Колонки.Добавить("ОтборПоСвойствамОбъектаСтрокой");
	ТаблицаОтборов.Колонки.Добавить("ОтборПоСвойствамПланаОбменаСтрокой");
	ТаблицаОтборов.Колонки.Добавить("ИмяПроцедурыОтборОбъекта");
	ТаблицаОтборов.Колонки.Добавить("ИмяПроцедурыОтборПланаОбмена");
	ТаблицаОтборов.Колонки.Добавить("Количество");
	ТаблицаОтборов.Колонки.Добавить("ТегОткрыт");
	ТаблицаОтборов.Колонки.Добавить("ТегЗакрыт");
	ЕстьПустойОтборПоСвойствамОбъекта = Ложь;
	ЕстьПустойОтборПоСвойствамПланаОбмена = Ложь;

	Пока ВыборкаОтборов.Следующий() Цикл
		СтрокаОтборов = ТаблицаОтборов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОтборов, ВыборкаОтборов, "Ссылка, ОбъектНастройкиСсылка");
		ТекущийТэг = ОпределитьТекущийТэг(ВыборкаОтборов, ОбщиеПеременные);
		Если ТекущийТэг.ТегОткрыт <> "" Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОтборов, ТекущийТэг, "ТегОткрыт, ТегЗакрыт");
		Иначе
			СтрокаОтборов.ТегОткрыт = "";
			СтрокаОтборов.ТегЗакрыт = "";
		КонецЕсли;
	
		ОбщиеПеременные.Вставить("ТаблицаСвойствОбъекта", Неопределено);

		ОтборПоСвойствамОбъекта = ВыборкаОтборов.ОтборПоСвойствамОбъекта.Получить();
		ОтборПоСвойствамПланаОбмена = ВыборкаОтборов.ОтборПоСвойствамПланаОбмена.Получить(); 
		ТекстОтборПоСвойствамПланаОбмена = "";
		Если ТипЗнч(ОтборПоСвойствамПланаОбмена) = Тип("ДеревоЗначений")
			И ОтборПоСвойствамПланаОбмена.Строки.Количество() > 0 Тогда
			мЗаписьXML = Новый ЗаписьXML;
			мЗаписьXML.УстановитьСтроку();
			мЗаписьXML.ЗаписатьНачалоЭлемента("ОтборПоСвойствамПланаОбмена");
			ОтборЗаполнен = Ложь;
			Для Каждого ЭлементОтбора Из ОтборПоСвойствамПланаОбмена.Строки Цикл
				Если ЭлементОтбора.ЭтоГруппа Тогда
					ОтборЗаполнен = ЗначениеЗаполнено(ЭлементОтбора.БулевоЗначениеГруппы);
				ИначеЕсли ЗначениеЗаполнено(ЭлементОтбора.СвойствоПланаОбмена) Тогда
					ОтборЗаполнен = Истина;
				КонецЕсли;
				ВыгрузитьЭлементОтбораПланаОбмена(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, СтрокаОтборов.ОбъектНастройкиСсылка);
			КонецЦикла;
			мЗаписьXML.ЗаписатьКонецЭлемента(); // ОтборПоСвойствамПланаОбмена
			// во избежание пустых строк в отборах.
			Если ОтборЗаполнен Тогда
				
				ТекстОтборПоСвойствамПланаОбмена = мЗаписьXML.Закрыть();
				ТекстОтборПоСвойствамПланаОбмена = СтрЗаменить(ТекстОтборПоСвойствамПланаОбмена, Символы.ПС, Символы.ПС + "|");
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекстОтборПоСвойствамПланаОбмена) Тогда
			ТекстОтборПоСвойствамПланаОбмена = "<ОтборПоСвойствамПланаОбмена/>";
			СтрокаОтборов.ИмяПроцедурыОтборПланаОбмена = "ПустойОтборПоСвойствамПланаОбмена()";
			ЕстьПустойОтборПоСвойствамПланаОбмена = Истина;
		КонецЕсли;
		СтрокаОтборов.ОтборПоСвойствамПланаОбменаСтрокой = ЗначениеВСтрокуВнутр(ТекстОтборПоСвойствамПланаОбмена); 
		
		ТекстОтборПоСвойствамОбъекта = "";
		Если ТипЗнч(ОтборПоСвойствамОбъекта) = Тип("ДеревоЗначений")
			И ОтборПоСвойствамОбъекта.Строки.Количество() > 0 Тогда
			мЗаписьXML = Новый ЗаписьXML;
			мЗаписьXML.УстановитьСтроку();
			мЗаписьXML.ЗаписатьНачалоЭлемента("ОтборПоСвойствамОбъекта");
			ОтборЗаполнен = Ложь;
			
			Для Каждого ЭлементОтбора Из ОтборПоСвойствамОбъекта.Строки Цикл
				Если ЭлементОтбора.ЭтоГруппа Тогда
					ОтборЗаполнен = ЗначениеЗаполнено(ЭлементОтбора.БулевоЗначениеГруппы);
				ИначеЕсли ЗначениеЗаполнено(ЭлементОтбора.СвойствоОбъекта) Тогда
					ОтборЗаполнен = Истина;
				КонецЕсли;
				ВыгрузитьЭлементОтбораОбъекта(мЗаписьXML, ОбщиеПеременные, ЭлементОтбора, СтрокаОтборов.ОбъектНастройкиСсылка);
			КонецЦикла;
			
			мЗаписьXML.ЗаписатьКонецЭлемента(); // ОтборПоСвойствамОбъекта
			Если ОтборЗаполнен Тогда
				
				ТекстОтборПоСвойствамОбъекта = мЗаписьXML.Закрыть();
				ТекстОтборПоСвойствамОбъекта = СтрЗаменить(ТекстОтборПоСвойствамОбъекта, Символы.ПС, Символы.ПС + "|");
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекстОтборПоСвойствамОбъекта) Тогда
			ТекстОтборПоСвойствамОбъекта = "<ОтборПоСвойствамОбъекта/>";
			СтрокаОтборов.ИмяПроцедурыОтборОбъекта = "ПустойОтборПоСвойствамОбъекта()"; 
			ЕстьПустойОтборПоСвойствамОбъекта = Истина;
		КонецЕсли;
		СтрокаОтборов.ОтборПоСвойствамОбъектаСтрокой = ЗначениеВСтрокуВнутр(ТекстОтборПоСвойствамОбъекта);
		СтрокаОтборов.Количество = 1;
	КонецЦикла;  
	ТаблицаОтборовСвернутаяОбъекты = ТаблицаОтборов.Скопировать();
	ТаблицаОтборовСвернутаяОбъекты.Свернуть("ОтборПоСвойствамОбъектаСтрокой, ИмяПроцедурыОтборОбъекта, ТегОткрыт, ТегЗакрыт","Количество");
	ТаблицаОтборовСвернутаяОбъекты.Колонки.Добавить("КонтрольнаяСумма");
	СчетчикПроцедур = 1;   
	// Обработка тегов: какие процедуры внутри тегов а какие нет.
	Для Каждого СтрокаОтборов Из ТаблицаОтборовСвернутаяОбъекты Цикл
		СтрокаОтборов.КонтрольнаяСумма = ВерсионированиеОбъектов.КонтрольнаяСумма("" + СтрокаОтборов.ТегОткрыт + "#" + СтрокаОтборов.ОтборПоСвойствамОбъектаСтрокой);
	КонецЦикла;
	ТаблицаОтборовСвернутаяОбъекты.Сортировать("КонтрольнаяСумма");
	Для Каждого СтрокаОтборов Из ТаблицаОтборовСвернутаяОбъекты Цикл
		Если СтрокаОтборов.Количество <= 1 Или СтрокаОтборов.ИмяПроцедурыОтборОбъекта = "ПустойОтборПоСвойствамОбъекта()" Тогда
			// Для единичных случаев процедуры будут рядом с ПРО.
			// Если имя процедуры заполнено то это пустой отбор.
			Продолжить;
		КонецЕсли;
		ИмяПроцедуры = "ОтборПоСвойствамОбъекта_" + СчетчикПроцедур + "()"; 
		ОтборПрименен = Ложь;
		Для Каждого СтрокаОтборовЛок Из ТаблицаОтборов Цикл
			Если СтрокаОтборовЛок.ОтборПоСвойствамОбъектаСтрокой = СтрокаОтборов.ОтборПоСвойствамОбъектаСтрокой
				И НЕ ЗначениеЗаполнено(СтрокаОтборовЛок.ИмяПроцедурыОтборОбъекта)  
				// Тег совместим
				И (НЕ ЗначениеЗаполнено(СтрокаОтборов.ТегОткрыт) Или СтрокаОтборов.ТегОткрыт = СтрокаОтборовЛок.ТегОткрыт) Тогда
				СтрокаОтборовЛок.ИмяПроцедурыОтборОбъекта = ИмяПроцедуры; 
				ОтборПрименен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ОтборПрименен Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОтборов.ТегОткрыт) Тогда
			Если СтрНайти(СтрокаОтборов.ТегОткрыт, Символы.ПС) = 0 Тогда
				ПроцедурыОбщихОтборов.ДобавитьСтроку("");
			КонецЕсли;
			ПроцедурыОбщихОтборов.ДобавитьСтроку(СтрокаОтборов.ТегОткрыт);
		ИначеЕсли ПроцедурыОбщихОтборов.КоличествоСтрок() > 0 Тогда
			ПроцедурыОбщихОтборов.ДобавитьСтроку("");
		КонецЕсли;
		ПроцедурыОбщихОтборов.ДобавитьСтроку("Функция " + ИмяПроцедуры);
		ТекстОтбора = СтрЗаменить(ЗначениеИзСтрокиВнутр(СтрокаОтборов.ОтборПоСвойствамОбъектаСтрокой), "|", Символы.Таб + Символы.Таб + Символы.Таб + "|");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("	Возврат """ + ТекстОтбора + """ ;");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("КонецФункции");
		Если ЗначениеЗаполнено(СтрокаОтборов.ТегЗакрыт) Тогда
			ТегЗакрыт_Лок = СтрокаОтборов.ТегЗакрыт;
			УбратьПоследнийПереводСтроки(ТегЗакрыт_Лок);
			ПроцедурыОбщихОтборов.ДобавитьСтроку(ТегЗакрыт_Лок);
		КонецЕсли;
		СчетчикПроцедур = СчетчикПроцедур + 1;
	КонецЦикла;
	Если ЕстьПустойОтборПоСвойствамОбъекта Тогда
		Если ПроцедурыОбщихОтборов.КоличествоСтрок() > 0 Тогда
			ПроцедурыОбщихОтборов.ДобавитьСтроку("");
		КонецЕсли;
		ПроцедурыОбщихОтборов.ДобавитьСтроку("Функция ПустойОтборПоСвойствамОбъекта()");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("	Возврат ""<ОтборПоСвойствамОбъекта/>"" ;");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("КонецФункции");
	КонецЕсли;
	
	ТаблицаОтборовСвернутаяПланы = ТаблицаОтборов.Скопировать();
	ТаблицаОтборовСвернутаяПланы.Свернуть("ОтборПоСвойствамПланаОбменаСтрокой, ИмяПроцедурыОтборПланаОбмена, ТегОткрыт, ТегЗакрыт","Количество");
	ТаблицаОтборовСвернутаяПланы.Колонки.Добавить("КонтрольнаяСумма");
		
	СчетчикПроцедур = 1;
	// Обработка тегов: какие процедуры внутри тегов а какие нет.
	Для Каждого СтрокаОтборов Из ТаблицаОтборовСвернутаяПланы Цикл
		СтрокаОтборов.КонтрольнаяСумма = ВерсионированиеОбъектов.КонтрольнаяСумма("" + СтрокаОтборов.ТегОткрыт + "#" + СтрокаОтборов.ОтборПоСвойствамПланаОбменаСтрокой);
	КонецЦикла;
	ТаблицаОтборовСвернутаяПланы.Сортировать("КонтрольнаяСумма");
	Для Каждого СтрокаОтборов Из ТаблицаОтборовСвернутаяПланы Цикл
		Если СтрокаОтборов.Количество <= 1 Или СтрокаОтборов.ИмяПроцедурыОтборПланаОбмена = "ПустойОтборПоСвойствамПланаОбмена()" Тогда
			// Для единичных случаев процедуры будут рядом с ПРО.
			// Если имя процедуры заполнено то это пустой отбор.
			Продолжить;
		КонецЕсли;
		ИмяПроцедуры = "ОтборПоСвойствамПланаОбмена_" + СчетчикПроцедур + "()";
		ОтборПрименен = Ложь;
		Для Каждого СтрокаОтборовЛок Из ТаблицаОтборов Цикл
			Если СтрокаОтборовЛок.ОтборПоСвойствамПланаОбменаСтрокой = СтрокаОтборов.ОтборПоСвойствамПланаОбменаСтрокой
				И НЕ ЗначениеЗаполнено(СтрокаОтборовЛок.ИмяПроцедурыОтборПланаОбмена)
				// Тег совместим.
				И (НЕ ЗначениеЗаполнено(СтрокаОтборов.ТегОткрыт) Или СтрокаОтборов.ТегОткрыт = СтрокаОтборовЛок.ТегОткрыт) Тогда
				СтрокаОтборовЛок.ИмяПроцедурыОтборПланаОбмена = ИмяПроцедуры;
				ОтборПрименен = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ОтборПрименен Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаОтборов.ТегОткрыт) Тогда
			Если СтрНайти(СтрокаОтборов.ТегОткрыт, Символы.ПС) = 0 Тогда
				ПроцедурыОбщихОтборов.ДобавитьСтроку("");
			КонецЕсли;
			ПроцедурыОбщихОтборов.ДобавитьСтроку(СтрокаОтборов.ТегОткрыт);
		ИначеЕсли ПроцедурыОбщихОтборов.КоличествоСтрок() > 0 Тогда
			ПроцедурыОбщихОтборов.ДобавитьСтроку("");
		КонецЕсли;
		
		ПроцедурыОбщихОтборов.ДобавитьСтроку("Функция " + ИмяПроцедуры);
		ТекстОтбора = СтрЗаменить(ЗначениеИзСтрокиВнутр(СтрокаОтборов.ОтборПоСвойствамПланаОбменаСтрокой), "|", Символы.Таб + Символы.Таб + Символы.Таб + "|");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("	Возврат """ + ТекстОтбора + """ ;");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("КонецФункции");
		Если ЗначениеЗаполнено(СтрокаОтборов.ТегЗакрыт) Тогда
			ТегЗакрыт_Лок = СтрокаОтборов.ТегЗакрыт;
			УбратьПоследнийПереводСтроки(ТегЗакрыт_Лок);
			ПроцедурыОбщихОтборов.ДобавитьСтроку(ТегЗакрыт_Лок);
		КонецЕсли;
		СчетчикПроцедур = СчетчикПроцедур + 1;
	КонецЦикла;
	Если ЕстьПустойОтборПоСвойствамОбъекта Тогда
		Если ПроцедурыОбщихОтборов.КоличествоСтрок() > 0 Тогда
			ПроцедурыОбщихОтборов.ДобавитьСтроку("");
		КонецЕсли;
		ПроцедурыОбщихОтборов.ДобавитьСтроку("Функция ПустойОтборПоСвойствамПланаОбмена()");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("	Возврат ""<ОтборПоСвойствамПланаОбмена/>"" ;");
		ПроцедурыОбщихОтборов.ДобавитьСтроку("КонецФункции");
	КонецЕсли;
	Возврат ТаблицаОтборов;
КонецФункции

Процедура УбратьПоследнийПереводСтроки(ТекстДляЗамены)
	Если Прав(ТекстДляЗамены, 1) = Символы.ПС Тогда
		ТекстДляЗамены = Лев(ТекстДляЗамены, СтрДлина(ТекстДляЗамены)-1);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли