#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ТипКонвертации, Код, ВариантИдентификации, Захвачен, Ссылка, ОбъектКонфигурации, ОбъектКонфигурацииКорреспондент");
	Если НЕ ЗначениеЗаполнено(ДанныеВладельца.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сначала следует записать правило конвертации объекта.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ОбъектКонфигурации = ДанныеВладельца.ОбъектКонфигурации;
	ОбъектКонфигурацииКорреспондент = ДанныеВладельца.ОбъектКонфигурацииКорреспондент;
	ГруппаСвойствКонфигурации = Справочники.Свойства.ПустаяСсылка();
	ГруппаСвойствКонфигурацииКорреспондент = Справочники.Свойства.ПустаяСсылка();
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда
		СведенияГруппыСвойств = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Родитель, "СвойствоКонфигурации, СвойствоФормата, СвойствоКонфигурацииКорреспондента");
		ГруппаСвойствКонфигурации 		= СведенияГруппыСвойств.СвойствоКонфигурации;
		ГруппаСвойствФормата 			= СведенияГруппыСвойств.СвойствоФормата;
		ГруппаСвойствКонфигурацииКорреспондент = СведенияГруппыСвойств.СвойствоКонфигурацииКорреспондента;
	КонецЕсли;
	ЭтоКонвертацияXDTO = (ДанныеВладельца.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	КодПКО = ДанныеВладельца.Код;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СсылкаПоиск = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Поиск");
	КонецЕсли;
	ИдентификацияПоУИД = (ДанныеВладельца.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоУникальномуИдентификатору);
	ПередаватьВПараметр = ЗначениеЗаполнено(Объект.ИмяПараметраДляПередачи);
	

	ЗаполнитьТаблицыСвойств();
	Захвачен = ДанныеВладельца.Захвачен;
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Захвачен = Истина;
		ИначеЕсли Захвачен И ЗначениеЗаполнено(Объект.Владелец) Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтотОбъект, Объект.Владелец);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТолькоПросмотр Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если ОграничиватьДоступНаУровнеЗаписей Тогда
			СписокКонвертаций = Новый СписокЗначений;
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Владелец, СписокКонвертаций);
			КонвертацияДанныхXDTOСервер.ПроверитьДоступКОбъектуНаУровнеЗаписей(ЭтотОбъект, СписокКонвертаций);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	УстановитьДоступность();
	НастроитьСпискиВыбораСвойств();
	КонвертацияДанныхXDTOКлиент.ДобавитьТекущееЗначениеВСписокВыбораЭлементаФормы(Элементы.ПравилоКонвертацииСвойства, Объект.ПравилоКонвертацииСвойства);
	Если ЗначениеЗаполнено(Объект.СвойствоКонфигурацииСтрокой) Тогда
		УказыватьСвойстваСтрокой = Истина;
		УказыватьСвойстваСтрокойПриИзменении(Элементы.УказыватьСвойстваСтрокой);
	КонецЕсли;
	УказыватьПравилоКонвертацииСвойстваСтрокойПриИзменении(Элементы.УказыватьПравилоКонвертацииСвойстваСтрокой);
	ОбновитьИндикациюОбработчиков();
	ЗаполнитьИменаОбработчиков();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Ссылка) И СсылкаПоиск <> Объект.Поиск
		И НЕ ИдентификацияПоУИД Тогда
		Оповестить("ПКС_ИзмененПоиск", Объект.Владелец);
	КонецЕсли; 
	Если Объект.ПометкаУдаления Или НЕ ЭтоКонвертацияXDTO Или Объект.Проверено = Истина Или ЗначениеЗаполнено(Объект.ПравилоКонвертацииСвойства) Тогда
		Возврат;
	КонецЕсли;
	РезультатПроверки = ПроверитьНеобходимостьЗаполненияПКО();
	Если РезультатПроверки = Ложь Тогда
		Возврат;
	КонецЕсли; 
	Отказ = Истина;
	ОписОповещения = Новый ОписаниеОповещения("ПредупреждениеОПКОДляПКС", ЭтотОбъект);
	ТекстОповещения = НСтр("ru='Не заполнено правило конвертации свойства для данного ПКС. 
					|Заполните правило, либо убедитесь что правило определено алгоритмом конвертации'"); 
	КнопкиДиалога = Новый СписокЗначений;
	КнопкиДиалога.Добавить(КодВозвратаДиалога.ОК, НСтр("ru='Вернуться к редактированию'")); 
	КнопкиДиалога.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru='Записать правило и больше не показывать'"));
	
	ПоказатьВопрос(ОписОповещения, ТекстОповещения,КнопкиДиалога,,КодВозвратаДиалога.ОК);
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеОПКОДляПКС(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Пропустить Тогда
		// записать значение Истина в реквизит Проверено.
		Объект.Проверено = Истина;  
		Записать();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПравилоКонвертацииСвойстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.СвойствоКонфигурации) И НЕ ЗначениеЗаполнено(Объект.ТипСвойстваКонфигурации) Тогда
		ОбновитьТипСвойстваКонфигурации("");
	КонецЕсли;
	Если ЭтоКонвертацияXDTO Тогда
		Если ЗначениеЗаполнено(Объект.СвойствоФормата) И НЕ ЗначениеЗаполнено(Объект.ТипСвойстваФормата) Тогда
			ОбновитьТипСвойстваФормата("");
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.СвойствоКонфигурацииКорреспондента) 
		И НЕ ЗначениеЗаполнено(Объект.ТипСвойстваКонфигурацииКорреспондента) Тогда
		ОбновитьТипСвойстваКонфигурацииКорреспондент("");
	КонецЕсли;

	ПравилоКонвертацииСвойстваНачалоВыбораСервер(СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПравилоКонвертацииСвойстваНачалоВыбораСервер(СтандартнаяОбработка)
	Элементы.ПравилоКонвертацииСвойства.СписокВыбора.Очистить();
	
	ТипСвойстваКонфигурации =  ОпределитьТипСвойства(Объект.ТипСвойстваКонфигурации, "СвойствоКонфигурации");
	ТипСвойстваКонфигурацииКорреспондент =  ОпределитьТипСвойства(Объект.ТипСвойстваКонфигурацииКорреспондента, "СвойствоКонфигурацииКорреспондента");
	ТипСвойстваФормата =  СокрЛП(Объект.ТипСвойстваФормата);
	
	СписокКонвертаций = Новый Массив;
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Владелец, СписокКонвертаций);
	
	ПКПД = Ложь;
	ПКО = Ложь;
	УчитыватьОбъектКонфигурации = Ложь;
	УчитыватьОбъектКонфигурацииКорреспондент = Ложь;
	УчитыватьОбъектФормата = Ложь;
	ТипСвойстваФорматаДляЗапроса = ТипСвойстваФормата;
	Если ЗначениеЗаполнено(ТипСвойстваКонфигурации) Тогда
		Для Каждого текТип Из ТипСвойстваКонфигурации Цикл
			Если Найти(НРег(текТип), НРег("ПеречислениеСсылка")) > 0 Тогда
				ПКПД = Истина;
			Иначе
				ПКО = Истина;
			КонецЕсли;
		КонецЦикла;
		УчитыватьОбъектКонфигурации = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТипСвойстваКонфигурацииКорреспондент) Тогда
		Для Каждого текТип Из ТипСвойстваКонфигурацииКорреспондент Цикл
			Если Найти(НРег(текТип), НРег("ПеречислениеСсылка")) > 0 Тогда
				ПКПД = Истина;
			Иначе
				ПКО = Истина;
			КонецЕсли;
		КонецЦикла;
		УчитыватьОбъектКонфигурацииКорреспондент = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(ТипСвойстваФормата) Тогда
		УчитыватьОбъектФормата = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.ЗначенияФормата
		|ГДЕ Владелец.Наименование = &ТипСвойстваФормата";
		Запрос.УстановитьПараметр("ТипСвойстваФормата", ТипСвойстваФормата);
		Результат = Запрос.Выполнить();
		УчитыватьОбъектФормата = Истина;
		Если Результат.Пустой() Тогда
			ПКО = Истина;
			Если Найти(ТипСвойстваФормата, "КлючевыеСвойства") > 0 Тогда
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|Владелец.Наименование КАК ТипСвойстваФормата
				|ИЗ Справочник.СвойстваФормата
				|ГДЕ ВЫРАЗИТЬ(Тип КАК Строка(1000)) = &ТипСвойстваФормата И Наименование = ""КлючевыеСвойства""";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ТипСвойстваФорматаДляЗапроса = СокрЛП(Выборка.ТипСвойстваФормата);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПКПД = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ УчитыватьОбъектКонфигурации И НЕ УчитыватьОбъектФормата И НЕ УчитыватьОбъектКонфигурацииКорреспондент Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ПустоеПКС = "";
	Если ПКПД Тогда
		// Ищем ПКПД
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПКПД.Код КАК Имя
		|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПКПД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК СоставКонвертации
		|	ПО ПКПД.Ссылка = СоставКонвертации.ЭлементКонвертации
		|		И СоставКонвертации.Владелец В (&МассивКонвертаций)
		|		И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ 
		|	(НЕ &УчитыватьОбъектКонфигурации ИЛИ ПКПД.ОбъектКонфигурации.Наименование В (&ОбъектКонфигурации))
		|	И (НЕ &УчитыватьОбъектКонфигурацииКорреспондент ИЛИ ПКПД.ОбъектКонфигурацииКорреспондент.Наименование В (&ОбъектКонфигурацииКорреспондент))
		|	И (ПКПД.ОбъектФормата = &ОбъектФормата ИЛИ НЕ &УчитыватьОбъектФормата)
		|	И (ПКПД.ИспользоватьДляОтправки = &ИспользоватьДляОтправки ИЛИ ПКПД.ИспользоватьДляПолучения = &ИспользоватьДляПолучения ИЛИ НЕ &УчитыватьНаправление)
		|	И НЕ ПКПД.ПометкаУдаления";
	КонецЕсли;
	Если ПКО Тогда
		Если ПКПД Тогда
			// несколько типов, объединяем запросы
			Запрос.Текст = Запрос.Текст + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС;
		Иначе
			Запрос.Текст = "";
		КонецЕсли;
		// Ищем ПКО
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|ПКО.Код КАК Имя
		|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК СоставКонвертации
		|	ПО ПКО.Ссылка = СоставКонвертации.ЭлементКонвертации
		|		И СоставКонвертации.Владелец В (&МассивКонвертаций)
		|		И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ  
		|	(НЕ &УчитыватьОбъектКонфигурации ИЛИ ПКО.ОбъектКонфигурации.Наименование В (&ОбъектКонфигурации))
		|	И (НЕ &УчитыватьОбъектКонфигурацииКорреспондент ИЛИ ПКО.ОбъектКонфигурацииКорреспондент.Наименование В (&ОбъектКонфигурацииКорреспондент))
		|	И (ПКО.ОбъектФормата = &ОбъектФормата ИЛИ НЕ &УчитыватьОбъектФормата)
		|	И (ПКО.ИспользоватьДляОтправки = &ИспользоватьДляОтправки ИЛИ ПКО.ИспользоватьДляПолучения = &ИспользоватьДляПолучения ИЛИ НЕ &УчитыватьНаправление)";
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивКонвертаций", СписокКонвертаций);
	Запрос.УстановитьПараметр("ИспользоватьДляОтправки", Объект.Владелец.ИспользоватьДляОтправки);
	Запрос.УстановитьПараметр("ИспользоватьДляПолучения", Объект.Владелец.ИспользоватьДляПолучения);
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ТипСвойстваКонфигурации);
	Запрос.УстановитьПараметр("ОбъектКонфигурацииКорреспондент", ТипСвойстваКонфигурацииКорреспондент);
	Запрос.УстановитьПараметр("ОбъектФормата", ТипСвойстваФорматаДляЗапроса);
	Запрос.УстановитьПараметр("УчитыватьОбъектКонфигурации", УчитыватьОбъектКонфигурации);
	Запрос.УстановитьПараметр("УчитыватьОбъектКонфигурацииКорреспондент", УчитыватьОбъектКонфигурацииКорреспондент);
	Запрос.УстановитьПараметр("УчитыватьОбъектФормата", УчитыватьОбъектФормата);
	Запрос.УстановитьПараметр("УчитыватьНаправление", ЭтоКонвертацияXDTO);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			Элементы.ПравилоКонвертацииСвойства.СписокВыбора.Добавить(Выборка.Имя);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОпределитьТипСвойства(ИмяТипа, ИмяСвойства)
	Типы = Новый Массив;
	Если СокрЛП(ИмяТипа) = "" Тогда
		Возврат Типы;
	ИначеЕсли СтрНайти(ИмяТипа, ",") = 0 Тогда
		Типы.Добавить(СокрЛП(ИмяТипа));
		Возврат Типы;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Тип.Наименование КАК Наименование
	|ИЗ Справочник.Свойства.Типы
	|ГДЕ Ссылка = &Свойство";
	Запрос.УстановитьПараметр("Свойство", Объект[ИмяСвойства]);
	Типы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	Возврат Типы;
КонецФункции

&НаКлиенте
Процедура СвойствоФорматаОчистка(Элемент, СтандартнаяОбработка)
	Объект.СвойствоФормата = "";
	Объект.ТипСвойстваФормата = "";
КонецПроцедуры

&НаКлиенте
Процедура СвойствоКонфигурацииОчистка(Элемент, СтандартнаяОбработка)
	Объект[Элемент.Имя] = "";
	Если Элемент.Имя = "СвойствоКонфигурации" Тогда
		Объект.ТипСвойстваКонфигурации = "";
	Иначе
		Объект.ТипСвойстваКонфигурацииКорреспондента = "";
	КонецЕсли;
	ЗаполнитьНаименование();
	ЗаполнитьИменаОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура СвойствоФорматаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Текст = "" Тогда
		Объект.СвойствоФормата = "";
		Объект.ТипСвойстваФормата = "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СвойствоКонфигурацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Объект[Элемент.Имя] = ВыбранноеЗначение.Ссылка;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Свойства") Тогда
		Объект[Элемент.Имя] = ВыбранноеЗначение;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Если Элемент.Имя = "СвойствоКонфигурации" Тогда
			Если НЕ ЗначениеЗаполнено(ГруппаСвойствКонфигурации)
				// Свойства общих ТЧ пишутся полностью через "."
				Или СтрНайти(ВыбранноеЗначение, ".") > 0 Тогда
				НаименованиеДляПоиска = ВыбранноеЗначение;
			Иначе
				// Свойства локальных ТЧ пишутся без имени ТЧ.
				НаименованиеДляПоиска = "" + ГруппаСвойствКонфигурации + "." + ВыбранноеЗначение;
			КонецЕсли;
			СтрПоискСсылки = ТаблицаСвойствКонфигурации.НайтиСтроки(Новый Структура("Имя", НаименованиеДляПоиска));
		Иначе
			Если НЕ ЗначениеЗаполнено(ГруппаСвойствКонфигурацииКорреспондент)
				// Свойства общих ТЧ пишутся полностью через "."
				Или СтрНайти(ВыбранноеЗначение, ".") > 0 Тогда
				НаименованиеДляПоиска = ВыбранноеЗначение;
			Иначе
				// Свойства локальных ТЧ пишутся без имени ТЧ.
				НаименованиеДляПоиска = "" + ГруппаСвойствКонфигурацииКорреспондент + "." + ВыбранноеЗначение;
			КонецЕсли;
			СтрПоискСсылки = ТаблицаСвойствКонфигурацииКорреспондент.НайтиСтроки(Новый Структура("Имя", НаименованиеДляПоиска));
		КонецЕсли;
		Если СтрПоискСсылки.Количество() > 0 Тогда
			Объект[Элемент.Имя] = СтрПоискСсылки[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьПолноеИмяСвойстваКонфигурации();
	Если Элемент.Имя = "СвойствоКонфигурации" Тогда
		ОбновитьТипСвойства(Объект.СвойствоКонфигурации, ГруппаСвойствКонфигурации, 
						ТаблицаСвойствКонфигурации, Объект.ТипСвойстваКонфигурации);
	Иначе
		ОбновитьТипСвойства(Объект.СвойствоКонфигурацииКорреспондента, ГруппаСвойствКонфигурацииКорреспондент, 
						ТаблицаСвойствКонфигурацииКорреспондент, Объект.ТипСвойстваКонфигурацииКорреспондента);

	КонецЕсли;
	ЗаполнитьНаименование();
	ЗаполнитьИменаОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура СвойствоФорматаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПозТочки = Найти(ВыбранноеЗначение, ".");
	Если ПозТочки = 0 Тогда
		Объект.СвойствоФормата = ВыбранноеЗначение;
	Иначе
		Объект.СвойствоФормата = Сред(ВыбранноеЗначение, ПозТочки + 1);
	КонецЕсли;

	ЗаполнитьПолноеИмяСвойстваФормата();
	ОбновитьТипСвойства(Объект.СвойствоФормата, ГруппаСвойствФормата, 
						ТаблицаСвойствФормата, Объект.ТипСвойстваФормата);
КонецПроцедуры

&НаКлиенте
Процедура УказыватьПравилоКонвертацииСвойстваСтрокойПриИзменении(Элемент)
	Если УказыватьПравилоКонвертацииСвойстваСтрокой Тогда
		ТекСтраница = Элементы.СтраницаПКССтрокой;
	Иначе
		ТекСтраница = Элементы.СтраницаПКСВыбор;
	КонецЕсли;
	
	Элементы.ГруппаПравилаКонвертацииСвойств.ТекущаяСтраница = ТекСтраница;
КонецПроцедуры

&НаКлиенте
Процедура УказыватьСвойстваСтрокойПриИзменении(Элемент)
	Если УказыватьСвойстваСтрокой Тогда
		ТекСтраница = Элементы.СтраницаСопоставлениеСвойствВручную;
	Иначе
		ТекСтраница = Элементы.СтраницаСопоставлениеСвойствВыбор;
	КонецЕсли;
	
	Элементы.СтраницыСопоставлениеСвойств.ТекущаяСтраница = ТекСтраница;
КонецПроцедуры

&НаКлиенте
Процедура СвойствоКонфигурацииСтрокойПриИзменении(Элемент)
	ЗаполнитьПолноеИмяСвойстваКонфигурации();
КонецПроцедуры

&НаКлиенте
Процедура СвойствоФорматаСтрокойПриИзменении(Элемент)
	ЗаполнитьПолноеИмяСвойстваФормата();
КонецПроцедуры

&НаКлиенте
Процедура СвойствоФорматаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("ТаблицаСвойствФормата, ТекущаяСтрока, РежимРаботы", 
					ТаблицаСвойствФормата, Объект.ПолноеИмяСвойстваФормата, "СвойствоФормата");
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбраноСвойствоФормата", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
		
&НаКлиенте
Процедура СвойствоКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыбраноСвойствоКонфигурации", ЭтотОбъект, Элемент.Имя);
	ПараметрыФормыВыбора = Новый Структура("РежимРаботы", "СвойствоКонфигурации");
	Если Элемент.Имя = "СвойствоКонфигурации" Тогда
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", ?(ЗначениеЗаполнено(ГруппаСвойствКонфигурации),
					 "" + ГруппаСвойствКонфигурации + "." + Объект.СвойствоКонфигурации
					,Объект.СвойствоКонфигурации));
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", ТаблицаСвойствКонфигурации);
	Иначе
		ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", ?(ЗначениеЗаполнено(ГруппаСвойствКонфигурацииКорреспондент),
					 "" + ГруппаСвойствКонфигурацииКорреспондент + "." + Объект.СвойствоКонфигурацииКорреспондента
					,Объект.СвойствоКонфигурацииКорреспондента));
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", ТаблицаСвойствКонфигурацииКорреспондент);
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
		
&НаКлиенте
Процедура ПолучитьИзВходящихДанныхПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПередаватьВПараметрПриИзменении(Элемент)
	Если ПередаватьВПараметр Тогда
		СвойствоКонфигурацииОчистка(Элементы.СвойствоКонфигурацииКорреспондента, Истина);
	Иначе
		Объект.ИмяПараметраДляПередачи = "";
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПараметраДляПередачиПриИзменении(Элемент)
	ЗаполнитьИменаОбработчиков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьТипСвойстваКонфигурации(Команда)
	ОбновитьТипСвойства(Объект.СвойствоКонфигурации, ГруппаСвойствКонфигурации, 
						ТаблицаСвойствКонфигурации, Объект.ТипСвойстваКонфигурации);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипСвойстваКонфигурацииКорреспондент(Команда)
	ОбновитьТипСвойства(Объект.СвойствоКонфигурацииКорреспондента, ГруппаСвойствКонфигурацииКорреспондент, 
						ТаблицаСвойствКонфигурацииКорреспондент, Объект.ТипСвойстваКонфигурацииКорреспондента);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипСвойстваФормата(Команда)
	ОбновитьТипСвойства(Объект.СвойствоФормата, ГруппаСвойствФормата, 
					ТаблицаСвойствФормата, Объект.ТипСвойстваФормата);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	ОбновитьИндикациюОбработчиков();
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицыСвойств()
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ОбъектКонфигурации, ОбъектФормата, ОбъектКонфигурацииКорреспондент");
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурации,
			Объект.Владелец, 
			ДанныеПКО.ОбъектКонфигурации,
			Новый Структура("ЭтоГруппа, Родитель", Ложь, ГруппаСвойствКонфигурации));
	Если ЭтоКонвертацияXDTO Тогда
		ФильтрСвойствФормата = Новый Структура("ОбъектФормата, ЭтоГруппа, Родитель",  ДанныеПКО.ОбъектФормата, Ложь, ГруппаСвойствФормата);
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствФормата(ТаблицаСвойствФормата,
				Объект.Владелец,
				ФильтрСвойствФормата);
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствКонфигурации(ТаблицаСвойствКонфигурацииКорреспондент,
			Объект.Владелец, 
			ДанныеПКО.ОбъектКонфигурацииКорреспондент,
			Новый Структура("ЭтоГруппа, Родитель, Корреспондент", Ложь, ГруппаСвойствКонфигурацииКорреспондент, Истина));

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСпискиВыбораСвойств()
	// Для реквизитов ТЧ в списке выбора отсекается имя ТЧ
	ОтсекатьИмяТЧ = ЗначениеЗаполнено(Объект.Родитель);
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.СвойствоКонфигурации, ТаблицаСвойствКонфигурации, Истина, ОтсекатьИмяТЧ);
	Если ЭтоКонвертацияXDTO Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.СвойствоФормата, ТаблицаСвойствФормата, Истина, ОтсекатьИмяТЧ);
	Иначе
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.СвойствоКонфигурацииКорреспондента, ТаблицаСвойствКонфигурацииКорреспондент, Истина, ОтсекатьИмяТЧ);
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолноеИмяСвойстваФормата()
	Объект.ПолноеИмяСвойстваФормата = "";
	Если ЗначениеЗаполнено(ГруппаСвойствФормата)
		// Реквизиты общих табличных частей СвойствоФормата пишется полное имя с ТЧ.
		И СтрНайти(Объект.СвойствоФормата, ".") = 0 Тогда
		Объект.ПолноеИмяСвойстваФормата = СокрЛП(ГруппаСвойствФормата) + ".";
	КонецЕсли;
	Объект.ПолноеИмяСвойстваФормата = Объект.ПолноеИмяСвойстваФормата + СокрЛП(Объект.СвойствоФормата);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолноеИмяСвойстваКонфигурации()
	Объект.ПолноеИмяСвойстваКонфигурации = "";
	Если ЗначениеЗаполнено(ГруппаСвойствКонфигурации) Тогда
		Объект.ПолноеИмяСвойстваКонфигурации = СокрЛП(ГруппаСвойствКонфигурации) + ".";
	КонецЕсли;
	Объект.ПолноеИмяСвойстваКонфигурации = Объект.ПолноеИмяСвойстваКонфигурации + СокрЛП(Объект.СвойствоКонфигурации);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраноСвойствоФормата(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	СвойствоФорматаОбработкаВыбора(Элементы.СвойствоФормата, РезультатЗакрытия, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраноСвойствоКонфигурации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	СвойствоКонфигурацииОбработкаВыбора(Элементы[ДополнительныеПараметры], РезультатЗакрытия, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипСвойства(ТекСвойство, ТекГруппаСвойств, ТаблицаСвойств, ТипСвойства)
	ТипСвойства = "";
	Если НЕ ЗначениеЗаполнено(ТекСвойство) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ТекСвойство) = Тип("СправочникСсылка.Свойства") Тогда
		СтрРез = ТаблицаСвойств.НайтиСтроки(Новый Структура("Ссылка", ТекСвойство));
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекГруппаСвойств)
			// Свойства общих ТЧ пишутся полностью через "."
			Или СтрНайти(ТекСвойство, ".") > 0 Тогда
			НаименованиеДляПоиска = ТекСвойство;
		Иначе
			// Свойства локальных ТЧ пишутся без имени ТЧ.
			НаименованиеДляПоиска = "" + ТекГруппаСвойств + "." + ТекСвойство;
		КонецЕсли;
		СтрРез = ТаблицаСвойств.НайтиСтроки(Новый Структура("Имя", НаименованиеДляПоиска));
	КонецЕсли;
	Если СтрРез.Количество() > 0 Тогда
		ТипСвойства = СтрРез[0].Тип;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.УказыватьПравилоКонвертацииСвойстваСтрокой.Видимость = ЭтоКонвертацияXDTO;
	Элементы.СвойствоФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ТипСвойстваФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ОбновитьТипСвойстваФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.УказыватьСвойстваСтрокой.Видимость = ЭтоКонвертацияXDTO;

	
	Элементы.ПередаватьВПараметр.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.СвойствоКонфигурацииКорреспондента.Видимость = НЕ ЭтоКонвертацияXDTO И НЕ ПередаватьВПараметр;
	Элементы.ТипСвойстваКонфигурацииКорреспондента.Видимость = НЕ ЭтоКонвертацияXDTO И НЕ ПередаватьВПараметр;
	Элементы.ОбновитьТипСвойстваКонфигурацииКорреспондент.Видимость = НЕ ЭтоКонвертацияXDTO И НЕ ПередаватьВПараметр;
	Элементы.ИмяПараметраДляПередачи.Видимость = НЕ ЭтоКонвертацияXDTO И ПередаватьВПараметр; 
	
	Элементы.УказыватьПравилоКонвертацииСвойстваСтрокой.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ИспользуетсяАлгоритмКонвертации.Видимость = ЭтоКонвертацияXDTO;
	
	Элементы.ГруппаXML.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.ПолучитьИзВходящихДанных.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.Поиск.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.ПоискПоДатеНаРавенство.Видимость = НЕ ЭтоКонвертацияXDTO;
	
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Элементы.СвойствоКонфигурации.Заголовок = НСтр("ru='Источник'");
		Элементы.ТипСвойстваКонфигурации.Заголовок = НСтр("ru='Тип источника'");
		Если ПередаватьВПараметр И НЕ ЗначениеЗаполнено(Объект.СвойствоКонфигурации) Тогда
			Элементы.ПравилоКонвертацииСвойства.РежимВыбораИзСписка = Ложь;
		Иначе
			Элементы.ПравилоКонвертацииСвойства.РежимВыбораИзСписка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Захват объекта.
	Если НЕ СовместнаяРабота Тогда
		Элементы.ДекорацияНуженЗахват.Видимость = Ложь;
		Элементы.ДекорацияЗахвачен.Видимость = Ложь; 
	Иначе
		Если НЕ Захвачен Тогда
			ТолькоПросмотр = Истина;
		КонецЕсли;
		Элементы.ДекорацияЗахвачен.Видимость = Захвачен;
		Элементы.ДекорацияНуженЗахват.Видимость = НЕ Захвачен;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	Элементы.СвойствоКонфигурации.Доступность = НЕ Объект.ПолучитьИзВходящихДанных;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикациюОбработчиков()
	Если ЭтоКонвертацияXDTO Тогда
		Возврат;
	КонецЕсли;
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(Элементы.СтраницыОбработчики, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИменаОбработчиков()
	Если ЗначениеЗаполнено(Объект.СвойствоКонфигурации) Тогда
		ИмяСвойства = Объект.СвойствоКонфигурации;
	ИначеЕсли ЗначениеЗаполнено(Объект.СвойствоКонфигурацииКорреспондента)  Тогда
		ИмяСвойства = Объект.СвойствоКонфигурацииКорреспондента;
	Иначе
		ИмяСвойства = Объект.ИмяПараметраДляПередачи;
	КонецЕсли;
	Если ЗначениеЗаполнено(ГруппаСвойствКонфигурации) 
		Или ЗначениеЗаполнено(ГруппаСвойствКонфигурацииКорреспондент) Тогда
		ИмяРодителя = "_" + ?(ЗначениеЗаполнено(ГруппаСвойствКонфигурации), ГруппаСвойствКонфигурации, ГруппаСвойствКонфигурацииКорреспондент);
	Иначе
		ИмяРодителя = "";
	КонецЕсли;
	НачалоИмени = "ПКС_" + КодПКО + ИмяРодителя + "_" + ИмяСвойства + "_";
	ДлинаКода = СтрДлина(КодПКО);
	КодПКС = СокрЛП(Формат(Объект.Код, "ЧГ=0"));
	КонецИмени = "_" + КодПКС + "_" + ДлинаКода;
	ИмяОбработчикаПередВыгрузкой = НачалоИмени + "ПередВыгрузкойСвойства" + КонецИмени;
	ИмяОбработчикаПриВыгрузке = НачалоИмени + "ПриВыгрузкеСвойства" + КонецИмени;
	ИмяОбработчикаПослеВыгрузки = НачалоИмени + "ПослеВыгрузкиСвойства" + КонецИмени;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование()
	Если ЭтоКонвертацияXDTO Тогда
		// Заполнится при записи.
		Возврат;
	КонецЕсли;
	Если Объект.ЭтоГруппа Тогда
		Объект.Наименование = "" + СокрЛП(Объект.СвойствоКонфигурации) + " --> " + СокрЛП(Объект.СвойствоКонфигурацииКорреспондента);
	Иначе
		Объект.Наименование = "" + СокрЛП(Объект.СвойствоКонфигурации) + " --> " + ?(ПустаяСтрока(Объект.ИмяПараметраДляПередачи), СокрЛП(Объект.СвойствоКонфигурацииКорреспондента), Объект.ИмяПараметраДляПередачи);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьЗаполненияПКО()
	ДанныеПКО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ИспользоватьДляОтправки, ИспользоватьДляПолучения, АлгоритмПриОтправкеДанных, АлгоритмПередПолучениемДанных"); 
	Если ЗначениеЗаполнено(Объект.СвойствоКонфигурации) И НЕ ЗначениеЗаполнено(Объект.ТипСвойстваКонфигурации) Тогда
		Если ТипЗнч(Объект.СвойствоКонфигурации) = Тип("СправочникСсылка.Свойства") Тогда
			Объект.ТипСвойстваКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СвойствоКонфигурации, "ТипыСтрокой");
		КонецЕсли;
	КонецЕсли;
	
	Если СтрНайти(Объект.ТипСвойстваКонфигурации, "Ссылка") = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ДанныеПКО.ИспользоватьДляОтправки Тогда
		Если ЗначениеЗаполнено(ДанныеПКО.АлгоритмПриОтправкеДанных) И СтрНайти(ДанныеПКО.АлгоритмПриОтправкеДанных, Объект.СвойствоФормата) Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	Если ДанныеПКО.ИспользоватьДляПолучения Тогда
		Если ЗначениеЗаполнено(ДанныеПКО.АлгоритмПередПолучениемДанных) И СтрНайти(ДанныеПКО.АлгоритмПередПолучениемДанных, Объект.СвойствоКонфигурации) Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;	
КонецФункции

#КонецОбласти

