#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский;
	КонецЕсли; 
	ДанныеВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "СпособВыгрузкиРазделенногоМодуля, ИмяФайлаДляСохранения");
	ВыгружатьВТекст = (ДанныеВладельца.СпособВыгрузкиРазделенногоМодуля = Перечисления.СпособыВыгрузкиРазделенногоМодуля.ФайлыTXT); 
	КаталогФайлов = ДанныеВладельца.ИмяФайлаДляСохранения;
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИмяФайлаДляСохранения();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ОбновитьИмяФайлаДляСохранения();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбновитьИмяФайлаДляСохранения()
	Если ВыгружатьВТекст Тогда
		ИмяФайлаЛок = "" + СокрЛП(Объект.Наименование) + ".txt";
		КаталогЛок = КаталогФайлов;
	Иначе
		ИмяФайлаЛок = "Module.bsl";
		КаталогЛок = КаталогФайлов + "\CommonModules\" + СокрЛП(Объект.Наименование);
	КонецЕсли; 
	ПолноеИмяФайла = КаталогЛок + "\" + ИмяФайлаЛок;
КонецПроцедуры



#КонецОбласти
