#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("парРегистрация") И ЗначениеЗаполнено(Параметры.парРегистрация) Тогда
		Объект.Регистрация = Параметры.ПарРегистрация;
	КонецЕсли;
	ЗаполнитьНомерВерсииПравил();
	Если Константы.СовместнаяРабота.Получить() Тогда
		Элементы.ПодменюГруппаКнопок.Видимость = Истина;
		Элементы.ФормаВыполнитьВыгрузкуБезСовместнойРаботы.Видимость = Ложь;
	Иначе
		Элементы.ПодменюГруппаКнопок.Видимость = Ложь;
		Элементы.ФормаВыполнитьВыгрузкуБезСовместнойРаботы.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РегистрацияПриИзменении(Элемент)
	РегистрацияПриИзмененииНаСервере();
	УстановитьВидимость();
КонецПроцедуры
&НаКлиенте
Процедура ИмяФайлаПравилНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Фильтр", НСтр("ru = 'Файл данных (*.xml)'") + "|*.xml" );
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Укажите файл для сохранения правил регистрации'"));
	НастройкиДиалога.Вставить("Режим", РежимДиалогаВыбораФайла.Сохранение);
	МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
	МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "ИмяФайлаПравил", СтандартнаяОбработка, НастройкиДиалога);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	Объект.ПоСостояниюХранилища = Ложь;
	ВыполнитьВыгрузкуКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку_Хранилище(Команда)
	Объект.ПоСостояниюХранилища = Истина;
	ВыполнитьВыгрузкуКлиент();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВыполнитьВыгрузкуКлиент()
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Ожидание;
	ИзменитьДоступностьЭлементовФормы(Ложь);
	ПодключитьОбработчикОжидания("ЗапускОбработки", 5, Истина);

КонецПроцедуры
&НаКлиенте
Процедура ЗапускОбработки()
	ВыполнитьВыгрузкуСервер();
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
КонецПроцедуры
&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если НЕ ДлительнаяОперация Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
		ИзменитьДоступностьЭлементовФормы(Истина);
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеВыгрузкиРегистрации", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеВыгрузкиРегистрации()
	РезультатВыгрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	Если ТипЗнч(РезультатВыгрузки) = Тип("Структура")
		И РезультатВыгрузки.Свойство("Успешно") И РезультатВыгрузки.Успешно = Истина Тогда
		Если РезультатВыгрузки.Свойство("ПравилаXML") Тогда
			ДвоичныеДанныеПравил = РезультатВыгрузки.ПравилаXML;
			ДвоичныеДанныеПравил.Записать(Объект.ИмяФайлаПравил);
		КонецЕсли;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выгрузка правил регистрации выполнена успешно'"));
		Если РезультатВыгрузки.Свойство("ТекстМодуля") Тогда
			КонвертацияДанныхXDTOКлиент.ВывестиТекстДляИспользования(РезультатВыгрузки.ТекстМодуля);
		КонецЕсли;   
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выгрузка правил регистрации не выполнена'"));
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементовФормы(ФлагДоступность)
	Элементы.ФормаВыполнитьВыгрузку.Доступность = ФлагДоступность;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуСервер()
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = "";
	ДлительнаяОперация = Ложь;
	СтруктураПараметров = Новый Структура("ИмяФайлаПравил", Объект.ИмяФайлаПравил);
	СтруктураПараметров.Вставить("Регистрация", Объект.Регистрация);
	СтруктураПараметров.Вставить("ПоСостояниюХранилища", Объект.ПоСостояниюХранилища);
	СтруктураПараметров.Вставить("НомерВерсии", НомерВерсии);
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Выгрузка правил регистрации'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ВыгрузкаРегистрации.ВыполнитьВыгрузкуПравил",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При выгрузке правил регистрации произошла ошибка'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки
КонецПроцедуры

&НаСервере
Процедура РегистрацияПриИзмененииНаСервере()
	ЗаполнитьНомерВерсииПравил();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерВерсииПравил()
	Если ЗначениеЗаполнено(Объект.Регистрация) Тогда
		НомерВерсии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Регистрация, "НомерВерсии");
	КонецЕсли;
	Если НомерВерсии = 0 Тогда
		НомерВерсии = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ИмяФайлаПравил.Видимость = (НомерВерсии <> 2);
КонецПроцедуры

#КонецОбласти

