#Область ПрограммныйИнтерфейс
// Заполнение списка выбора элемента формы значениями из переданного списка значений.
// Параметры:
//   ЭлементФормы - ЭлементФормы - элемент формы для которой заполняется список.
//   СписокЗначенийДляВыбора - СписокЗначений - Список значений из которого заполняется список выбора.
//                             Может передаваться также таблица значений.
//   ЭтоТаблицаЗначений - Булево - Признак передачи таблицы значений во 2-м параметре.
//   ОтсекатьИмяТЧ - Булево - Признак необходимости показывать имена реквизитов без имени табличной части.
Процедура ЗаполнитьСписокВыбораЭлементаФормы(ЭлементФормы, СписокЗначенийДляВыбора, ЭтоТаблицаЗначений = Ложь, ОтсекатьИмяТЧ = Ложь) Экспорт
	ЭлементФормы.СписокВыбора.Очистить();
	Если ЭтоТаблицаЗначений Тогда
		// Особый случай для ПКС в форме записи.
		Для Каждого СтрокаТаблицы Из СписокЗначенийДляВыбора Цикл
			ЗначениеСписка = СтрокаТаблицы.Имя;
			Если ОтсекатьИмяТЧ Тогда
				ПозТочки = Найти(ЗначениеСписка, ".");
				Если ПозТочки > 0 Тогда
					ЗначениеСписка = Сред(ЗначениеСписка, ПозТочки + 1);
				КонецЕсли;
			КонецЕсли;
			ЭлементФормы.СписокВыбора.Добавить(ЗначениеСписка);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	Для Каждого ЭлементСписка Из СписокЗначенийДляВыбора Цикл
		ЭлементФормы.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
КонецПроцедуры

// Добавление в список выбора элемента формы переданным значением.
// Параметры:
//   ЭлементФормы - ЭлементФормы - элемент формы для которой заполняется список.
//   ТекущееЗначение - Строка - Значение добавляемое в список.
Процедура ДобавитьТекущееЗначениеВСписокВыбораЭлементаФормы(ЭлементФормы, ТекущееЗначение) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекущееЗначение) Тогда
		Возврат;
	КонецЕсли;
	ЭлементФормы.СписокВыбора.Добавить(ТекущееЗначение);

КонецПроцедуры

// Преобразует составляющие простого типа в строку с представлением.
// Параметры:
//   Тип - Строка - Строковое представление типа.
//   Длина - Строка - Длина типа.
//   Точность - Строка - Точность типа.
//   МинимальнаяДлинаСтроки - Строка - Минимальная длина строки.
// Возвращаемое значение:
//   Строка - расширенное представление типа.
Функция СоставляющиеПростогоТипаВСтроку(Тип, Длина, Точность, МинимальнаяДлинаСтроки) Экспорт
	Префикс = "";
	Размер = "";
	Если Тип = "Строка" Тогда
		Префикс = "string";
		Если Длина > 0 И МинимальнаяДлинаСтроки > 0 Тогда
			Размер = "("+СокрЛП(МинимальнаяДлинаСтроки)+","+СокрЛП(Длина)+")";
		ИначеЕсли Длина > 0 Тогда
			Размер = "("+СокрЛП(Длина)+")";
		КонецЕсли;
	ИначеЕсли Тип = "Дата" Тогда
		Префикс = "date";
	ИначеЕсли Тип = "Булево" Тогда
		Префикс = "boolean";
	ИначеЕсли  Тип = "Число" Тогда
		Если Точность = 0 Тогда
			Префикс = "int";
			Размер = ?(Длина > 0,"("+СокрЛП(Длина)+")","");
		Иначе
			Префикс = "decimal";
			Размер = ?(Длина > 0,"("+СокрЛП(Длина)+","+СокрЛП(Точность)+")","");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Префикс + ?(ЗначениеЗаполнено(Размер)," " + Размер,"");
КонецФункции

// Проверяет соответствие конвертации, указанной в тексте модуля, и конвертации в которую будет выполнена загрузка.
// Параметры:
//   ТХДок - ТекстовыйДокумент - текст модуля.
//   Конвертация - СправочникСсылка.Конвертации - Конвертация в которую загружается алгоритм.
//   НаименованиеКонвертации - Строка - Наименование конвертации в которую загружается алгоритм.
//   ИдентификаторФормы - Строка - Идентификатор формы, из которой вызвана процедура.
Процедура ПроверитьКонвертациюПриЗагрузкеАлгоритмов(ТХДок, Конвертация, НаименованиеКонвертации, ИдентификаторФормы) Экспорт
	СтруктураПараметров = Новый Структура("Отказ, ИдентификаторФормы", Истина, ИдентификаторФормы);
	Если НЕ ЗначениеЗаполнено(Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось определить конвертацию для загрузки обработчиков'"));
		Оповестить("ЗагрузкаАлгоритмов", СтруктураПараметров);
	КонецЕсли;
	Отказ = Ложь;
	// Проверка соответствия конвертации и первой строки модуля.
	СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТХДок, 1));
	ИмяКонвертации = "";
	Если Лев(СтрокаКомментария,3) <> "// " Тогда
		СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТХДок, 2));
	КонецЕсли;
	Если Лев(СтрокаКомментария,15) = "// Конвертация " Тогда
		ПозицияКонецИмени = Найти(СтрокаКомментария, " от ");
		Если ПозицияКонецИмени > 0 Тогда
			ИмяКонвертации = Сред(СтрокаКомментария,16, ПозицияКонецИмени - 16);
		Иначе
			ИмяКонвертации = Прав(СтрокаКомментария,СтрДлина(СтрокаКомментария) - 15);
		КонецЕсли;
	ИначеЕсли Лев(СтрокаКомментария,19) = "// Менеджер обмена " Тогда
		ПозицияНачалоИмени = Найти(СтрокаКомментария, "(");
		ПозицияКонецИмени = Найти(СтрокаКомментария, " от ");
		Если ПозицияКонецИмени > 0 И ПозицияНачалоИмени > 0 Тогда
			ИмяКонвертации = Сред(СтрокаКомментария,ПозицияНачалоИмени + 1, ПозицияКонецИмени - ПозицияНачалоИмени - 1);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяКонвертации) И ИмяКонвертации <> НаименованиеКонвертации Тогда
		ТекстСообщения = НСтр("ru='Обработчики предназначены для другой конвертации'") + ": " + ИмяКонвертации + ". " + НСтр("ru='Продолжить загрузку?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросЗагрузкаОбработчиков", ЭтотОбъект, ИдентификаторФормы),
			ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Отказ Тогда
		СтруктураПараметров.Отказ = Ложь;
		Оповестить("ЗагрузкаАлгоритмов", СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

// Обработчик оповещения, используется при отображении пользователю вопроса о продолжении загрузки алгоритмов.
// Параметры:
//   РезультатВопроса - СистемноеПеречисление.КодВозвратаДиалога - Результат ответа.
//   ИдентификаторФормы - Строка - Идентификатор формы, из которой вызвана процедура.
Процедура ОтветНаВопросЗагрузкаОбработчиков(РезультатВопроса, ИдентификаторФормы) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("Отказ, ИдентификаторФормы", Отказ, ИдентификаторФормы);
	Оповестить("ЗагрузкаАлгоритмов", СтруктураПараметров);
КонецПроцедуры

// Проставляет картинку "зеленый флажок" на тех закладках, которые содержат не пустые обработчики.
// Параметры:
//  КоллекцияСтраниц - ГруппаФормы -  группа Страницы, в которой расположены обработчики.
//  ОбъектФормы - СправочникОбъект... - позиция справочника форма которого обрабатывается.
//  ПоляИсключения - строка - имена полей с именами "Алгоритм...", которые следует исключить из анализа.
Процедура ОбновитьИндикациюСтраницОбработчиков(КоллекцияСтраниц, ОбъектФормы, ПоляИсключения = "") Экспорт
	Для Каждого СтраницаОбработчика Из КоллекцияСтраниц.ПодчиненныеЭлементы Цикл
		Если НЕ СтраницаОбработчика.Видимость Тогда
			Продолжить;
		КонецЕсли;
		ОтображатьФлажок = Ложь; 
		ГруппыФормы = Новый Массив;
		Для Каждого ПолеОбработчика Из СтраницаОбработчика.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(ПолеОбработчика) = Тип("ГруппаФормы") Тогда
				ГруппыФормы.Добавить(ПолеОбработчика);
				Продолжить;
			ИначеЕсли НРег(Лев(ПолеОбработчика.Имя, 8)) <> "алгоритм" Тогда
				Продолжить;
			ИначеЕсли НЕ ПустаяСтрока(ПоляИсключения) И СтрНайти(ПолеОбработчика.Имя, ПоляИсключения) > 0 Тогда
				Продолжить;
			КонецЕсли;
			ОтображатьФлажок = ЗначениеЗаполнено(ОбъектФормы[ПолеОбработчика.Имя]);
			Если ОтображатьФлажок Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		Если ГруппыФормы.Количество() > 0 И НЕ ОтображатьФлажок Тогда
			Для Каждого ГруппаФормы Из ГруппыФормы Цикл
				Для Каждого ПолеОбработчика Из ГруппаФормы.ПодчиненныеЭлементы Цикл
					Если НРег(Лев(ПолеОбработчика.Имя, 8)) <> "алгоритм" Тогда
						Продолжить;
					ИначеЕсли НЕ ПустаяСтрока(ПоляИсключения) И СтрНайти(ПолеОбработчика.Имя, ПоляИсключения) > 0 Тогда
						Продолжить; 
					КонецЕсли;
					ОтображатьФлажок = ЗначениеЗаполнено(ОбъектФормы[ПолеОбработчика.Имя]);
					Если ОтображатьФлажок Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ОтображатьФлажок Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ОтображатьФлажок Тогда 
			СтраницаОбработчика.Картинка = БиблиотекаКартинок.Успешно;
		Иначе
			СтраницаОбработчика.Картинка = Новый Картинка();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Управляет видимостью элементов формы, связанных с функционалом совместной работы над правилами (захват, отмена захвата).
// Параметры:
//  Элементы - ЭлементыФормы - коллекция элементов формы.
//  Захвачен - булево - признак захвата объекта.
//  СовместнаяРабота - булево - признак использования механизма совместной работы над правилами.
Процедура ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Захвачен, СовместнаяРабота = Истина) Экспорт
	Элементы = ЭтаФорма.Элементы;
	Если НЕ СовместнаяРабота Тогда
		Элементы.ДекорацияНуженЗахват.Видимость = Ложь;
		Элементы.ДекорацияЗахвачен.Видимость = Ложь; 
		Возврат;
	КонецЕсли;
	Если НЕ Захвачен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаЗахватитьОбъект.Видимость = НЕ Захвачен;
	Элементы.ФормаОбщаяКомандаСнятьЗахватОбъекта.Видимость = Захвачен;
	Элементы.ДекорацияЗахвачен.Видимость = Захвачен;
	Элементы.ДекорацияНуженЗахват.Видимость = НЕ Захвачен;
КонецПроцедуры

// Процедура реализует возможность копирования текстов, сформированных автоматически.
// Текст выводится либо в буфер, либо в текстовый документ.
// Параметры:
//   ТХ - ТекстовыйДокумент - выводимый текст.
Процедура ВывестиТекстДляИспользования(ТХ) Экспорт
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		КОбъект = Новый COMОбъект("htmlfile");
		КОбъект.ParentWindow.ClipboardData.Setdata("Text", ТХ.ПолучитьТекст());
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Модуль скопирован в буфер обмена'"));
	Иначе
		ТХ.Показать();
	КонецЕсли;
	
КонецПроцедуры

// Процедура сохраняет модули обмена через формат в соответствии с настройками выгрузки модулей.
// Параметры:
//		Модули - Структура - Подготовленные модули конвертации
//		ИменаФайловДляСохранения - Структура - содержит имена файлов для выгрузки каждого модуля.
//		НастройкиВыгрузки - Структура - содержит общие настройки выгрузки модулей.
Процедура СохранитьМодулиКонвертацииВФайлы(Модули, НастройкиВыгрузки, ИменаФайловДляСохранения) Экспорт
	КаталогиМодулейМенеджеров = Неопределено;
	Модули.Свойство("КаталогиМодулейМенеджеров", КаталогиМодулейМенеджеров);
	Для Каждого Модуль Из Модули Цикл  
		// Служебный элемент.
		Если Модуль.Ключ = "КаталогиМодулейМенеджеров" Тогда
			Продолжить;
		КонецЕсли;
		КаталогДляХМЛ = Неопределено;
		ТекстДок = Новый ТекстовыйДокумент;
		Если ТипЗнч(Модуль.Значение) = Тип("Строка") Тогда
			ТекстДок.ДобавитьСтроку(Модуль.Значение);
		Иначе
			ТекстДок.ДобавитьСтроку(Модуль.Значение.ПолучитьТекст());
		КонецЕсли;
		Если КаталогиМодулейМенеджеров <> Неопределено И КаталогиМодулейМенеджеров.Свойство(Модуль.Ключ, КаталогДляХМЛ) = Истина Тогда
			Если НастройкиВыгрузки.ВыгрузкаВТХТ Тогда
				ИмяФайлаДляСохранения = "" + НастройкиВыгрузки.ИмяКаталога + "\" + Модуль.Ключ + ".txt";
			ИначеЕсли НастройкиВыгрузки.ВыгрузкаВХМЛ Тогда
				// Имя объекта извлекаем из имени модуля.
				ПозицияРазделителя = СтрНайти(Модуль.Ключ, "_",,,1);
				ИмяОбъекта = Сред(Модуль.Ключ, ПозицияРазделителя + 1);
				ИмяФайлаЛок = "" + НастройкиВыгрузки.ИмяКаталога + "\" + КаталогДляХМЛ + "\" + ИмяОбъекта + "\Ext\ManagerModule.bsl";
				ПроверитьСуществованиеКаталога(ИмяФайлаЛок);
				ФайлМодуля = Новый Файл(ИмяФайлаЛок);
				// Надо прочитать модуль из каталога и добавить в него кусок с алгоритмами обменов.
				ТекстДокМодульМенеджера = Новый ТекстовыйДокумент;
				Если ФайлМодуля.Существует() Тогда
					ТекстДокМодульМенеджера.Прочитать(ИмяФайлаЛок);
				КонецЕсли;
				ДополнитьМодульМенеджераОбъекта(НастройкиВыгрузки, ТекстДокМодульМенеджера, ТекстДок);
				ТекстДокМодульМенеджера.Записать(ИмяФайлаЛок);
				ТекстСообщения = НСтр("ru='Модуль №1 сохранен в файл: №2'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "№1", Модуль.Ключ);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "№2", ИмяФайлаЛок);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
		Иначе
			ИмяФайлаДляСохранения = "";
			ИменаФайловДляСохранения.Свойство(Модуль.Ключ, ИмяФайлаДляСохранения); 
			Если НЕ ЗначениеЗаполнено(ИмяФайлаДляСохранения) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не найдена настройка для сохранения модуля '") + ": " + Модуль.Ключ);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ПроверитьСуществованиеКаталога(ИмяФайлаДляСохранения);
		
		ТекстДок.Записать(ИмяФайлаДляСохранения); 
		ТекстСообщения = НСтр("ru='Модуль №1 сохранен в файл: №2'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "№1", Модуль.Ключ);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "№2", ИмяФайлаДляСохранения);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСуществованиеКаталога(ПолноеИмяФайла)
	ПоследнийРазделитель = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПоиска.СКонца);
	ИмяКаталога = Лев(ПолноеИмяФайла, ПоследнийРазделитель-1);
	КаталогМодуля = Новый Файл(ИмяКаталога);
	Если КаталогМодуля.Существует() И КаталогМодуля.ЭтоКаталог() Тогда
		Возврат;
	КонецЕсли;
	СоздатьКаталог(ИмяКаталога);
КонецПроцедуры

// Процедура удаляет из модуля менеджера объектов вставки, связанные с правилами синхронизации данных.
// Параметры:
//		НастройкиВыгрузки - Структура - содержит общие настройки выгрузки модулей.
Процедура УдалитьПравилаИзМодулейМенеджера(НастройкиВыгрузки) Экспорт 
	// Перебираем все модули менеджера.   
	ВсеМодулиМенеджера = НайтиФайлы(НастройкиВыгрузки.ИмяКаталога, "ManagerModule.bsl", Истина); 
	ТегОткрытие = НастройкиВыгрузки.ТегиДляМодуляМенеджера.ТегОткрытие;
	ТегЗакрытие = НастройкиВыгрузки.ТегиДляМодуляМенеджера.ТегЗакрытие;
	ЧислоМодулейИзменено = 0;
	Для Каждого ФайлМенеджера Из ВсеМодулиМенеджера Цикл
		ПолноеИмяФайла = ФайлМенеджера.ПолноеИмя;
		ИсходныйМодульМенеджера = Новый ТекстовыйДокумент;
		ИсходныйМодульМенеджера.Прочитать(ПолноеИмяФайла);
		НомерСтрокиНачало = 0;
		НомерСтрокиКонец = 0;
		НомерСтрокиСлужебныеПроцедуры = 0;
		НайтиСлужебныеТегиВМодуле(ИсходныйМодульМенеджера, НастройкиВыгрузки, НомерСтрокиНачало, НомерСтрокиКонец, НомерСтрокиСлужебныеПроцедуры);
		Если НомерСтрокиНачало = 0 Тогда
			Продолжить;
		КонецЕсли; 
		// Удаляем строки внутри тегов.
		НомерСтроки = НомерСтрокиКонец;
		Пока НомерСтроки <> НомерСтрокиНачало - 1 Цикл
			ИсходныйМодульМенеджера.УдалитьСтроку(НомерСтроки);
			НомерСтроки = НомерСтроки - 1;
		КонецЦикла;
		ИсходныйМодульМенеджера.Записать(ПолноеИмяФайла); 

		ЧислоМодулейИзменено = ЧислоМодулейИзменено + 1;
	КонецЦикла;  
	Если ЧислоМодулейИзменено > 0 Тогда
		ТекстСообщения = НСтр("ru='Внесены изменения в №1 модулей менеджера'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "№1", ЧислоМодулейИзменено);
	Иначе
		ТекстСообщения = НСтр("ru='Не обнаружено модулей менеджера, подлежащих изменению'"); 
	КонецЕсли;
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
// Дополняет модуль менеджера объекта процедурами предназначенными для синхронизации данных.
// Параметры:
//   ИсходныйМодульМенеджера - ТекстовыйДокумент - Текущий модуль менеджера объекта метаданных.
//   МодульСПравилами - ТекстовыйДокумент - Процедуры с правилами подлежащие добавлению в модуль менеджера.
Процедура ДополнитьМодульМенеджераОбъекта(НастройкиВыгрузки, ИсходныйМодульМенеджера, МодульСПравилами) 
	НомерСтрокиНачало = 0;
	НомерСтрокиКонец = 0;
	НомерСтрокиСлужебныеПроцедуры = 0;
	НайтиСлужебныеТегиВМодуле(ИсходныйМодульМенеджера, НастройкиВыгрузки, НомерСтрокиНачало, НомерСтрокиКонец, НомерСтрокиСлужебныеПроцедуры);
	// Теги не найдены
	Если НомерСтрокиНачало = 0 Тогда
		ПоследняяСтрокаМодуля = ИсходныйМодульМенеджера.ПолучитьСтроку(ИсходныйМодульМенеджера.КоличествоСтрок());
		НомерСтрокиДляВставки = 0;
		ЕстьОбластьСлужебныеПроцедуры = Ложь;
		Если НомерСтрокиСлужебныеПроцедуры > 0 Тогда
			// Вставляем в начало области служебных процедур и функций.
			НомерСтрокиДляВставки = НомерСтрокиСлужебныеПроцедуры + 1;
			ЕстьОбластьСлужебныеПроцедуры = Истина;
		Иначе
			// Идем с конца, ищем КонецЕсли
			Для Инд = 0 По ИсходныйМодульМенеджера.КоличествоСтрок() - 1 Цикл
				ПоследняяСтрокаМодуля = ИсходныйМодульМенеджера.ПолучитьСтроку(ИсходныйМодульМенеджера.КоличествоСтрок() - Инд); 
				Если СокрЛП(ПоследняяСтрокаМодуля) = "" Тогда
					Продолжить;
				ИначеЕсли СтрНайти(ПоследняяСтрокаМодуля, "#КонецЕсли") > 0 Тогда
					НомерСтрокиДляВставки = ИсходныйМодульМенеджера.КоличествоСтрок() - Инд;
				Иначе  
					// не пустая строка и не КонецЕсли
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если НЕ ЕстьОбластьСлужебныеПроцедуры Тогда
			Строка = "#Область СлужебныеПроцедурыИФункции";
			Если НомерСтрокиДляВставки = 0 Тогда
				ИсходныйМодульМенеджера.ДобавитьСтроку(Строка); 
			Иначе
				ИсходныйМодульМенеджера.ВставитьСтроку(НомерСтрокиДляВставки, Строка); 
				НомерСтрокиДляВставки = НомерСтрокиДляВставки + 1;
			КонецЕсли;
		КонецЕсли;
		Для НомерСтроки = 1 ПО МодульСПравилами.КоличествоСтрок() Цикл
			Строка = МодульСПравилами.ПолучитьСтроку(НомерСтроки);
			Если НомерСтрокиДляВставки = 0 Тогда
				ИсходныйМодульМенеджера.ДобавитьСтроку(Строка); 
			Иначе
				ИсходныйМодульМенеджера.ВставитьСтроку(НомерСтрокиДляВставки, Строка); 
				НомерСтрокиДляВставки = НомерСтрокиДляВставки + 1;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьОбластьСлужебныеПроцедуры Тогда
			Строка = "#КонецОбласти";
			Если НомерСтрокиДляВставки = 0 Тогда
				ИсходныйМодульМенеджера.ДобавитьСтроку(Строка); 
			Иначе
				ИсходныйМодульМенеджера.ВставитьСтроку(НомерСтрокиДляВставки, Строка); 
				НомерСтрокиДляВставки = НомерСтрокиДляВставки + 1;
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли; 
	// Удаляем строки внутри тегов.
	НомерСтроки = НомерСтрокиКонец - 1;
	Пока НомерСтроки <> НомерСтрокиНачало Цикл
		ИсходныйМодульМенеджера.УдалитьСтроку(НомерСтроки);
		НомерСтроки = НомерСтроки - 1;
	КонецЦикла;
	НомерСтрокиНов = НомерСтрокиНачало + 1;   
	// Первую и последнюю строку пропускаем - это теги.
	Для НомерСтроки = 2 ПО МодульСПравилами.КоличествоСтрок() - 1 Цикл
		Строка = МодульСПравилами.ПолучитьСтроку(НомерСтроки); 
		ИсходныйМодульМенеджера.ВставитьСтроку(НомерСтрокиНов, Строка); 
		НомерСтрокиНов = НомерСтрокиНов + 1;
	КонецЦикла;	
КонецПроцедуры

Процедура НайтиСлужебныеТегиВМодуле(ИсходныйМодульМенеджера, НастройкиВыгрузки, НомерСтрокиНачало, НомерСтрокиКонец, НомерСтрокиСлужебныеПроцедуры)
	ТегОткрытие = НастройкиВыгрузки.ТегиДляМодуляМенеджера.ТегОткрытие;
	ТегЗакрытие = НастройкиВыгрузки.ТегиДляМодуляМенеджера.ТегЗакрытие; 
	ТегСлужебныеПроцедуры = "#Область СлужебныеПроцедурыИФункции";
	НомерСтрокиНачало = 0;
	НомерСтрокиКонец = 0;
	НомерСтрокиСлужебныеПроцедуры = 0;
	ЧислоОткрытыхОбластей = 0;
	КоличествоСтрок = ИсходныйМодульМенеджера.КоличествоСтрок();
	Для НомерСтроки = 1 По КоличествоСтрок Цикл 
		Строка = ИсходныйМодульМенеджера.ПолучитьСтроку(НомерСтроки); 
		Если НомерСтрокиСлужебныеПроцедуры = 0 И СтрНайти(Строка, ТегСлужебныеПроцедуры) > 0 Тогда
			НомерСтрокиСлужебныеПроцедуры = НомерСтроки;
			Продолжить;
		ИначеЕсли НомерСтрокиНачало = 0 И СтрНайти(Строка, ТегОткрытие) > 0 Тогда
			НомерСтрокиНачало = НомерСтроки;
			Продолжить;
		ИначеЕсли НомерСтрокиНачало > 0 И НомерСтроки > НомерСтрокиНачало И СтрНайти(Строка, "#Область") Тогда
			ЧислоОткрытыхОбластей = ЧислоОткрытыхОбластей + 1;
		ИначеЕсли НомерСтрокиНачало > 0 И НомерСтроки > НомерСтрокиНачало И СтрНайти(Строка, "#КонецОбласти") Тогда
			Если ЧислоОткрытыхОбластей = 0 Тогда
				НомерСтрокиКонец = НомерСтроки;
				Прервать;
			Иначе
				ЧислоОткрытыхОбластей = ЧислоОткрытыхОбластей - 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПодготовитьМодулиДляЗагрузки(ПараметрыЗагрузки) Экспорт 
	ИмяГлобальногоМодуля = ПараметрыЗагрузки.ИмяГлобальногоМодуля;
	ИсточникЗагрузки = ПараметрыЗагрузки.ИсточникЗагрузки;
	ИмяФайлаЗагрузки = ПараметрыЗагрузки.ИмяФайлаЗагрузки;
	МодулиКонвертации = ПараметрыЗагрузки.МодулиКонвертации;	
	ТекстГлобальногоМодуля = ПараметрыЗагрузки.ТекстГлобальногоМодуля;
	ТекстДок = Новый ТекстовыйДокумент;
	ДанныеДляЗагрузки = Новый Структура(ИмяГлобальногоМодуля, ТекстГлобальногоМодуля); 
	Если ИсточникЗагрузки = 1 Тогда
		// Забираем все файлы из каталога.
		ПодходящиеФайлы = НайтиФайлы(ИмяФайлаЗагрузки,"*.txt",Ложь);
		Для Каждого Файл Из ПодходящиеФайлы Цикл  
			Если СтрНайти(Файл.ИмяБезРасширения, ИмяГлобальногоМодуля) > 0 Тогда
				Продолжить;
			КонецЕсли; 
			ТекстДок.Прочитать(Файл.ПолноеИмя);
			ДанныеДляЗагрузки.Вставить(Файл.ИмяБезРасширения, ТекстДок.ПолучитьТекст());
		КонецЦикла; 
		Возврат ДанныеДляЗагрузки;
	КонецЕсли;
	// Могут быть модули менеджера, их тоже надо взять.
	ИмяМетода1 = ".ДобавитьПОД_";
	ИмяМетода2 = ".ДобавитьПКО_";
	Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстГлобальногоМодуля) Цикл
		СтрокаМодуля = СтрПолучитьСтроку(ТекстГлобальногоМодуля, НомерСтроки);
		СтрокаМодуля = СокрЛП(СтрокаМодуля);
		ПозицияМетода1 = СтрНайти(СтрокаМодуля, ИмяМетода1);
		ПозицияМетода2 = СтрНайти(СтрокаМодуля, ИмяМетода2);
		Если ПозицияМетода1 + ПозицияМетода2 = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ПозицияМетода1 > 0 Тогда
			ИмяДопМодуля = Лев(СтрокаМодуля, ПозицияМетода1-1);
		Иначе
			ИмяДопМодуля = Лев(СтрокаМодуля, ПозицияМетода2-1);
		КонецЕсли;
		Если МодулиКонвертации.НайтиПоЗначению(ИмяДопМодуля) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		МодулиКонвертации.Добавить(ИмяДопМодуля);
	КонецЦикла;
	// Копирование файлов по именам модулей.
	Для Каждого ДопМодуль Из МодулиКонвертации Цикл
		ИмяДопМодуля = ДопМодуль.Значение;
		ПозицияТочки = СтрНайти(ИмяДопМодуля, ".");
		Если ПозицияТочки = 0 Тогда
			// Это общий модуль
			ПолноеИмяФайлаМодуля = ИмяФайлаЗагрузки + "/CommonModules/" + ИмяДопМодуля + ?(ИсточникЗагрузки = 3, "/Ext/", "") + "Module.bsl"; 
			ФайлМодуля = Новый Файл(ПолноеИмяФайлаМодуля);
			Если ФайлМодуля.Существует() Тогда
				ТекстДок.Прочитать(СокрЛП(ПолноеИмяФайлаМодуля), КодировкаТекста.UTF8);
				ДанныеДляЗагрузки.Вставить(ИмяДопМодуля, ТекстДок.ПолучитьТекст());
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		// Модуль менеджера объекта.
		ИмяТипа = Лев(ИмяДопМодуля, ПозицияТочки);
		ИмяОбъекта = Сред(ИмяДопМодуля, ПозицияТочки + 1);
		ИмяКаталога = ПолучитьИмяКаталогаПоИмениТипа(ИмяТипа);
		Если ИмяКаталога = "" Тогда
			Продолжить;
		КонецЕсли; 
		ПолноеИмяФайлаМодуля = ИмяФайлаЗагрузки + "/" + ИмяКаталога + "/" + ИмяОбъекта + ?(ИсточникЗагрузки = 3, "/Ext/", "") + "ManagerModule.bsl";
		ФайлМодуля = Новый Файл(ПолноеИмяФайлаМодуля);
		Если ФайлМодуля.Существует() Тогда
			ТекстДок.Прочитать(СокрЛП(ПолноеИмяФайлаМодуля), КодировкаТекста.UTF8);
			ИмяДопМодуля = СтрЗаменить(ИмяДопМодуля, ".", "_");
			ДанныеДляЗагрузки.Вставить(ИмяДопМодуля, ТекстДок.ПолучитьТекст());
			Продолжить;
		КонецЕсли; 
	КонецЦикла;
	Возврат ДанныеДляЗагрузки;

КонецФункции 

Функция ПолучитьИмяКаталогаПоИмениТипа(ИмяТипа)
	Если ИмяТипа = "Документы." Тогда 
		Возврат "Documents";
	ИначеЕсли ИмяТипа = "Задачи." Тогда
		Возврат "Tasks";
	ИначеЕсли ИмяТипа = "Справочники." Тогда
		Возврат "Catalogs";
	ИначеЕсли ИмяТипа = "ПланыВидовХарактеристик." Тогда 
		Возврат "ChartsOfCharacteristicTypes";
	ИначеЕсли ИмяТипа = "ПланыВидовРасчета." Тогда 
		Возврат "ChartsOfCalculationTypes";
	ИначеЕсли ИмяТипа = "РегистрыСведений." Тогда
		Возврат "InformationRegisters";
	ИначеЕсли ИмяТипа = "РегистрыНакопления." Тогда
		Возврат "AccumulationRegisters";
	ИначеЕсли ИмяТипа = "РегистрыРасчета." Тогда
		Возврат "CalculationRegisters";  
	ИначеЕсли ИмяТипа = "РегистрыБухгалтерии." Тогда
		Возврат "AccountingRegisters";
	КонецЕсли;

	Возврат "";
КонецФункции

#КонецОбласти
