#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	НомерПопыткиТекущий = 1;
	Если (Объект.ИспользоватьДляОтправки = Ложь И Объект.ИспользоватьДляПолучения = Ложь) Тогда
		Объект.ИспользоватьДляОтправки = Истина;
	КонецЕсли;
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	// Заполнение списка конвертаций данного правила
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций, ВедущаяКонфигурация); 
	Иначе
		Если ЗначениеЗаполнено(Параметры.Конвертация) Тогда
			СписокКонвертаций.Добавить(Параметры.Конвертация);
			ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Конвертация, "ТипКонвертации, Конфигурация, КонфигурацияКорреспондент");
			Объект.ТипКонвертации = ДанныеКонвертации.ТипКонвертации;
			ВедущаяКонфигурация = ДанныеКонвертации.Конфигурация; 
			ВедущаяКонфигурацияКорреспондент = ДанныеКонвертации.КонфигурацияКорреспондент;
		ИначеЕсли ЗначениеЗаполнено(ЗначениеКопирования) Тогда
			// Возможно новый элемент копируется - тогда список конвертаций необходимо заполнить.
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(ЗначениеКопирования, СписокКонвертаций, ВедущаяКонфигурация);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
			Объект.ГруппаПравил = Параметры.ГруппаПравил;
		КонецЕсли;
		
	КонецЕсли;
	ЭтоКонвертацияXDTO = (Объект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	ДоступностьПКС = ЗначениеЗаполнено(Объект.Ссылка);
	Если ЭтоКонвертацияXDTO Тогда
		КонвертацияДанныхXDTOВызовСервера.ОпределитьИспользованиеТегов(СписокКонвертаций, ЕстьТеги, Элементы.ТегиТег);
	ИначеЕсли НЕ ЗначениеЗаполнено(ВедущаяКонфигурацияКорреспондент) Тогда
		ВедущаяКонфигурацияКорреспондент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СписокКонвертаций[0].Значение, "КонфигурацияКорреспондент");
	КонецЕсли;
	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Объект.Захвачен = Истина;
			ДоступностьПКС = Ложь;
		ИначеЕсли Объект.Захвачен Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТолькоПросмотр Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если ОграничиватьДоступНаУровнеЗаписей Тогда
			КонвертацияДанныхXDTOСервер.ПроверитьДоступКОбъектуНаУровнеЗаписей(ЭтаФорма, СписокКонвертаций);
			ДоступностьПКС = ЗначениеЗаполнено(Объект.Ссылка) И НЕ ТолькоПросмотр;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЭтоКонвертацияXDTO И ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ОбъектКонфигурацииКорреспондент) Тогда
		ПроверитьЭтоДокумент();
	КонецЕсли;

	ДобавитьОбновитьОтборДинамическогоСпискаПКС();
	
	ОбновитьДанныеАлгоритмаПослеЗагрузкиВсехДанных();
	ЗаполнитьСпискиОбъектов();
	УстановитьУсловноеОформление();
	Если Параметры.Свойство("ТекущееПКС") И ЗначениеЗаполнено(Параметры.ТекущееПКС) Тогда
		ТекущийЭлемент = Элементы.Страница_ПравилаКонвертацииСвойств;
		Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока = Параметры.ТекущееПКС;
	КонецЕсли;
	Если ЭтоКонвертацияXDTO Тогда
		Для Каждого Конвертация Из СписокКонвертаций Цикл
			ИспользоватьРазделениеМодуля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация.Значение, "ИспользоватьРазделениеМодуля");
			Если ИспользоватьРазделениеМодуля Тогда 
				КонвертацияВладелецМодулей = Конвертация.Значение;
				ЗаполнитьПараметрыВыбораДополнительногоМодуля();
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ИспользоватьРазделениеМодуля Тогда
			Если Объект.ВыгружатьВМодульМенеджера Тогда
				Если ЗначениеЗаполнено(Объект.ОбъектКонфигурацииДляВыгрузкиМодуля) Тогда
					ВариантВыгрузки = 3;
				Иначе
					ВариантВыгрузки = 2;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Объект.ДополнительныйМодуль) Тогда
				ВариантВыгрузки = 1;
			КонецЕсли;
		КонецЕсли;	
		ОпределитьМодульПоУмолчанию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Если Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения Тогда
		ОбластьПрименения = 2;
	ИначеЕсли Объект.ИспользоватьДляПолучения Тогда
		ОбластьПрименения = 1;
	Иначе
		ОбластьПрименения = 0;
	КонецЕсли;
	ПеречитатьИменаОбработчиков();

	ОбновитьЭлементыУправленияНастройкиПолямиПоиска();
	ОбновитьИндикациюОбработчиков();
	КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Объект.Захвачен, СовместнаяРабота);
	ПроверитьКоличествоПолейПоиска();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Закрыта форма вопроса о составе конвертаций с изменением состава.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		ОбработкаВыбораНаСервере();
		ОбновитьОтображениеДанных();
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Свойство("МассивВыбранныхЗначений") Тогда
		// Обработка выбора полей поиска
		Если ВыбранноеЗначение.МассивВыбранныхЗначений.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если Объект.ИдентификацияПоПолямПоиска.Количество() = 0 Тогда
			ВариантПоиска = Объект.ИдентификацияПоПолямПоиска.Добавить();
		ИначеЕсли Объект.ИдентификацияПоПолямПоиска.Количество() = 1 Тогда
			ВариантПоиска = Объект.ИдентификацияПоПолямПоиска[0];
		Иначе
			ВариантПоиска = Элементы.ИдентификацияПоПолямПоиска.ТекущиеДанные;
		КонецЕсли;
		
		ВариантПоиска.РеквизитыПоиска = СтрСоединить(ВыбранноеЗначение.МассивВыбранныхЗначений, ",");
		ПроверитьКоличествоПолейПоиска();
		УстановитьВидимость();
		ОбновитьЭлементыУправленияНастройкиПолямиПоиска();
	КонецЕсли;
	
	Если ВыбранноеЗначение.Свойство("ПравилаКонвертацииСвойств") Тогда
		// Выполнено автоматическое сопоставление ПКС
		СоздатьПКСПоРезультатамПодбора(Объект.Ссылка, ВыбранноеЗначение.ПравилаКонвертацииСвойств);
		ОбновитьСлужебныеПоляПКС();
		УстановитьВидимостьСлужебнойНадписи();
		ОбновитьОтображениеДанных();
		Элементы.ПравилаКонвертацииСвойств.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере()
	// Изменился состав конвертаций
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
	ЗаполнитьСпискиОбъектов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("РеквизитыПоиска", "");
	
	ПустыеСтроки = Объект.ИдентификацияПоПолямПоиска.НайтиСтроки(СтруктураОтбора);
	Для Каждого ПустаяСтрока Из ПустыеСтроки Цикл
		Объект.ИдентификацияПоПолямПоиска.Удалить(Объект.ИдентификацияПоПолямПоиска.Индекс(ПустаяСтрока));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КонвертацияДанныхXDTOВызовСервера.ПроверитьВозможностьЗаписиПравила(Отказ, ТекущийОбъект, Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если ТекущийОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XML И НЕ ЗначениеЗаполнено(ТекущийОбъект.Порядок) Тогда
		// Новый порядок.
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	Максимум(Правила.Порядок) КАК Порядок
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК Правила
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правила.Ссылка И Состав.Владелец В (&Конвертации) 
		|ГДЕ
		|	ВЫРАЗИТЬ(Правила.ГруппаПравил КАК Строка(100)) = &Группа";
		
		Запрос.УстановитьПараметр("Группа", Лев(ТекущийОбъект.ГруппаПравил,100));
		Запрос.УстановитьПараметр("Конвертации", СписокКонвертаций.ВыгрузитьЗначения());

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий()
			И Выборка.Порядок <> NULL Тогда
			
			НовыйПорядок = Выборка.Порядок + 50;
			
		Иначе
			
			НовыйПорядок = 50;
			
		КонецЕсли;
		ТекущийОбъект.Порядок = НовыйПорядок;
	КонецЕсли;
	
	Если ТекущийОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO И ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		// Проверка заполнения ПКО в ПКС.
		Отказ = ПроверитьНеобходимостьЗаполненияПКОВПКС();
		Если Отказ Тогда
			ТекстОповещения = НСтр("ru='Не заполнено правило конвертации свойства для некоторых ПКС (выделены розовым фоном). 
					|Заполните правило, либо убедитесь что правило определено алгоритмом конвертации
					|Чтобы отключить проверку, установите текущую строку на ПКС и нажмите кнопку Пометить как проверено'"); 
			ОбщегоНазначения.СообщитьПользователю(ТекстОповещения); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Для нового правила создать запись в регистре
	КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(Объект.Ссылка, СписокКонвертаций);
	
	// Если правило скопировано: создать ПКС.
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		СкопироватьПКС(ЗначениеКопирования, Объект.Ссылка);
		ЗначениеКопирования = Неопределено;
	КонецЕсли;
	
	ЗаполнитьСписокКлючевыхСвойств();
	ДобавитьОбновитьОтборДинамическогоСпискаПКС();
	ДоступностьПКС = ЗначениеЗаполнено(Объект.Ссылка) И НЕ ТолькоПросмотр;
	СписокКонвертацийКДобавлению.Очистить();
	Если ЭтоКонвертацияXDTO Тогда
		СписокКонвертацийКДобавлению = КонвертацияДанныхXDTOВызовСервера.ПолучитьДополненныйСписокКонвертаций(Объект.Ссылка, СписокКонвертаций)
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если СписокКонвертацийКДобавлению.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОДобавленииВСоставКонвертаций", ЭтаФорма);
		КонвертацииКДобавлениюСтрокой = " ";
		Для Каждого ТекКонвертация Из СписокКонвертацийКДобавлению Цикл
			КонвертацииКДобавлениюСтрокой = КонвертацииКДобавлениюСтрокой + СокрЛП(ТекКонвертация.Значение) + ",";
		КонецЦикла;
		КонвертацииКДобавлениюСтрокой = Лев(КонвертацииКДобавлениюСтрокой, СтрДлина(КонвертацииКДобавлениюСтрокой)-1) + "?";
		ТекстВопроса = НСтр("ru='Включить правило в состав конвертаций:'") + КонвертацииКДобавлениюСтрокой;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Алгоритмы" Тогда
		ОбновитьДанныеАлгоритмаПослеЗагрузкиВсехДанных();
	ИначеЕсли ИмяСобытия = "ПКС_ИзмененПоиск" И Параметр = Объект.Ссылка Тогда
		ПроверитьКоличествоПолейПоиска();
		ОбновитьСлужебныеПоляПКС();
	ИначеЕсли СовместнаяРабота И ИмяСобытия = "ИзмененСтатусЗахвата" И Источник = Объект.Ссылка Тогда
		Прочитать();
		ОбработкаОповещенияНаСервере();
		КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Параметр);
		УстановитьВидимость();
		Элементы.Страница_ПравилаКонвертацииСвойств.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.ПравилаКонвертацииСвойств.ТолькоПросмотр = ТолькоПросмотр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Тумблер_ОбластьПримененияПриИзменении(Элемент)
	Если ОбластьПрименения = 0 Тогда
		Объект.ИспользоватьДляОтправки = Истина;
		Объект.ИспользоватьДляПолучения = Ложь;
	ИначеЕсли ОбластьПрименения = 1 Тогда
		Объект.ИспользоватьДляОтправки = Ложь;
		Объект.ИспользоватьДляПолучения = Истина;
	Иначе
		Объект.ИспользоватьДляОтправки = Истина;
		Объект.ИспользоватьДляПолучения = Истина;
	КонецЕсли;
	
	УстановитьВидимость();
	Если ЭтоКонвертацияXDTO И ИспользоватьРазделениеМодуля Тогда 
		ОпределитьМодульПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	ПеречитатьИменаОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектФорматаПриИзменении(Элемент)
	ЗаполнитьСписокКлючевыхСвойств();
	УстановитьВидимостьСлужебнойНадписи();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьПорядокПолейПоиска(Команда)
	
	ОткрытьФормуВыбораПолейПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификацияПоПолямПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораПолейПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификацияПоПолямПоискаПослеУдаления(Элемент)
	ПроверитьКоличествоПолейПоиска();
	Если Объект.ИдентификацияПоПолямПоиска.Количество() = 1 Тогда
		УстановитьВидимость();
		ОбновитьЭлементыУправленияНастройкиПолямиПоиска()
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПослеЗагрузкиВсехДанныхОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиВсехДанных) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаАлгоритм = СсылкаНаАлгоритмПоИмени(Объект.АлгоритмПослеЗагрузкиВсехДанных, СписокКонвертаций, СовместнаяРабота);
	Если СсылкаНаАлгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = СсылкаНаАлгоритм;
	ИмяФормыАлгоритм = "Справочник.Алгоритмы.ФормаОбъекта";
	ОткрытьФорму(ИмяФормыАлгоритм, ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПослеЗагрузкиВсехДанныхПриИзменении(Элемент)
	
	ОбновитьДанныеАлгоритмаПослеЗагрузкиВсехДанных();
	ОбновитьИндикациюОбработчиков();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектФорматаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("МассивКонвертаций, ТекущаяСтрока, РежимРаботы", 
					СписокКонвертаций, Объект.ОбъектФормата, "ОбъектФормата");
	ПараметрыФормыВыбора.Вставить("ДляПКО", Истина);
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбранОбъектФормата", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПервоначальноеЗначение = Объект[Элемент.Имя];
	ПараметрыФормыВыбора = Новый Структура("ТекущаяСтрока, РежимРаботы", 
					ПервоначальноеЗначение, "ОбъектКонфигурации");
	ПараметрыФормыВыбора.Вставить("ДляПКО", Истина);

	Если Элемент.Имя = "ОбъектКонфигурации" Или Элемент.Имя = "ОбъектКонфигурацииДляВыгрузкиМодуля" Тогда
		ПараметрыФормыВыбора.Вставить("ВедущаяКонфигурация", ВедущаяКонфигурация);
		ПараметрыФормыВыбора.Вставить("МассивКонфигураций", СписокКонфигураций);
	Иначе
		ПараметрыФормыВыбора.Вставить("МассивКонфигураций", СписокКонфигурацийКорреспондент);
	КонецЕсли;
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыбранОбъектКонфигурации", ЭтотОбъект, Элемент.Имя);
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВариантИдентификацииXMLПриИзменении(Элемент)
	Элементы.ИспользоватьБыстрыйПоискПриЗагрузке.Доступность = Объект.НеЗапоминатьВыгруженные;
	Элементы.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD.Доступность = (Объект.ВариантИдентификации <> ПредопределенноеЗначение("Перечисление.ВариантыИдентификацииОбъектов.ПоПолямПоиска"));
КонецПроцедуры


&НаКлиенте
Процедура ПравилаКонвертацииСвойствПослеУдаления(Элемент)
	ОбновитьСлужебныеПоляПКС();
	УстановитьВидимостьСлужебнойНадписи();
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	ОбновитьИндикациюОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификацияПоПолямПоискаПриИзменении(Элемент)
	ПроверитьКоличествоПолейПоиска();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыгрузкиПриИзменении(Элемент)
	Если ВариантВыгрузки = 2 Или ВариантВыгрузки = 3 Тогда
		Объект.ВыгружатьВМодульМенеджера = Истина;
		Объект.ДополнительныйМодуль = Неопределено;
		Если ВариантВыгрузки = 2 Тогда
			Объект.ОбъектКонфигурацииДляВыгрузкиМодуля = Неопределено;
		КонецЕсли;
	Иначе
		Объект.ВыгружатьВМодульМенеджера = Ложь;
	КонецЕсли;
	Модифицированность = Истина;
	УстановитьВидимость();
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьВторойВариантПоиска(Команда)
	
	НоваяСтрока = Объект.ИдентификацияПоПолямПоиска.Добавить();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНастройкиПолейПоиска(Команда)
	Объект.ИдентификацияПоПолямПоиска.Очистить();
	УстановитьВидимость();
	ОбновитьЭлементыУправленияНастройкиПолямиПоиска()
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементВСоставКонвертации(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстПредупреждения = НСтр("ru = 'Сначала необходимо записать правило конвертации объекта'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбранаКонвертация", ЭтаФорма);
	ОткрытьФорму("Справочник.Конвертации.ФормаВыбора",, ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПКС(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстПредупреждения = НСтр("ru = 'Сначала необходимо записать правило конвертации объекта'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ПравилоКонвертацииОбъекта, ЭтоКонвертацияXDTO", Объект.Ссылка, ЭтоКонвертацияXDTO);
	ОткрытьФорму("Обработка.НастройкаПравилКонвертацииСвойств.Форма", СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных(Команда)
	
	ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных = Не ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификатор(Команда)
	Постфикс = "";
	Если ЭтоКонвертацияXDTO Тогда
		Если НЕ (ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Или ЗначениеЗаполнено(Объект.ОбъектФормата)) Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Тогда
			Код = СокрЛП(Объект.ОбъектКонфигурации);
		Иначе
			Код = СокрЛП(Объект.ОбъектФормата);
		КонецЕсли;
		Если НЕ (Объект.ИспользоватьДляОтправки И Объект.ИспользоватьДляПолучения) Тогда
			Постфикс = ?(Объект.ИспользоватьДляПолучения, "_Получение", "_Отправка");
		КонецЕсли;
	Иначе
		Если НЕ (ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Или ЗначениеЗаполнено(Объект.ОбъектКонфигурацииКорреспондент)) Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Тогда
			Код = СокрЛП(Объект.ОбъектКонфигурации);
		Иначе
			Код = СокрЛП(Объект.ОбъектКонфигурацииКорреспондент);
		КонецЕсли;
	КонецЕсли;
	Код = СтрЗаменить(Код, "Ссылка", "");
	Код = СтрЗаменить(Код, ".", "_");
	Объект.Код = Код + Постфикс;
	КодПриИзменении(Неопределено);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбранаКонвертация(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	ОтказДобавления = Ложь;
	ДополнитьСоставКонвертации(РезультатЗакрытия, Объект.Ссылка, ОтказДобавления);
	Если ОтказДобавления Тогда
		ТекстПредупреждения = НСтр("ru = 'Данный элемент уже входит в состав выбранной конвертации'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	Иначе
		Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, ОтказДобавления)
	Если ТипЗнч(Конвертация) = Тип("СписокЗначений") Тогда
		Для Каждого ТекКонвертация Из Конвертация Цикл
			Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ТекКонвертация.Значение, ЭлементКонвертации);
		КонецЦикла;
	Иначе
		// Проверка на дубли
		Если КонвертацияДанныхXDTOВызовСервера.ЭлементКонвертацииВходитВСоставКонвертации(Конвертация, ЭлементКонвертации) Тогда
			ОтказДобавления = Истина;
			Возврат;
		КонецЕсли;
		Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации);
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПолейПоиска()
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗаголовокФормыВыбора",    НСтр("ru = 'Выберите поля поиска:'"));
	ПараметрыФормы.Вставить("МассивДоступныхЗначений", СформироватьМассивДоступныхРеквизитовОбъекта());
	ПараметрыФормы.Вставить("МассивВыбранныхЗначений", СформироватьМассивВыбранныхПолейПоиска());
	
	ОткрытьФорму("ОбщаяФорма.ВыборДополнительныхУсловий",
		ПараметрыФормы,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМассивВыбранныхПолейПоиска()
	
	РеквизитыПоиска = "";
	Если Объект.ИдентификацияПоПолямПоиска.Количество() = 1 Тогда
		РеквизитыПоиска = Объект.ИдентификацияПоПолямПоиска[0].РеквизитыПоиска;
	ИначеЕсли Объект.ИдентификацияПоПолямПоиска.Количество() > 1 Тогда
		РеквизитыПоиска = Элементы.ИдентификацияПоПолямПоиска.ТекущиеДанные.РеквизитыПоиска;
	КонецЕсли;
	МассивВыбранныхПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыПоиска, ",");
	
	Возврат МассивВыбранныхПолей;
	
КонецФункции

&НаСервере
Функция СформироватьМассивДоступныхРеквизитовОбъекта()
	
	ТаблицаСвойствОбъектаКонфигурации = КонвертацияДанныхXDTOВызовСервера.ТаблицаСвойствОбъектаКонфигурации(Объект.ОбъектКонфигурации, 
		Новый Структура("ЭтоГруппа, Родитель", Ложь, ""));
	Возврат ТаблицаСвойствОбъектаКонфигурации.ВыгрузитьКолонку("Имя");
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Тумблер_ОбластьПрименения.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ОбъектФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ОбъектКонфигурацииКорреспондент.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.Страница_ОбработчикиXDTO.Видимость = ЭтоКонвертацияXDTO;
	Элементы.Страница_ОбработчикиXML.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.Страница_ИдентификацияXDTO.Видимость = ЭтоКонвертацияXDTO;
	Элементы.Страница_ВыгрузкаИЗагрузкаXML.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.Порядок.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.Страница_ВыгрузкаИЗагрузкаXML.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииСвойствXDTO.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииСвойствXML.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииСвойствТипСвойстваКонфигурацииКорреспондента.Видимость = НЕ ЭтоКонвертацияXDTO;
	Элементы.ПравилаКонвертацииСвойствТипСвойстваФормата.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ФормаОбщаяКомандаВыделитьЭлементИзСоставаКонвертаций.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ОбъектСДвижениями.Видимость = НЕ ЭтоКонвертацияXDTO И КонвертацияДокумента;
    Элементы.ФормаРегистрСведенийКомментарииКОбработчикамЗадатьКомментарийКОбработчику.Видимость = ЭтоКонвертацияXDTO;
	Элементы.ВыгрузкаВМодули.Видимость = ЭтоКонвертацияXDTO И ИспользоватьРазделениеМодуля;
	
	Если ЭтоКонвертацияXDTO Тогда
		Элементы.Страница_ПриОтправке.Видимость = Объект.ИспользоватьДляОтправки;
		Элементы.Страница_ПриКонвертацииДанныхXDTO.Видимость = Объект.ИспользоватьДляПолучения;
		Элементы.Страница_ПередЗаписьюПолученныхДанных.Видимость = Объект.ИспользоватьДляПолучения;
		Элементы.Страница_ИдентификацияXDTO.Видимость = Объект.ИспользоватьДляПолучения;
		Элементы.Страница_ПослеЗагрузкиВсехДанных.Видимость = Объект.ИспользоватьДляПолучения;
		Элементы.ПравилоДляГруппыСправочника.Видимость = Объект.ИспользоватьДляПолучения;

		КоличествоВариантовПоиска = Объект.ИдентификацияПоПолямПоиска.Количество();
		
		Элементы.ИдентификацияПоПолямПоиска.Видимость = КоличествоВариантовПоиска > 1;
		Элементы.ДобавитьВторойВариантПоиска.Видимость = КоличествоВариантовПоиска = 1;
		Элементы.ОчиститьНастройкиПолейПоиска.Видимость = КоличествоВариантовПоиска = 1;
		Элементы.ЗадатьПорядокПолейПоиска.Видимость = КоличествоВариантовПоиска <= 1;
		
		Элементы.ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных.Заголовок = ?(ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных,
			НСтр("ru='Скрыть текст'"), НСтр("ru='Показать текст'"));
		Элементы.ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных.Видимость = ЗначениеЗаполнено(АлгоритмПослеЗагрузкиВсехДанныхСсылка);
		Элементы.АлгоритмПослеЗагрузкиВсехДанныхТекст.Видимость = ЗначениеЗаполнено(АлгоритмПослеЗагрузкиВсехДанныхСсылка)
			И ПоказатьТекстАлгоритмаПослеЗагрузкиВсехДанных;
		УстановитьВидимостьСлужебнойНадписи();
		Элементы.Предупреждение_МногоПолей.Видимость = ПоляПоискаПроблемные;
		Если ИспользоватьРазделениеМодуля Тогда
			Элементы.ДополнительныйМодуль.Доступность = Ложь;
			Элементы.ОбъектКонфигурацииДляВыгрузкиМодуля.Доступность = Ложь;
			Если ВариантВыгрузки = 1 Тогда
				Элементы.ДополнительныйМодуль.АвтоОтметкаНезаполненного = Истина;
				Элементы.ДополнительныйМодуль.Доступность = Истина;
			ИначеЕсли ВариантВыгрузки = 3 Тогда
				Элементы.ОбъектКонфигурацииДляВыгрузкиМодуля.Доступность = Истина;
                Элементы.ОбъектКонфигурацииДляВыгрузкиМодуля.АвтоОтметкаНезаполненного = Истина;
			КонецЕсли;
		КонецЕсли;
		Элементы.ГруппаТеги.Видимость = ЕстьТеги;
	Иначе
		// Заголовки объектов.
		Элементы.ОбъектКонфигурации.Заголовок = НСтр("ru='Источник'");
		Элементы.ОбъектКонфигурацииКорреспондент.Заголовок = НСтр("ru='Получатель'");
		Элементы.ПравилаКонвертацииСвойствСвойствоКонфигурации.Заголовок = НСтр("ru='Источник'"); 
		Элементы.ГруппаТеги.Видимость = Ложь;
	КонецЕсли;
	Если ТолькоПросмотр Тогда
		Элементы.Страница_ПравилаКонвертацииСвойств.ТолькоПросмотр = Истина;
		Элементы.ПравилаКонвертацииСвойств.ТолькоПросмотр = Истина;
		Элементы.ПравилаКонвертацииСвойствНастройкаПКС.Доступность = Ложь;
		Элементы.ПравилаКонвертацииСвойствПереместитьВверх.Доступность = Ложь;
		Элементы.ПравилаКонвертацииСвойствПереместитьВниз.Доступность = Ложь;
	Иначе
		Элементы.Страница_ПравилаКонвертацииСвойств.ТолькоПросмотр = НЕ ДоступностьПКС;
		Элементы.ПравилаКонвертацииСвойств.ТолькоПросмотр = НЕ ДоступностьПКС;
		Элементы.ПравилаКонвертацииСвойствНастройкаПКС.Доступность = ДоступностьПКС;
		Элементы.ПравилаКонвертацииСвойствПереместитьВверх.Доступность = ДоступностьПКС;
		Элементы.ПравилаКонвертацииСвойствПереместитьВниз.Доступность = ДоступностьПКС;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьВидимостьСлужебнойНадписи()
	Элементы.НеСозданыПКСКлючевыеСвойства.Видимость = (НЕ ЭтоКонвертацияXDTO ИЛИ Объект.ИспользоватьДляОтправки) 
		И (НеСозданыПКСКлючевыеСвойства <> "" Или ЗначениеЗаполнено(ЗначениеКопирования));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиОбъектов()
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	ОбластьПримененияСписков = Новый Структура("ДляПКО, ДляПКПД, ДляПРО", Истина, Ложь, Ложь);
	Если ЗначениеЗаполнено(ВедущаяКонфигурация) Тогда
		ФильтрКонфигураций = ВедущаяКонфигурация;
	Иначе
		КонфигурацииОтправитель = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(МассивКонвертаций);
		Для Каждого Конфигурация Из КонфигурацииОтправитель Цикл
			СписокКонфигураций.Добавить(Конфигурация);
		КонецЦикла;
		ФильтрКонфигураций = СписокКонфигураций;
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовКонфигурации(СписокОбъектовКонфигурации, ФильтрКонфигураций, ОбластьПримененияСписков);
	Если ЭтоКонвертацияXDTO Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовФормата(СписокОбъектовФормата, МассивКонвертаций, Истина);
	Иначе
		КонфигурацииПолучатель = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(МассивКонвертаций, "КонфигурацияКорреспондент");
		Для Каждого Конфигурация Из КонфигурацииПолучатель Цикл
			СписокКонфигурацийКорреспондент.Добавить(Конфигурация);
		КонецЦикла;
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовКонфигурации(СписокОбъектовКонфигурацииКорреспондента, СписокКонфигурацийКорреспондент, ОбластьПримененияСписков);
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокАлгоритмов(СписокАлгоритмов, МассивКонвертаций);
	Элементы.АлгоритмПослеЗагрузкиВсехДанных.СписокВыбора.ЗагрузитьЗначения(СписокАлгоритмов.ВыгрузитьЗначения());

	Если ЭтоКонвертацияXDTO Тогда
		ЗаполнитьСписокКлючевыхСвойств();
	Иначе
		ПравилаКонвертацииСвойств.Параметры.УстановитьЗначениеПараметра("КлючевыеСвойства", Новый Массив);
		ОбновитьСлужебныеПоляПКС();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКлючевыхСвойств()
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Возврат;
	КонецЕсли;
	// Получим список ключевых свойств
	СписокКлючевыхСвойств.Очистить();
	Если ЗначениеЗаполнено(Объект.ОбъектФормата) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(СвойстваФормата.Тип КАК СТРОКА(1000)) КАК ТипКС
		|ПОМЕСТИТЬ ТабКС
		|ИЗ
		|	Справочник.СвойстваФормата КАК СвойстваФормата
		|ГДЕ
		|	СвойстваФормата.Владелец.Наименование = &ТекОбъектФормата
		|	И СвойстваФормата.Наименование = ""КлючевыеСвойства""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвойстваФормата.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ОбъектыФормата КАК ОбъектыФормата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата КАК СвойстваФормата
		|		ПО (СвойстваФормата.Владелец = ОбъектыФормата.Ссылка)
		|ГДЕ
		|	ОбъектыФормата.Наименование В
		|			(ВЫБРАТЬ
		|				ТабКС.ТипКС
		|			ИЗ
		|				ТабКС)");
		Запрос.УстановитьПараметр("ТекОбъектФормата", Объект.ОбъектФормата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокКлючевыхСвойств.Добавить(Выборка.Наименование);
		КонецЦикла;
	КонецЕсли;
	ОбновитьСлужебныеПоляПКС();
	ПравилаКонвертацииСвойств.Параметры.УстановитьЗначениеПараметра("КлючевыеСвойства", СписокКлючевыхСвойств);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСлужебныеПоляПКС()
	НеСозданыПКСКлючевыеСвойства = "";
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
			НеСозданыПКСКлючевыеСвойства = "Правило скопировано. Нажмите кнопку Записать чтобы появились ПКС.";
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Если Объект.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоУникальномуИдентификатору Тогда
			// Не требуется создание ПКС поиска
			Возврат;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ Справочник.ПравилаКонвертацииСвойств
		|ГДЕ Владелец = &Ссылка И Поиск И НЕ Отключить И НЕ ПометкаУдаления";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			НеСозданыПКСКлючевыеСвойства = НСтр("ru = 'Не созданы правила конвертации свойств для поиска объекта при загрузке'");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	МассивСозданыПКС = Новый Массив;
	МассивСозданыПКС.Добавить("Ссылка");  // Это ПКС не требуется создавать - обрабатывается автоматически
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвойствоФормата
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &Ссылка И НЕ Отключить И НЕ ПометкаУдаления
	|	И СвойствоФормата В (&СписокКлючевыхСвойств)";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокКлючевыхСвойств", СписокКлючевыхСвойств);

	СписокСозданыПКС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СвойствоФормата");
	
	Если СписокСозданыПКС.Количество() < СписокКлючевыхСвойств.Количество() Тогда
		НеСозданыПКСКлючевыеСвойства = "";
		// Есть ключевые свойства для которых не созданы ПКС
		Для Каждого КлючСвойство Из СписокКлючевыхСвойств Цикл
			Если КлючСвойство.Значение = "Ссылка" Тогда
				Продолжить;
			КонецЕсли;
			Если СписокСозданыПКС.Найти(КлючСвойство.Значение) = Неопределено Тогда
				НеСозданыПКСКлючевыеСвойства = НеСозданыПКСКлючевыеСвойства + КлючСвойство.Значение + ", ";
			КонецЕсли;
		КонецЦикла;
		Если НеСозданыПКСКлючевыеСвойства <> "" Тогда
			НеСозданыПКСКлючевыеСвойства = НСтр("ru = 'Не созданы правила конвертации свойств для ключевых свойств формата'") + ": " + Лев(НеСозданыПКСКлючевыеСвойства, СтрДлина(НеСозданыПКСКлючевыеСвойства)-2);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКоличествоПолейПоиска()
	// Проверка первого варианта полей поиска.
	ПоляПоискаПроблемные = Ложь;
	Если ЭтоКонвертацияXDTO Тогда
		Если Объект.ИдентификацияПоПолямПоиска.Количество() > 0 Тогда
			РеквизитыПоиска_1 = Объект.ИдентификацияПоПолямПоиска[0].РеквизитыПоиска;
			ПоляПоискаПроблемные = (СтрРазделить(РеквизитыПоиска_1,",",Истина).Количество() > 5);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьИменаОбработчиков()
	НачалоИмени = "ПКО_"+СокрЛП(Объект.Код)+"_";
	Если ЭтоКонвертацияXDTO Тогда
		ИмяОбработчикаПриОтправке = НачалоИмени+"ПриОтправкеДанных";
		ИмяОбработчикаПриПолучении = НачалоИмени+"ПередЗаписьюПолученныхДанных";
		ИмяОбработчикаПередПолучением = НачалоИмени+"ПриКонвертацииДанныхXDTO";
		Возврат;
	КонецЕсли;
	ИмяОбработчикаПередВыгрузкой = НачалоИмени+"ПередВыгрузкойОбъекта";
	ИмяОбработчикаПриВыгрузке = НачалоИмени+"ПриВыгрузкеОбъекта";
	ИмяОбработчикаПослеВыгрузки = НачалоИмени+"ПослеВыгрузкиОбъекта";
	ИмяОбработчикаПослеВыгрузкиВФайл = НачалоИмени+"ПослеВыгрузкиОбъектаВФайлОбмена";
	ИмяОбработчикаПоляПоиска = НачалоИмени+"ПоследовательностьПолейПоиска";
	ИмяОбработчикаПередЗагрузкой = НачалоИмени+"ПередЗагрузкойОбъекта";
	ИмяОбработчикаПриЗагрузке = НачалоИмени+"ПриЗагрузкеОбъекта";
	ИмяОбработчикаПослеЗагрузки = НачалоИмени+"ПослеЗагрузкиОбъекта";
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыУправленияНастройкиПолямиПоиска()
	
	КоличествоВариантовПоиска = Объект.ИдентификацияПоПолямПоиска.Количество();
	Если КоличествоВариантовПоиска = 0 Тогда
		Элементы.ЗадатьПорядокПолейПоиска.Заголовок = НСтр("ru = 'Задать порядок полей поиска'");
	ИначеЕсли КоличествоВариантовПоиска = 1 Тогда
		Элементы.ЗадатьПорядокПолейПоиска.Заголовок = Объект.ИдентификацияПоПолямПоиска[0].РеквизитыПоиска;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	// Оформление цвета фона для отключенных строк
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоСерый);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств.Отключить");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	// Оформляемые поля: вся строка.
	ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств");

	// Оформление шрифта для строк с ключевыми свойствами (для XDTO) и с полями поиска (XML).
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню, ,, Истина, Ложь, Ложь, ));
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Если ЭтоКонвертацияXDTO Тогда
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств.ЭтоКлючевоеСвойство");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		// Оформляемые поля: свойство формата 
		ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойствСвойствоФормата");
	Иначе
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств.Поиск");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		// Оформляемые поля: вся строка.
		ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств");
	КонецЕсли;

	// Оформление цвета текста для строк где используется алгоритм конвертации.
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Синий);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств.ИспользуетсяАлгоритмКонвертации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	// Оформляемые поля: вся строка.
	ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств");
	

КонецПроцедуры

&НаСервере
Процедура ДополнитьУсловноеОформление() 
	// Прочитаем последнее условное оформление - возможно уже добавлено оформление по списку ПКС.
	Элемент = УсловноеОформление.Элементы.Получить(УсловноеОформление.Элементы.Количество() - 1);
	ОтборЭлемента = Элемент.Отбор.Элементы.Получить(0); 
	Если ОтборЭлемента.ВидСравнения <> ВидСравненияКомпоновкиДанных.ВСписке Тогда
		// Желтый фон для ПКС с незаполненным ПКО
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ТусклоРозовый);
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств.Ссылка");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента.ПравоеЗначение = ПКСБезПКО;
		// Оформляемые поля: вся строка.
		ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПравилаКонвертацииСвойств"); 
	Иначе
		ОтборЭлемента.ПравоеЗначение = ПКСБезПКО;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкаНаАлгоритмПоИмени(Знач ИмяАлгоритма, СписокКонвертаций, СовместнаяРабота)
	
	ИмяАлгоритма = СокрЛП(ИмяАлгоритма);
	
	// Поиск алгоритма по имени и по составу конвертаций
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	Запрос = Новый Запрос;
	
	Если СовместнаяРабота Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Алгоритмы.Ссылка,
		|	ДанныеЗахвата.РабочаяКопия КАК РабочаяКопия,
		|	Алгоритмы.Копия КАК ЭтоКопия
		|ИЗ Справочник.Алгоритмы КАК Алгоритмы
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК СоставКонвертаций
		|ПО СоставКонвертаций.ЭлементКонвертации = Алгоритмы.Ссылка
		|	И СоставКонвертаций.Владелец В (&МассивКонвертаций)
		|	И СоставКонвертаций.Отключить = ЛОЖЬ И СоставКонвертаций.ПометкаУдаления = ЛОЖЬ
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник.Алгоритмы
		|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
		|ПО ДанныеЗахвата.Объект = Алгоритмы.Ссылка
		|	И ДанныеЗахвата.Пользователь = &ТекущийПользователь
		|ГДЕ Алгоритмы.ПометкаУдаления = ЛОЖЬ И Алгоритмы.ЭтоФункция = ЛОЖЬ
		|	И Алгоритмы.Код = &Код
		|";    
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Алгоритмы.Ссылка
		|ИЗ Справочник.Алгоритмы КАК Алгоритмы
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК СоставКонвертаций
		|ПО СоставКонвертаций.ЭлементКонвертации = Алгоритмы.Ссылка
		|	И СоставКонвертаций.Владелец В (&МассивКонвертаций)
		|	И СоставКонвертаций.Отключить = ЛОЖЬ И СоставКонвертаций.ПометкаУдаления = ЛОЖЬ
		|ГДЕ Алгоритмы.ПометкаУдаления = ЛОЖЬ И Алгоритмы.ЭтоФункция = ЛОЖЬ
		|	И Алгоритмы.Код = &Код И Алгоритмы.Копия = Ложь
		|";    
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Код", СокрЛП(ИмяАлгоритма));
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	СсылкаНаАлгоритм = Неопределено;
	Если СовместнаяРабота Тогда
		ЗахваченныйАлгоритм = Неопределено;
		СохраненнаяКопия = Неопределено;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.РабочаяКопия) Тогда
				ЗахваченныйАлгоритм = Выборка.Ссылка;
				СохраненнаяКопия = Выборка.РабочаяКопия;
			ИначеЕсли Выборка.ЭтоКопия Тогда
				СохраненнаяКопия = Выборка.Ссылка;
			Иначе
				СсылкаНаАлгоритм = Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
		Если ЗахваченныйАлгоритм <> Неопределено Тогда
			Возврат ЗахваченныйАлгоритм;
		ИначеЕсли СохраненнаяКопия <> Неопределено Тогда
			Возврат СохраненнаяКопия;
		КонецЕсли;
		Возврат СсылкаНаАлгоритм;
	Иначе
		ВсеАлгоритмы = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если ВсеАлгоритмы.Количество() = 1 Тогда 
			Возврат ВсеАлгоритмы[0];
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеАлгоритмаПослеЗагрузкиВсехДанных(Знач ИмяАлгоритма, СписокКонвертаций, СовместнаяРабота)
	
	ИмяАлгоритма = СокрЛП(ИмяАлгоритма);
	
	ДанныеАлгоритма = Новый Структура;
	ДанныеАлгоритма.Вставить("Ссылка", Справочники.Алгоритмы.ПустаяСсылка());
	ДанныеАлгоритма.Вставить("Текст");
	
	СсылкаНаАлгоритм = СсылкаНаАлгоритмПоИмени(ИмяАлгоритма, СписокКонвертаций, СовместнаяРабота);
	Если ЗначениеЗаполнено(СсылкаНаАлгоритм) Тогда
		
		ДанныеАлгоритма.Ссылка = СсылкаНаАлгоритм;
		ДанныеАлгоритма.Текст = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеАлгоритма.Ссылка, "Алгоритм");
		
	КонецЕсли;
	
	Возврат ДанныеАлгоритма;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеАлгоритмаПослеЗагрузкиВсехДанных()
	Если НЕ ЭтоКонвертацияXDTO Тогда
		Возврат;
	КонецЕсли;
	ДанныеАлгоритма = ДанныеАлгоритмаПослеЗагрузкиВсехДанных(Объект.АлгоритмПослеЗагрузкиВсехДанных, СписокКонвертаций, СовместнаяРабота);
	АлгоритмПослеЗагрузкиВсехДанныхСсылка = ДанныеАлгоритма.Ссылка;
	АлгоритмПослеЗагрузкиВсехДанныхТекст = ДанныеАлгоритма.Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранОбъектФормата(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Объект.ОбъектФормата = РезультатЗакрытия;
	ОбъектФорматаПриИзменении(Элементы.ОбъектФормата);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранОбъектКонфигурации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	// В параметре указано имя реквизита с объектом конфигурации.
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Объект[ДополнительныеПараметры] = РезультатЗакрытия.Ссылка;
	Иначе
		Объект[ДополнительныеПараметры] = РезультатЗакрытия;
	КонецЕсли;
	Модифицированность = Истина;
	Если НЕ ЭтоКонвертацияXDTO И ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ОбъектКонфигурацииКорреспондент) Тогда
		ПроверитьЭтоДокумент();		
		УстановитьВидимость();
	КонецЕсли; 
	Если ЭтоКонвертацияXDTO И ИспользоватьРазделениеМодуля Тогда 
		ОпределитьМодульПоУмолчанию();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьПКСПоРезультатамПодбора(Владелец, РезультатПодбора)
	МассивПКС = РезультатПодбора.ПКС;
	МассивПКГС = РезультатПодбора.ПКГС;
	ЗапросПГКС = Новый Запрос;
	ТекстЗапросаПГКС = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &Владелец И ЭтоГруппа = ИСТИНА И НЕ ПометкаУдаления
	|	И СвойствоКонфигурации = &СвойствоКонфигурации 
	| 	И " + ?(ЭтоКонвертацияXDTO,"СвойствоФормата = &СвойствоФормата", "СвойствоКонфигурацииКорреспондента = &СвойствоКонфигурацииКорреспондента");
	// Создание ПКГС.
	МассивПКСКУдалению = Новый Массив;
	Для Каждого СтруктураПКГС Из МассивПКГС Цикл
		// Возможно группа уже есть.
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаПГКС;
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Если СтруктураПКГС.Свойство("СвойствоКонфигурации") И ЗначениеЗаполнено(СтруктураПКГС.СвойствоКонфигурации) Тогда
			Запрос.УстановитьПараметр("СвойствоКонфигурации", СтруктураПКГС.СвойствоКонфигурации);
		Иначе
			Запрос.УстановитьПараметр("СвойствоКонфигурации", Справочники.Свойства.ПустаяСсылка());
		КонецЕсли;
		Если ЭтоКонвертацияXDTO И СтруктураПКГС.Свойство("СвойствоФормата") И ЗначениеЗаполнено(СтруктураПКГС.СвойствоФормата) Тогда
			Запрос.УстановитьПараметр("СвойствоФормата", СтруктураПКГС.СвойствоФормата);
		Иначе
			Запрос.УстановитьПараметр("СвойствоФормата", "");
		КонецЕсли;
		Если НЕ ЭтоКонвертацияXDTO И СтруктураПКГС.Свойство("СвойствоКонфигурацииКорреспондента") И
			ЗначениеЗаполнено(СтруктураПКГС.СвойствоКонфигурацииКорреспондента) Тогда
			Запрос.УстановитьПараметр("СвойствоКонфигурацииКорреспондента", СтруктураПКГС.СвойствоКонфигурацииКорреспондента);
		Иначе
			Запрос.УстановитьПараметр("СвойствоКонфигурацииКорреспондента", Справочники.Свойства.ПустаяСсылка());
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущееПКГС = Выборка.Ссылка;
		Иначе
			ТекущееПКГС = Справочники.ПравилаКонвертацииСвойств.СоздатьГруппу();
			ТекущееПКГС.Владелец = Владелец;
			ЗаполнитьЗначенияСвойств(ТекущееПКГС, СтруктураПКГС);
			ТекущееПКГС.Записать();
		КонецЕсли;
		// Подчиненные ПКС.
		Для Каждого СтруктураПКС Из МассивПКС Цикл
			СоздатьПКС = (СтруктураПКС.ГруппаСвойствКонфигурации = СтруктураПКГС.СвойствоКонфигурации);
			Если СоздатьПКС Тогда
				Если ЭтоКонвертацияXDTO Тогда
					СоздатьПКС = (СтруктураПКС.ГруппаСвойствФормата = СтруктураПКГС.СвойствоФормата);
				Иначе
					СоздатьПКС = СтруктураПКС.ГруппаСвойствКонфигурацииКорреспондента = СтруктураПКГС.СвойствоКонфигурацииКорреспондента
				КонецЕсли;
			КонецЕсли;
			Если СоздатьПКС Тогда
				ТекущееПКС = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
				ТекущееПКС.Владелец = Владелец;
				ТекущееПКС.Родитель = ТекущееПКГС.Ссылка;
				ПодобратьПКО_ПКС(СтруктураПКС);
				ЗаполнитьЗначенияСвойств(ТекущееПКС, СтруктураПКС);
				ТекущееПКС.Записать();
				МассивПКСКУдалению.Добавить(СтруктураПКС);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого СтруктураПКС Из МассивПКС Цикл
		Если МассивПКСКУдалению.Найти(СтруктураПКС) <> Неопределено Тогда
			// Уже создано.
			Продолжить;
		КонецЕсли;
		ТекущееПКС = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
		ТекущееПКС.Владелец = Владелец;
		ПодобратьПКО_ПКС(СтруктураПКС);
		ЗаполнитьЗначенияСвойств(ТекущееПКС, СтруктураПКС);
		ТекущееПКС.Записать();
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПодобратьПКО_ПКС(СтруктураПКС)
	ТипСсылочный = СтрНайти(СтруктураПКС.ТипСвойстваКонфигурации, ".");
	Если НЕ СтруктураПКС.Свойство("ТипСвойстваФормата") Тогда
		СтруктураПКС.Вставить("ТипСвойстваФормата", "");
	КонецЕсли;
	Если НЕ СтруктураПКС.Свойство("ТипСвойстваКонфигурацииКорреспондент") Тогда
		СтруктураПКС.Вставить("ТипСвойстваКонфигурацииКорреспондент", "");
	КонецЕсли;

	Если ЭтоКонвертацияXDTO Тогда
		ТипСсылочный = ТипСсылочный Или СтрНайти(СтруктураПКС.ТипСвойстваФормата, ".") > 0;
		ТипСсылочный = ТипСсылочный Или СтрНайти(СтруктураПКС.ТипСвойстваФормата, "КлючевыеСвойства") > 0;
	Иначе
		ТипСсылочный = ТипСсылочный Или СтрНайти(СтруктураПКС.ТипСвойстваКонфигурацииКорреспондент, ".") > 0;
	КонецЕсли;
	Если НЕ ТипСсылочный Тогда
		Возврат;
	КонецЕсли;
	УчитыватьОбъектКонфигурации = Ложь;
	УчитыватьОбъектКонфигурацииКорреспондент = Ложь;
	УчитыватьОбъектФормата = Ложь;
	ПКПД = Ложь;
	ПКО = Ложь;
	Если ЗначениеЗаполнено(СтруктураПКС.ТипСвойстваКонфигурации) Тогда
		Если Найти(НРег(СтруктураПКС.ТипСвойстваКонфигурации), НРег("ПеречислениеСсылка")) > 0 Тогда
			ПКПД = Истина;
		Иначе
			ПКО = Истина;
		КонецЕсли;
		УчитыватьОбъектКонфигурации = Истина;
	КонецЕсли;
	Если НЕ ЭтоКонвертацияXDTO И ЗначениеЗаполнено(СтруктураПКС.ТипСвойстваКонфигурацииКорреспондент) Тогда
		Если Найти(НРег(СтруктураПКС.ТипСвойстваКонфигурацииКорреспондент), НРег("ПеречислениеСсылка")) > 0 Тогда
			ПКПД = Истина;
		Иначе
			ПКО = Истина;
		КонецЕсли;
		УчитыватьОбъектКонфигурацииКорреспондент = Истина;
	КонецЕсли;
	Если ЭтоКонвертацияXDTO И ЗначениеЗаполнено(СтруктураПКС.ТипСвойстваФормата) Тогда
		УчитыватьОбъектФормата = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.ЗначенияФормата
		|ГДЕ Владелец.Наименование = &ТипСвойстваФормата";
		Запрос.УстановитьПараметр("ТипСвойстваФормата", СтруктураПКС.ТипСвойстваФормата);
		Результат = Запрос.Выполнить();
		УчитыватьОбъектФормата = Истина;
		Если Результат.Пустой() Тогда
			ПКО = Истина;
			Если Найти(СтруктураПКС.ТипСвойстваФормата, "КлючевыеСвойства") > 0 Тогда
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|Владелец.Наименование КАК ТипСвойстваФормата
				|ИЗ Справочник.СвойстваФормата
				|ГДЕ ВЫРАЗИТЬ(Тип КАК Строка(1000)) = &ТипСвойстваФормата И Наименование = ""КлючевыеСвойства""";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ТипСвойстваФорматаДляЗапроса = СокрЛП(Выборка.ТипСвойстваФормата);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПКПД = Истина;
		КонецЕсли;
	КонецЕсли;
	Запрос = Новый Запрос;
	ПустоеПКС = "";
	Если ПКПД Тогда
		// Ищем ПКПД
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПКПД.Код КАК Имя
		|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПКПД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК СоставКонвертации
		|	ПО ПКПД.Ссылка = СоставКонвертации.ЭлементКонвертации
		|		И СоставКонвертации.Владелец В (&МассивКонвертаций)
		|		И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ 
		|	(НЕ &УчитыватьОбъектКонфигурации ИЛИ ПКПД.ОбъектКонфигурации.Наименование В (&ОбъектКонфигурации))
		|	И (НЕ &УчитыватьОбъектКонфигурацииКорреспондент ИЛИ ПКПД.ОбъектКонфигурацииКорреспондент.Наименование В (&ОбъектКонфигурацииКорреспондент))
		|	И (ПКПД.ОбъектФормата = &ОбъектФормата ИЛИ НЕ &УчитыватьОбъектФормата)
		|	И (ПКПД.ИспользоватьДляОтправки = &ИспользоватьДляОтправки ИЛИ ПКПД.ИспользоватьДляПолучения = &ИспользоватьДляПолучения ИЛИ НЕ &УчитыватьНаправление)
		|	И НЕ ПКПД.ПометкаУдаления";
	Иначе
		// Ищем ПКО
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|ПКО.Код КАК Имя
		|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.СоставыКонвертаций КАК СоставКонвертации
		|	ПО ПКО.Ссылка = СоставКонвертации.ЭлементКонвертации
		|		И СоставКонвертации.Владелец В (&МассивКонвертаций)
		|		И СоставКонвертации.Отключить = ЛОЖЬ
		|ГДЕ  
		|	(НЕ &УчитыватьОбъектКонфигурации ИЛИ ПКО.ОбъектКонфигурации.Наименование В (&ОбъектКонфигурации))
		|	И (НЕ &УчитыватьОбъектКонфигурацииКорреспондент ИЛИ ПКО.ОбъектКонфигурацииКорреспондент.Наименование В (&ОбъектКонфигурацииКорреспондент))
		|	И (ПКО.ОбъектФормата = &ОбъектФормата ИЛИ НЕ &УчитыватьОбъектФормата)
		|	И (ПКО.ИспользоватьДляОтправки = &ИспользоватьДляОтправки ИЛИ ПКО.ИспользоватьДляПолучения = &ИспользоватьДляПолучения ИЛИ НЕ &УчитыватьНаправление)";
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивКонвертаций", СписокКонвертаций);
	Запрос.УстановитьПараметр("ИспользоватьДляОтправки", Объект.ИспользоватьДляОтправки);
	Запрос.УстановитьПараметр("ИспользоватьДляПолучения", Объект.ИспользоватьДляПолучения);
	Запрос.УстановитьПараметр("ОбъектКонфигурации", СтруктураПКС.ТипСвойстваКонфигурации);
	Запрос.УстановитьПараметр("ОбъектКонфигурацииКорреспондент", СтруктураПКС.ТипСвойстваКонфигурацииКорреспондент);
	Запрос.УстановитьПараметр("ОбъектФормата", ТипСвойстваФорматаДляЗапроса);
	Запрос.УстановитьПараметр("УчитыватьОбъектКонфигурации", УчитыватьОбъектКонфигурации);
	Запрос.УстановитьПараметр("УчитыватьОбъектКонфигурацииКорреспондент", УчитыватьОбъектКонфигурацииКорреспондент);
	Запрос.УстановитьПараметр("УчитыватьОбъектФормата", УчитыватьОбъектФормата);
	Запрос.УстановитьПараметр("УчитыватьНаправление", ЭтоКонвертацияXDTO);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураПКС.Вставить("ПравилоКонвертацииСвойства", Выборка.Имя);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикациюОбработчиков()
	Если ЭтоКонвертацияXDTO Тогда
		КоллекцияСтраниц = Элементы.ОбработчикиXDTO;
		ПоляИсключение = "АлгоритмПослеЗагрузкиВсехДанныхТекст";
	Иначе
		КоллекцияСтраниц = Элементы.ОбработчикиXML;
		ПоляИсключение = "";
	КонецЕсли;
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(КоллекцияСтраниц, Объект, ПоляИсключение);
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбновитьОтборДинамическогоСпискаПКС()
	ОтборНайден = Ложь;
	Для Каждого ЭлементОтбора Из ПравилаКонвертацииСвойств.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
			ОтборНайден = Истина;
			ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ОтборНайден Тогда
		ЭлементОтбора = ПравилаКонвертацииСвойств.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ИзменитьПорядокНаСервере(ПКССсылка, ПКСРодитель, Направление)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|Ссылка,
	|Порядок,
	|ВЫБОР КОГДА Ссылка = &ТекущееПКС ТОГДА
	|	ИСТИНА
	|ИНАЧЕ
	|	ЛОЖЬ
	|КОНЕЦ КАК ЭтоТекущееПравило
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &ПКО И Родитель = &ПКСРодитель
	|УПОРЯДОЧИТЬ ПО Порядок ВОЗР";
	Запрос.УстановитьПараметр("ПКО", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПКСРодитель", ПКСРодитель);
	Запрос.УстановитьПараметр("ТекущееПКС", ПКССсылка);
	ТаблицаПКС = Запрос.Выполнить().Выгрузить();
	ТекущаяСтрокаПКС = ТаблицаПКС.Найти(Истина, "ЭтоТекущееПравило");
	Если ТекущаяСтрокаПКС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИндексТекущейСтроки = ТаблицаПКС.Индекс(ТекущаяСтрокаПКС);
	Если (Направление = 1 И ИндексТекущейСтроки < ТаблицаПКС.Количество()-1)
		Или (Направление = -1 И ИндексТекущейСтроки > 0) Тогда
		ТаблицаПКС.Сдвинуть(ТекущаяСтрокаПКС, Направление);
	КонецЕсли;
	НачатьТранзакцию();
	Для Каждого СтрокаПКС Из ТаблицаПКС Цикл
		ТекПорядок = (ТаблицаПКС.Индекс(СтрокаПКС) + 1) * 50;
		Если ТекПорядок <> СтрокаПКС.Порядок Тогда
			Элем = СтрокаПКС.Ссылка.ПолучитьОбъект();
			Элем.Порядок = ТекПорядок;
			Попытка
				Элем.Записать();
			Исключение
				Возврат;										
			КонецПопытки;	
		КонецЕсли;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	Если Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПорядокНаСервере(Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока,
		Элементы.ПравилаКонвертацииСвойств.ТекущиеДанные.Родитель, -1);
	Элементы.ПравилаКонвертацииСвойств.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПометитьКакПровереноНаСервере(ПКССсылка)
	ПКСОбъект = ПКССсылка.ПолучитьОбъект();
	ПКСОбъект.Проверено = Истина;
	ПКСОбъект.ОбменДанными.Загрузка = Истина;
	ПКСОбъект.Записать(); 
	ДополнитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПометитьКакПроверено(Команда)
	Если Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементСпискаЗначений = ПКСБезПКО.НайтиПоЗначению(Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока);
	Если ЭлементСпискаЗначений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПКСБезПКО.Удалить(ЭлементСпискаЗначений);
	ПометитьКакПровереноНаСервере(Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока); 
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	Если Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ИзменитьПорядокНаСервере(Элементы.ПравилаКонвертацииСвойств.ТекущаяСтрока,
		Элементы.ПравилаКонвертацииСвойств.ТекущиеДанные.Родитель, 1);
	Элементы.ПравилаКонвертацииСвойств.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВопросОДобавленииВСоставКонвертаций(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОтказДобавления = Ложь;
		ДополнитьСоставКонвертации(СписокКонвертацийКДобавлению, Объект.Ссылка, ОтказДобавления);
		СписокКонвертацийКДобавлению.Очистить();
		Если НЕ ОтказДобавления Тогда
			Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЭтоДокумент()
	КонвертацияДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектКонфигурацииКорреспондент, "Тип") = ПредопределенноеЗначение("Перечисление.ТипыОбъектов.Документ");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыВыбораДополнительногоМодуля()
	ПараметрВладелец = Новый ПараметрВыбора("Отбор.Владелец", КонвертацияВладелецМодулей); 
	ПараметрРаздел = Новый ПараметрВыбора("Отбор.Раздел", Перечисления.РазделыДополнительныхМодулей.Пользовательский);
	ПараметрыВыбораМодуля = Новый Массив; 	
	ПараметрыВыбораМодуля.Добавить(ПараметрВладелец);
	ПараметрыВыбораМодуля.Добавить(ПараметрРаздел);
	Элементы.ДополнительныйМодуль.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМодуля);
КонецПроцедуры

&НаСервере
Процедура ОпределитьМодульПоУмолчанию()
    Элементы.ДекорацияМодульМенеджера.Заголовок = "";       
	Элементы.ДекорацияПредопределенныйМодуль.Заголовок = КонвертацияДанныхXDTOСервер.ОпределитьМодульПравилаПоУмолчанию(КонвертацияВладелецМодулей, 
			Объект.ОбъектКонфигурации, Объект.ОбъектФормата, Объект.Код, Объект.ИспользоватьДляОтправки, Объект.ИспользоватьДляПолучения); 
	Если ЗначениеЗаполнено(Объект.ОбъектКонфигурации) Тогда
		ТекстНадписи = НСтр("ru='Выгружается в модуль менеджера %ИмяМодуля%'"); 
		Элементы.ДекорацияМодульМенеджера.Заголовок = СтрЗаменить(ТекстНадписи, "%ИмяМодуля%", СокрЛП(Объект.ОбъектКонфигурации));
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура СкопироватьПКС(ПКОИсточник, ПКОПолучатель) 
	ЗапросПКС = Новый Запрос;
	ЗапросПКС.Текст = "ВЫБРАТЬ  
	|	Код,
	|	Ссылка,
	|	Родитель,
	|	ЭтоГруппа
	| ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &ПКО И НЕ ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО ЭтоГруппа УБЫВ";
	ЗапросПКС.УстановитьПараметр("ПКО", ПКОИсточник);
	ВыборкаПКС = ЗапросПКС.Выполнить().Выбрать();
	СоответствиеГрупп = Новый Соответствие;
	Пока ВыборкаПКС.Следующий() Цикл
		ДубльПКС = ВыборкаПКС.Ссылка.Скопировать();
		ДубльПКС.Владелец = ПКОПолучатель;
		Если ЗначениеЗаполнено(ВыборкаПКС.Родитель) Тогда
			ДубльПКС.Родитель = СоответствиеГрупп.Получить(ВыборкаПКС.Родитель);
		КонецЕсли;
		ДубльПКС.Код = ВыборкаПКС.Код;    
		Если НЕ ЗНачениеЗаполнено(ДубльПКС.Код) Тогда
			ДубльПКС.УстановитьНовыйКод();
		КонецЕсли;
		ДубльПКС.ОбменДанными.Загрузка = Истина;
		Если НЕ ДубльПКС.ЭтоГруппа Тогда
			ДубльПКС.Проверено = Ложь;
		КонецЕсли;
		ДубльПКС.Записать();
		Если ВыборкаПКС.ЭтоГруппа Тогда
			СоответствиеГрупп.Вставить(ВыборкаПКС.Ссылка, ДубльПКС.Ссылка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьЗаполненияПКОВПКС() 
	ПКСБезПКО.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка); 
	Запрос.Текст = "ВЫБРАТЬ
	|	ПравилаКонвертацииСвойств.Ссылка КАК Ссылка,
	|	ПравилаКонвертацииСвойств.СвойствоКонфигурации КАК СвойствоКонфигурации,
	|	ПравилаКонвертацииСвойств.СвойствоФормата КАК СвойствоФормата
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|ГДЕ ПравилаКонвертацииСвойств.Владелец = &Владелец
	|	И НЕ ПравилаКонвертацииСвойств.Проверено
	|	И НЕ ПравилаКонвертацииСвойств.Отключить
	|	И ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства = """"
	|	И ПравилаКонвертацииСвойств.ТипСвойстваКонфигурации ПОДОБНО ""%Ссылка%""";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Объект.ИспользоватьДляОтправки Тогда 
			Если ЗначениеЗаполнено(Объект.АлгоритмПриОтправкеДанных) И СтрНайти(Объект.АлгоритмПриОтправкеДанных, Выборка.СвойствоФормата) Тогда
				Продолжить;
			КонецЕсли;
			ПКСБезПКО.Добавить(Выборка.Ссылка); 
			Продолжить;
		КонецЕсли;
		Если Объект.ИспользоватьДляПолучения Тогда 
			Если ЗначениеЗаполнено(Объект.АлгоритмПередПолучениемДанных) И СтрНайти(Объект.АлгоритмПередПолучениемДанных, Выборка.СвойствоКонфигурации) Тогда
				Продолжить;
			КонецЕсли;
			ПКСБезПКО.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла; 
	Если ПКСБезПКО.Количество() > 0 Тогда
		ДополнитьУсловноеОформление();
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

#КонецОбласти