#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Возвращает наименование модуля по умолчанию, в зависимости от Раздела.
// Параметры:
//   Раздел - Перечисление.РазделыДополнительныхМодулей - Для какого раздела следует получить наименование.
Функция НаименованиеПоУмолчанию(Раздел) Экспорт
	Если Раздел = Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
		Возврат "МенеджерОбменаАлгоритмы";
	ИначеЕсли Раздел =  Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка Тогда 
		Возврат "МенеджерОбменаДокументыОтправка";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение Тогда
		Возврат "МенеджерОбменаДокументыПолучение";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка Тогда
		Возврат "МенеджерОбменаПрочееОтправка"; 
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ПрочееПолучение Тогда
		Возврат "МенеджерОбменаПрочееПолучение";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение Тогда
		Возврат "МенеджерОбменаПрочееПолучение";
	ИначеЕсли Раздел = Перечисления.РазделыДополнительныхМодулей.Базисный Тогда
		Возврат "МенеджерОбменаЧерезУниверсальныйФормат";
	КонецЕсли;
	
    Возврат "МенеджерОбменаДополнительныйМодуль";
КонецФункции 
#КонецОбласти
#КонецЕсли