#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ИзмениласьПометкаУдаления = (Ссылка.ПометкаУдаления <> ПометкаУдаления);
	Если ИзмениласьПометкаУдаления Тогда
		// Для ключевых свойств должны быть синхронные изменения.
		Если НЕ ЭтоГруппа И Родитель.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.КлючевыеСвойства Тогда
			ОбработатьПометкуНаУдалениеКлючевогоСвойства(Родитель, Наименование, ПометкаУдаления);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(Тип) И СоставнойТип  Тогда
		МассивТипов = Состав.ВыгрузитьКолонку("ТипФормата");
		Тип = Лев(СтрСоединить(МассивТипов, ";"),1000);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ОбработатьПометкуНаУдалениеКлючевогоСвойства(Родитель, Наименование, НоваяПометкаУдаления)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОбъектКС.Ссылка КАК ОбъектКС,
	|	СвойстваКлючевые.Ссылка КАК СвойствоКС
	|ИЗ Справочник.ОбъектыФормата КАК ОбъектКС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата КАК СвойстваКлючевые
	|	ПО СвойстваКлючевые.Владелец = ОбъектКС.Ссылка
	|		И СвойстваКлючевые.Наименование = &НаименованиеСвойстваКС
	|		И СвойстваКлючевые.ПометкаУдаления <> &НоваяПометкаУдаления
	|ГДЕ ОбъектКС.Владелец = &ВерсияФормата
	|	И ОбъектКС.ТипОбщегоРеквизита = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.КлючевыеСвойства)
	|	И ОбъектКС.Наименование = &НаименованиеОбъектаКС
	|	И ОбъектКС.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ВерсияФормата", Родитель.Владелец.Владелец);
	Запрос.УстановитьПараметр("НаименованиеОбъектаКС", Родитель.ОбъектХранительСвойств);
	Запрос.УстановитьПараметр("НаименованиеСвойстваКС", Наименование);
	Запрос.УстановитьПараметр("НоваяПометкаУдаления", НоваяПометкаУдаления);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СвойствоОбъект = Выборка.СвойствоКС.ПолучитьОбъект();
		СвойствоОбъект.УстановитьПометкуУдаления(НоваяПометкаУдаления);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли