#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("парВерсияФормата") И ЗначениеЗаполнено(Параметры.парВерсияФормата) Тогда
		Объект.ВерсияФормата = Параметры.парВерсияФормата;
		СпособЗагрузки = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Объект.ИмяОсновногоПакетаXDTO = "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.1";  
	РезультатАнализаФайлов = НСтр("ru='Не выбраны данные для загрузки'"); 
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИменаФайловДляЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Файл данных (*.xsd)|*.xsd";
	ДиалогВыбора.Заголовок = НСтр("ru = 'Выберите файлы со структурой формата'");
	ДиалогВыбора.ПредварительныйПросмотр = Ложь;
	ДиалогВыбора.Расширение = "xsd";
	ДиалогВыбора.ИндексФильтра = 0;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбора.МножественныйВыбор = Истина;

	ДополнительныеПараметры = Новый Структура("Расширение", Ложь);
	Оповещение = Новый ОписаниеОповещения("ПомещениеФайловНаСерверЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	НачатьПомещениеФайлов(Оповещение, , ДиалогВыбора, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаРасширенияФорматаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Файл данных (*.xsd)|*.xsd";
	ДиалогВыбора.Заголовок = НСтр("ru = 'Выберите файл со структурой расширения формата'");
	ДиалогВыбора.ПредварительныйПросмотр = Ложь;
	ДиалогВыбора.Расширение = "xsd";
	ДиалогВыбора.ИндексФильтра = 0;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбора.МножественныйВыбор = Ложь;

	ДополнительныеПараметры = Новый Структура("Расширение", Истина);
	Оповещение = Новый ОписаниеОповещения("ПомещениеФайловНаСерверЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	НачатьПомещениеФайлов(Оповещение, , ДиалогВыбора, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ИменаФайловДляЗагрузкиОчистка(Элемент, СтандартнаяОбработка)
	РезультатАнализаФайлов = НСтр("ru='Не выбраны данные для загрузки'"); 
	Объект.ВерсияФормата = "";
	Объект.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения = Ложь;   
	Объект.ИмяФайлаРасширенияФормата = "";
	АдресВременногоХраненияДанныхРасширения = Неопределено;
	ДобавлятьТолькоНовые_Расширение = Ложь;
	СпособЗагрузки = 0;  
	Если Элемент.Имя = "ИменаФайловДляЗагрузки" Тогда
		Объект.ИменаФайловДляЗагрузки.Очистить();
	Иначе
		ПроверитьЗагруженныеФайлы(Ложь);
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	Если Объект.ИменаФайловДляЗагрузки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны файлы со структурой формата'"));
		Возврат;
	КонецЕсли;
	
	Если СокрЛП(Объект.ИмяОсновногоПакетаXDTO) = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось определить имя основного пакета XDTO'"));
		Возврат;
	КонецЕсли;
	
	Если СпособЗагрузки = 1 И Не ЗначениеЗаполнено(Объект.ВерсияФормата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не обнаружен формат для загрузки структуры'"));
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Ожидание;
	ИзменитьДоступностьЭлементовФормы(Ложь);
	
	ПодключитьОбработчикОжидания("ЗапускОбработки", 0.1, Истина);

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗапускОбработки()
	АдресВременногоХранения = Неопределено;
	ВыполнитьЗагрузкуСервер(СпособЗагрузки, АдресВременногоХранения);
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если Не ДлительнаяОперация Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
		ИзменитьДоступностьЭлементовФормы(Истина);
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеЗагрузкиФормата", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеЗагрузкиФормата()
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	Если РезультатЗагрузки.Успех Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата) Тогда 
			// После загрузки основного формата можно грузить расширения.
			Элементы.ГруппаЗагрузкаРасширений.Доступность = Истина;
			Элементы.ДобавлятьТолькоНовые_Расширение.Доступность = Ложь; 
		КонецЕсли;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры формата выполнена успешно'"));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры формата не выполнена'"));
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения.Доступность = (СпособЗагрузки = 1) И НЕ ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата);
	Элементы.ДобавлятьТолькоНовые_Расширение.Доступность = (СпособЗагрузки = 1) И ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата);
	Элементы.ГруппаЗагрузкаРасширений.Доступность = (СпособЗагрузки = 1) Или ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата);
	Элементы.ФормаВыполнитьЗагрузку.Доступность = Объект.ИменаФайловДляЗагрузки.Количество() > 0;
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайловНаСерверЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Расширение Тогда
		Объект.ИмяФайлаРасширенияФормата = "";
		Объект.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения = Ложь;
		Если ПомещенныеФайлы <> Неопределено Тогда
			Объект.ИмяФайлаРасширенияФормата = ПомещенныеФайлы[0].Имя;
			АдресВременногоХраненияДанныхРасширения = ПомещенныеФайлы[0].Хранение;
			ПроверитьЗагруженныеФайлы(Истина);
		Иначе
			ТекстОшибки = НСтр("ru = 'Ошибка передачи файла структуры расширения формата на сервер'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Объект.ИмяФайлаРасширенияФормата");
		КонецЕсли;
	Иначе
		Если ПомещенныеФайлы.Количество() <> 2 Тогда
			ТекстОшибки = НСтр("ru = 'Количество выбранных файлов неверно. Должно быть выбрано два файла со структурой формата.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Объект.ИменаФайловДляЗагрузки");
			Возврат;
		КонецЕсли;
		Объект.ИменаФайловДляЗагрузки.Очистить();
		Объект.ВерсияФормата = Неопределено;
		Объект.ИмяОсновногоПакетаXDTO = "";
		
		Если Не ПомещенныеФайлы = Неопределено Тогда
			Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
				Объект.ИменаФайловДляЗагрузки.Добавить(ПомещенныйФайл.Хранение, ПомещенныйФайл.Имя);
			КонецЦикла;
			// Если уже выбран файл с расширением то вычислять имя пакета и версию формата не требуется.
			Если НЕ ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата) Тогда
				ПроверитьЗагруженныеФайлы(Ложь); 
			КонецЕсли;
		Иначе
			ТекстОшибки = НСтр("ru = 'Ошибка передачи файлов структуры формата на сервер'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Объект.ИменаФайловДляЗагрузки");
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементовФормы(ФлагДоступность)
	Элементы.ФормаВыполнитьЗагрузку.Доступность = ФлагДоступность;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗагруженныеФайлы(ЭтоРасширение)
	ВсеПакетыXDTO = Новый Соответствие; 
	Если ЭтоРасширение Тогда
		ПрочитатьДанныеОПакетахXDTO(ВсеПакетыXDTO, АдресВременногоХраненияДанныхРасширения);
	Иначе
		Для Каждого ИмяФайлаДляЗагрузки Из Объект.ИменаФайловДляЗагрузки Цикл 
			ПрочитатьДанныеОПакетахXDTO(ВсеПакетыXDTO, ИмяФайлаДляЗагрузки.Значение);
		КонецЦикла; 
	КонецЕсли;
	Для Каждого ДанныеПакета Из ВсеПакетыXDTO Цикл
		КлючЗагружаемойВерсии = ДанныеПакета.Ключ;
		Прервать;
	КонецЦикла;
	Если ВсеПакетыXDTO.Количество() = 0 Тогда
		Если ЭтоРасширение Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить номер версии расширения формата. Возможно выбран некорректный файл с расширением формата.");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить номер версии формата. Возможно выбраны некорректные файлы со структурой формата.");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Объект.ВерсияФормата = ВсеПакетыXDTO[КлючЗагружаемойВерсии].ВерсияФормата;
	Объект.ИмяОсновногоПакетаXDTO = КлючЗагружаемойВерсии;
	РодительВерсии = ВсеПакетыXDTO[КлючЗагружаемойВерсии].РодительВерсии; 
	НомерВерсииФормата = ВсеПакетыXDTO[КлючЗагружаемойВерсии].НомерВерсииФормата;
	ШаблонПространстваИмен = ВсеПакетыXDTO[КлючЗагружаемойВерсии].ШаблонПространстваИмен;

	Если ЗначениеЗаполнено(РодительВерсии) Тогда
		Если ЗначениеЗаполнено(Объект.ВерсияФормата) Тогда
			СпособЗагрузки = 1;
			РезультатАнализаФайлов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Будет обновлена версия формата %1'"), НомерВерсииФормата);
		Иначе
			СпособЗагрузки = 0;
			РезультатАнализаФайлов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Будет создана новая версия формата %1 в группе %2'"), НомерВерсииФормата, РодительВерсии.Наименование);
		КонецЕсли;
	Иначе
		СпособЗагрузки = 0;
		РезультатАнализаФайлов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Будет создана новая группа %1 и новая версия формата %2'"), ШаблонПространстваИмен, НомерВерсииФормата);

	КонецЕсли;  
	Если ЭтоРасширение Тогда
		РезультатАнализаФайлов = СтрЗаменить(РезультатАнализаФайлов, НСтр("ru='версия формата'"), НСтр("ru='версия формата-расширения'"))
	КонецЕсли;
	Если СпособЗагрузки = 0 Тогда
		Объект.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения = Ложь;
	КонецЕсли;
КонецПроцедуры 

Процедура ПрочитатьДанныеОПакетахXDTO(ВсеПакетыXDTO, АдресХранилищаФайлаСхемы)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилищаФайлаСхемы);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ЭтоОсновнаяСхема = Ложь;
	ТекИмяПакета = "";
	ЕстьДирективаИмпорт = Ложь;
	ДанныеФайла = Новый ЧтениеXML;
	ДанныеФайла.ОткрытьФайл(ИмяВременногоФайла);
	ДанныеФайла.Прочитать();

	Если ДанныеФайла.Имя = "xs:schema" Тогда
		Пока ДанныеФайла.ПрочитатьАтрибут() Цикл
			Если ДанныеФайла.Имя = "targetNamespace" Тогда
				ТекИмяПакета = СокрЛП(ДанныеФайла.Значение);
			КонецЕсли;
		КонецЦикла;
		ДанныеФайла.Прочитать();
		Если ДанныеФайла.Имя = "xs:import" Тогда
			ЕстьДирективаИмпорт = Истина;
		КонецЕсли;
	КонецЕсли; 
	Если НЕ ЕстьДирективаИмпорт Тогда
		Возврат;
	КонецЕсли;
	СведенияОФормате = РазобратьИмяПакетаXDTO(ТекИмяПакета);
	НомерВерсииФормата = СведенияОФормате.НомерВерсииФормата;
	ШаблонПространстваИмен = СведенияОФормате.ШаблонПространстваИмен;
	// Ищем родителя.
	РодительВерсии = Справочники.ВерсииФормата.НайтиПоРеквизиту("ПространствоИмен", ШаблонПространстваИмен, Справочники.ВерсииФормата.ПустаяСсылка());
	СведенияОФормате.Вставить("РодительВерсии", РодительВерсии);
	Если ЗначениеЗаполнено(РодительВерсии) Тогда
		ВерсияФормата = Справочники.ВерсииФормата.НайтиПоНаименованию(НомерВерсииФормата,,РодительВерсии);
		СведенияОФормате.Вставить("ВерсияФормата", ВерсияФормата);
	Иначе
		СведенияОФормате.Вставить("ВерсияФормата", Справочники.ВерсииФормата.ПустаяСсылка());
	КонецЕсли; 
	ВсеПакетыXDTO.Вставить(ТекИмяПакета, СведенияОФормате);
	ДанныеФайла.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);	
КонецПроцедуры

&НаСервере
Функция РазобратьИмяПакетаXDTO(ИмяПакетаXDTO)
	НомерВерсии = "";
	ШаблонПространстваИмен = "";
	ДлинаСтрокиПакета = СтрДлина(ИмяПакетаXDTO);
	Для НомерПозиции = 1 По ДлинаСтрокиПакета Цикл
		ТекСимвол = Сред(ИмяПакетаXDTO, ДлинаСтрокиПакета - НомерПозиции + 1, 1);
		Если ТекСимвол = "/" Тогда
			НомерВерсии = Прав(ИмяПакетаXDTO, НомерПозиции-1);
			ШаблонПространстваИмен = Лев(ИмяПакетаXDTO, ДлинаСтрокиПакета - НомерПозиции);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Новый Структура("НомерВерсииФормата, ШаблонПространстваИмен", НомерВерсии, ШаблонПространстваИмен);
КонецФункции

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаСервере
Процедура ВыполнитьЗагрузкуСервер(СпособЗагрузки, АдресВременногоХранения)
	ДанныеДляЗагрузки = Новый Массив;
	Для Каждого ФайлДляЗагрузки Из Объект.ИменаФайловДляЗагрузки Цикл
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
		ДвоичныеДанныеСхемы = ПолучитьИзВременногоХранилища(ФайлДляЗагрузки.Значение);
		ДвоичныеДанныеСхемы.Записать(ИмяВременногоФайла);
		ДанныеДляЗагрузки.Добавить(ИмяВременногоФайла);
	КонецЦикла;
	Если ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата) Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xsd");
		ДвоичныеДанныеСхемы = ПолучитьИзВременногоХранилища(АдресВременногоХраненияДанныхРасширения);
		ДвоичныеДанныеСхемы.Записать(ИмяВременногоФайла);
		ДанныеДляЗагрузки.Добавить(ИмяВременногоФайла);
	КонецЕсли;
	
	ИдентификаторЗадания = Неопределено;
	ДлительнаяОперация = Ложь;
	АдресХранилищаРезультата = Неопределено;
	СтруктураПараметров = Новый Структура("СпособЗагрузки, ВерсияФормата, ДобавлятьТолькоНовые, ЭтоРасширение",
		СпособЗагрузки, Объект.ВерсияФормата, Объект.ДобавлятьТолькоНовыеОбъектыСвойстваЗначения, Ложь);
		
	СтруктураПараметров.Вставить("ИмяОсновногоПакетаXDTO", Объект.ИмяОсновногоПакетаXDTO);
	СтруктураПараметров.Вставить("РодительВерсии", РодительВерсии);
	СтруктураПараметров.Вставить("ШаблонПространстваИмен", ШаблонПространстваИмен);
	СтруктураПараметров.Вставить("НомерВерсииФормата", НомерВерсииФормата);
	СтруктураПараметров.Вставить("ДанныеДляЗагрузки", ДанныеДляЗагрузки); 
	Если ЗначениеЗаполнено(Объект.ИмяФайлаРасширенияФормата) Тогда
		СтруктураПараметров.Вставить("ЭтоРасширение", Истина); 
		СтруктураПараметров.Вставить("ДобавлятьТолькоНовые", ДобавлятьТолькоНовые_Расширение);
	КонецЕсли;
	
	ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка структуры формата'");
	ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
	Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаСтруктурыФормата.ВыполнитьЗагрузкуФормата",
		СтруктураПараметров, ПараметрыФоновогоЗадания);
	АдресХранилищаРезультата = Результат.АдресРезультата;
	ДлительнаяОперация = Истина;
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
КонецПроцедуры





#КонецОбласти


