#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если Объект.Ссылка.Пустая() Тогда
		РасписаниеРегламентногоЗадания = РасписаниеРегламентногоЗаданияПоУмолчанию();
	Иначе
		РасписаниеРегламентногоЗадания = ПолучитьРасписаниеЗагрузкиМетаданных(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РегламентноеЗаданиеОбъект = РегламентноеЗаданиеПоИдентификатору(ТекущийОбъект.РегламентноеЗаданиеGUID);
	// При необходимости создаем регламентное задание.
	Если РегламентноеЗаданиеОбъект = Неопределено Тогда
		ПараметрыЗадания = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ЗагрузкаМетаданных);
		РегламентноеЗаданиеОбъект = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	КонецЕсли;
	ПараметрыРегламентногоЗадания = Новый Массив;
	Если ТекущийОбъект.ЭтоНовый() Тогда
		ПараметрыРегламентногоЗадания.Добавить(ТекущийОбъект.ПолучитьСсылкуНового().УникальныйИдентификатор());
	Иначе
		ПараметрыРегламентногоЗадания.Добавить(ТекущийОбъект.Ссылка.УникальныйИдентификатор());
	КонецЕсли;
	
	НаименованиеРегламентногоЗадания = НСтр("ru = 'Загрузка структуры метаданных: %1'");
	НаименованиеРегламентногоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НаименованиеРегламентногоЗадания, СокрЛП(ТекущийОбъект.Наименование));
	
	РегламентноеЗаданиеОбъект.Наименование  = Лев(НаименованиеРегламентногоЗадания, 120);
	РегламентноеЗаданиеОбъект.Использование = ТекущийОбъект.ОбновлятьМетаданныеПоРасписанию;
	РегламентноеЗаданиеОбъект.Параметры     = ПараметрыРегламентногоЗадания;
	
	// Обновляем расписание, если оно было изменено.
	Если РасписаниеРегламентногоЗадания <> Неопределено Тогда
		РегламентноеЗаданиеОбъект.Расписание = РасписаниеРегламентногоЗадания;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		// записываем задание
		РегламентноеЗаданиеОбъект.Записать();
		
	Исключение
		
		СтрокаСообщения = НСтр("ru = 'Произошла ошибка при сохранении расписания загрузки структуры метаданных. Подробное описание ошибки: %1'");
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		МодульОбменДаннымиСервер = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиСервер");
		МодульОбменДаннымиСервер.СообщитьОбОшибке(СтрокаСообщения, Отказ);
		
	КонецПопытки;
	ТекущийОбъект.РегламентноеЗаданиеGUID = Строка(РегламентноеЗаданиеОбъект.УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КаталогЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораКаталога", ЭтотОбъект, Новый Структура("ВыборРасширения", Ложь));
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура РасширенияИмяКаталогаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораКаталога", ЭтотОбъект, Новый Структура("ВыборРасширения", Истина));
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ТекКаталог = Элементы.Расширения.ТекущиеДанные.ИмяКаталогаЗагрузки;
	Если ЗначениеЗаполнено(ТекКаталог) Тогда
		ДиалогВыбора.Каталог = ТекКаталог;
	КонецЕсли;
	ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьМетаданныеПоРасписаниюПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЕстьРасширенияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры 

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСтруктуруКонфигурации(Команда)
	СтруктураПараметров = Новый Структура("парКонфигурация", Объект.Ссылка);
	СтруктураПараметров.Вставить("ИсточникДанных", Объект.ИсточникДанных);
	СтруктураПараметров.Вставить("КаталогЗагрузки", Объект.КаталогЗагрузки);
	СтруктураПараметров.Вставить("ЕстьРасширения", Объект.ЕстьРасширения);
	СтруктураПараметров.Вставить("ВариантЗагрузкиДвижений", Объект.ВариантЗагрузкиДвижений);

	Если Объект.ЕстьРасширения Тогда
		КаталогиРасширений = Новый Массив;
		Для Каждого СтрРасширения Из Объект.Расширения Цикл
			КаталогиРасширений.Добавить(СтрРасширения.ИмяКаталогаЗагрузки);
		КонецЦикла;
		СтруктураПараметров.Вставить("Расширения", КаталогиРасширений);
	КонецЕсли;		
	ИмяФормыЗагрузки = "Обработка.ЗагрузкаСтруктурыКонфигурацииИзФайловXML.Форма";
	ОткрытьФорму(ИмяФормыЗагрузки, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеРегламентногоЗадания(Команда)
	РедактированиеРасписанияРегламентногоЗадания();
	
	ОбновитьПредставлениеРасписания();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзменения(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.АдресGitСервера) Или НЕ ЗначениеЗаполнено(Объект.ИмяВеткиРепозитория) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСТР("ru='Не заполнены настройки GIT - адрес сервера / имя ветки репозитория'"));
		Возврат;
	КонецЕсли;
	ПолучитьИзмененияНаСервере();
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗавершениеВыбораКаталога(Знач ВыбранныеФайлы, Знач ДопПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Или НЕ ДопПараметры.Свойство("ВыборРасширения") Тогда
		Возврат;
	КонецЕсли;
	Если ДопПараметры.ВыборРасширения Тогда
		НомСтроки = Элементы.Расширения.ТекущиеДанные.НомерСтроки;
		Объект.Расширения[НомСтроки - 1].ИмяКаталогаЗагрузки = ВыбранныеФайлы[0];
	Иначе
		Объект.КаталогЗагрузки = ВыбранныеФайлы[0];
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГруппаРасписаниеНастройки.Видимость = Объект.ОбновлятьМетаданныеПоРасписанию;
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Видимость = Объект.ОбновлятьМетаданныеПоРасписанию;
	Элементы.ГруппаНастройкиGIT.Видимость = Объект.ОбновлятьМетаданныеПоРасписанию И (Объект.ИсточникДанных = 1);
	Элементы.ГруппаНастройкиXML.Видимость = Объект.ОбновлятьМетаданныеПоРасписанию И (Объект.ИсточникДанных = 0);
	Элементы.Расширения.Видимость = Объект.ОбновлятьМетаданныеПоРасписанию И (Объект.ИсточникДанных = 0) И Объект.ЕстьРасширения;

	ОбновитьПредставлениеРасписания();
КонецПроцедуры

&НаСервере
Функция РасписаниеРегламентногоЗаданияПоУмолчанию()
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);
	
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДниНедели                = ДниНедели;
	Расписание.ПериодПовтораВТечениеДня = 900; // 15 минут
	Расписание.ПериодПовтораДней        = 1; // каждый день
	Расписание.Месяцы                   = Месяцы;
	
	Возврат Расписание;
КонецФункции

&НаСервере
Функция ПолучитьРасписаниеЗагрузкиМетаданных()
	РеглЗадание = РегламентноеЗаданиеПоИдентификатору(Объект.РегламентноеЗаданиеGUID);
	
	Если РеглЗадание = Неопределено Тогда
		Возврат Новый РасписаниеРегламентногоЗадания;
	Иначе
		Возврат РеглЗадание.Расписание;
	КонецЕсли;	
КонецФункции

&НаСервере
Функция РегламентноеЗаданиеПоИдентификатору(УИД)
	Если ПустаяСтрока(УИД) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор(УИД));
	
	УстановитьПривилегированныйРежим(Истина);
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Если Задания.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Задания[0]
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбновитьПредставлениеРасписания()
	Если Объект.ОбновлятьМетаданныеПоРасписанию = Ложь Тогда
		Возврат;
	КонецЕсли;
	ПредставлениеРасписания = Строка(РасписаниеРегламентногоЗадания);
	
	Если ПредставлениеРасписания = Строка(Новый РасписаниеРегламентногоЗадания) Тогда
		
		ПредставлениеРасписания = НСтр("ru = 'Расписание не задано'");
		
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеРегламентногоЗадания.Заголовок = ПредставлениеРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРасписанияРегламентногоЗадания()
	
	// Если расписание не инициализировано в форме на сервере, то создаем новое.
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	// Открываем диалог для редактирования Расписания.
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеРасписанияРегламентногоЗаданияЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРасписанияРегламентногоЗаданияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание <> Неопределено Тогда
		
		РасписаниеРегламентногоЗадания = Расписание;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИзмененияНаСервере()
	Результат = КонвертацияДанныхXDTOСервер.ПолучитьФайлыИзGIT(Объект.Ссылка);
	Если ЗначениеЗаполнено(Результат) И ТипЗнч(Результат) = Тип("Число") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить клонирование ветки из GIT репозитория. Код ошибки:'") + Результат);
	КонецЕсли; 
КонецПроцедуры    


#КонецОбласти
