#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Выполняет автоматическое создание правил конвертации.
// Параметры:
//   Параметры - Структура - Переменные, которые используются при выгрузке.
Процедура СоздатьПравилаКонвертации(Параметры) Экспорт
	Если Параметры.СпособЗагрузки = 0 Тогда
		КонвертацияОбъект = Справочники.Конвертации.СоздатьЭлемент();
		КонвертацияОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XML;
		КонвертацияОбъект.Конфигурация = Параметры.КонфигурацияИсточник;
		КонвертацияОбъект.КонфигурацияКорреспондент = Параметры.КонфигурацияПриемник;
		КонвертацияОбъект.Статус = Перечисления.СостоянияПравил.ВРаботе;
		КонвертацияОбъект.Наименование = СокрЛП(Параметры.КонфигурацияИсточник) + " -> " + СокрЛП(Параметры.КонфигурацияПриемник);
		КонвертацияОбъект.Записать();
		Параметры.Конвертация = КонвертацияОбъект.Ссылка;
	КонецЕсли;
	// Существующие правила.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Правило.Ссылка КАК Правило,
	|	Правило.Наименование КАК ИмяПравила,
	|	ВЫРАЗИТЬ(Правило.ОбъектВыборки КАК Справочник.Объекты) КАК Объект,
	|	ВЫРАЗИТЬ(Правило.ОбъектВыборки КАК Справочник.Объекты).Идентификатор КАК Идентификатор,
	|	ВЫРАЗИТЬ(Правило.ОбъектВыборки КАК Справочник.Объекты).Тип КАК Тип, 
	|	ИСТИНА КАК ЭтоПОД,
	|	ЛОЖЬ КАК ЭтоПКО,
	|	ЛОЖЬ КАК ЭтоПКПД,
	|	ЛОЖЬ КАК Используется
	|ИЗ Справочник.ПравилаОбработкиДанных КАК Правило
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация
	|	И Состав.ЭлементКонвертации = Правило.Ссылка
	|	И Состав.ПометкаУдаления = ЛОЖЬ И Состав.Отключить = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правило.Ссылка,
	|	Правило.Код,
	|	Правило.ОбъектКонфигурации,
	|	Правило.ОбъектКонфигурации.Идентификатор,
	|	Правило.ОбъектКонфигурации.Тип,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ КАК Используется
	|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правило
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация
	|	И Состав.ЭлементКонвертации = Правило.Ссылка
	|	И Состав.ПометкаУдаления = ЛОЖЬ И Состав.Отключить = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правило.Ссылка,
	|	Правило.Код,
	|	Правило.ОбъектКонфигурации,
	|	Правило.ОбъектКонфигурации.Идентификатор,
	|	Правило.ОбъектКонфигурации.Тип,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ЛОЖЬ КАК Используется
	|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правило
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация
	|	И Состав.ЭлементКонвертации = Правило.Ссылка
	|	И Состав.ПометкаУдаления = ЛОЖЬ И Состав.Отключить = ЛОЖЬ
	|";
	Запрос.УстановитьПараметр("Конвертация", Параметры.Конвертация);
	ТаблицаПравил = Запрос.Выполнить().Выгрузить();
	ТаблицаПравил.Индексы.Добавить("Идентификатор");
	
	// Состав плана обмена.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Объекты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РСПодчиненныеРегистратору
	|ИЗ Справочник.Объекты КАК Объекты
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства КАК Свойства
	|ПО Свойства.Владелец = Объекты.Ссылка
	|	И Свойства.Наименование = ""Регистратор""
	|ГДЕ Объекты.Владелец = &КонфигурацияИсточник
	|И Объекты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.РегистрСведений)
	|И Свойства.ПометкаУдаления = ЛОЖЬ
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Объекты.Ссылка КАК ОбъектИсточникСсылка,
	|	Объекты.Имя КАК ИсточникИмя,
	|	Объекты.Тип КАК ИсточникТип,
	|	Объекты.Идентификатор КАК ИсточникИдентификатор,
	|	ОбъектыПриемника.Ссылка КАК ОбъектПриемникСсылка
	|ИЗ Справочник.Свойства КАК Свойства
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК СвойстваТипы
	|ПО Свойства.Ссылка = СвойстваТипы.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК Объекты
	|ПО Объекты.Ссылка = СвойстваТипы.Тип
	|	И Объекты.Владелец = &КонфигурацияИсточник
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОбъектыПриемника
	|ПО ОбъектыПриемника.Идентификатор = Объекты.Идентификатор
	|	И Объекты.Идентификатор <> """"
	|	И ОбъектыПриемника.Владелец = &КонфигурацияПриемник
	|ГДЕ Свойства.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ЭлементСоставаПланаОбмена)
	|	И Свойства.Владелец = &ПланОбмена И Свойства.ПометкаУдаления = ЛОЖЬ
	|	И Объекты.Тип НЕ В (&ИсключаемыеТипы)
	|	И Объекты.Ссылка НЕ В (ВЫБРАТЬ Ссылка ИЗ РСПодчиненныеРегистратору)
	|УПОРЯДОЧИТЬ ПО Объекты.Тип, Объекты.Имя";
	
	Запрос.УстановитьПараметр("ПланОбмена", Параметры.ПланОбмена);
	Запрос.УстановитьПараметр("КонфигурацияИсточник", Параметры.КонфигурацияИсточник);
	Запрос.УстановитьПараметр("КонфигурацияПриемник", Параметры.КонфигурацияПриемник);
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Перечисления.ТипыОбъектов.РегистрБухгалтерии);
	ИсключаемыеТипы.Добавить(Перечисления.ТипыОбъектов.РегистрНакопления);
	ИсключаемыеТипы.Добавить(Перечисления.ТипыОбъектов.РегистрРасчета);
	Запрос.УстановитьПараметр("ИсключаемыеТипы", ИсключаемыеТипы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Порядок = 10;
	Пока Выборка.Следующий() Цикл
		ПОД = Неопределено;
		ПКО = Неопределено;
		ПКПД = Неопределено;
		Если Параметры.СпособЗагрузки > 0 Тогда
			СущПравила = ТаблицаПравил.НайтиСтроки(Новый Структура("Идентификатор", Выборка.ИсточникИдентификатор));
			Для Каждого Правило Из СущПравила Цикл
				Если Правило.ЭтоПОД Тогда
					ПОД = Правило.Правило;
				ИначеЕсли Правило.ЭтоПКО Тогда
					ПКО = Правило.Правило;
				Иначе
					ПКПД = Правило.Правило
				КонецЕсли;
				Правило.Используется = Истина;
			КонецЦикла;
		КонецЕсли;
		// Создание ПКО
		СоздатьПКО(Выборка, ПКО, ТаблицаПравил, Порядок, Параметры);		
		// Создание ПОД
		СоздатьПОД(Выборка, ПОД, ПКО, ТаблицаПравил, Порядок, Параметры);
		
		Порядок = Порядок + 10;
	КонецЦикла;
	// Принудительное добавление ПКС для констант
	ПОД = Неопределено;
	ПКО = Неопределено;
	ПКПД = Неопределено;
	Если Параметры.СпособЗагрузки > 0 Тогда
		СущПравила = ТаблицаПравил.НайтиСтроки(Новый Структура("Идентификатор, Тип", "", Перечисления.ТипыОбъектов.НаборКонстант));
		Для Каждого Правило Из СущПравила Цикл
			Если Правило.ЭтоПОД Тогда
				ПОД = Правило.Правило;
			ИначеЕсли Правило.ЭтоПКО Тогда
				ПКО = Правило.Правило;
			КонецЕсли;
			Правило.Используется = Истина;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеДляПравилаКонстант = Новый Структура("ОбъектИсточникСсылка, ИсточникИмя, ИсточникТип, ОбъектПриемникСсылка");
	ДанныеДляПравилаКонстант.Вставить("ИсточникИдентификатор", "");
	ТекстЗапросаОбъект = "ВЫБРАТЬ ПЕРВЫЕ 1 
	|Ссылка КАК ОбъектСсылка,
	|Имя КАК ОбъектИмя
	|ИЗ Справочник.Объекты
	|ГДЕ Владелец = &Конфигурация И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.НаборКонстант) И НЕ ПометкаУдаления";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОбъект;
	Запрос.УстановитьПараметр("Конфигурация", Параметры.КонфигурацияИсточник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеДляПравилаКонстант.ОбъектИсточникСсылка = Выборка.ОбъектСсылка;
		ДанныеДляПравилаКонстант.ИсточникИмя = Выборка.ОбъектИмя;
 		ДанныеДляПравилаКонстант.ИсточникТип = Перечисления.ТипыОбъектов.НаборКонстант;
	КонецЕсли;
	Запрос.УстановитьПараметр("Конфигурация", Параметры.КонфигурацияПриемник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеДляПравилаКонстант.ОбъектПриемникСсылка = Выборка.ОбъектСсылка;
	КонецЕсли;
	СоздатьПКО(ДанныеДляПравилаКонстант, ПКО, ТаблицаПравил, Порядок, Параметры);		
	СоздатьПОД(ДанныеДляПравилаКонстант, ПОД, ПКО, ТаблицаПравил, Порядок, Параметры);
	
	НайтиСоздатьПравилаДляВидаСубконто(ТаблицаПравил, Порядок, Параметры);
	
	// Создание ПКС после создания всех ПКО
	СоздатьПКС(ТаблицаПравил, Порядок, Параметры);
	
	// Удаление лишних правил.
	Если Параметры.СпособЗагрузки <> 0 Тогда
		стрЛишние = ТаблицаПравил.НайтиСтроки(Новый Структура("Используется", Ложь));
		Для Каждого Стр Из стрЛишние Цикл
			ПравилоОбъект = Стр.Правило.ПолучитьОбъект();
			ПравилоОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура СоздатьПКО(Выборка, ПКО, ТаблицаПравил, Порядок, Параметры)
	Если ПКО = Неопределено Тогда
		ПКООбъект = Справочники.ПравилаКонвертацииОбъектов.СоздатьЭлемент();
		
	Иначе
		ПКООбъект = ПКО.ПолучитьОбъект();
	КонецЕсли;
	ПКООбъект.ИспользоватьДляОтправки = Истина;
	ПКООбъект.ИспользоватьДляПолучения = Ложь;
	ПКООбъект.ОбъектКонфигурации = Выборка.ОбъектИсточникСсылка;
	ПКООбъект.ОбъектКонфигурацииКорреспондент = Выборка.ОбъектПриемникСсылка;
	ПКООбъект.ГруппаПравил = СокрЛП(Выборка.ИсточникТип);
	ПКООбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XML;
	ПКООбъект.Код = ИДПравила(Выборка.ИсточникТип, Выборка.ИсточникИмя);

	Если Выборка.ИсточникТип = Перечисления.ТипыОбъектов.БизнесПроцесс
		Или  Выборка.ИсточникТип = Перечисления.ТипыОбъектов.Документ
		Или Выборка.ИсточникТип = Перечисления.ТипыОбъектов.Задача
		Или Выборка.ИсточникТип = Перечисления.ТипыОбъектов.ПланВидовРасчета
		Или Выборка.ИсточникТип = Перечисления.ТипыОбъектов.ПланСчетов
		Или Выборка.ИсточникТип = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или Выборка.ИсточникТип = Перечисления.ТипыОбъектов.Справочник Тогда
		ПКООбъект.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоУникальномуИдентификатору;
		ПКООбъект.ГенерироватьНовыйНомерИлиКодЕслиНеУказан = Истина;
	Иначе
		ПКООбъект.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоПолямПоиска;
		ПКООбъект.ГенерироватьНовыйНомерИлиКодЕслиНеУказан = Ложь;
	КонецЕсли;
	
	ПКООбъект.Порядок = Порядок; 
	ПКООбъект.НеЗапоминатьВыгруженные = Истина;
	ПКООбъект.Записать();
	Если ПКО = Неопределено Тогда
		ЗаписатьНовоеПравилоВСоставКонвертации(ПКООбъект.Ссылка, Параметры.Конвертация);
		СтрокаПравил = ТаблицаПравил.Добавить();
		СтрокаПравил.Правило = ПКООбъект.Ссылка;
		СтрокаПравил.ИмяПравила = ПКООбъект.Код;
		СтрокаПравил.Идентификатор = Выборка.ИсточникИдентификатор;
		СтрокаПравил.Используется = Истина;
		СтрокаПравил.ЭтоПКО = Истина;
		СтрокаПравил.ЭтоПОД = Ложь;
		СтрокаПравил.ЭтоПКПД = Ложь;
		ПКО = ПКООбъект.Ссылка;
	КонецЕсли;
	// ПРоверка, возможно требуется еще и ПКПД
	Если Выборка.ИсточникТип = Перечисления.ТипыОбъектов.ПланСчетов
		Или Выборка.ИсточникТип = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или Выборка.ИсточникТип = Перечисления.ТипыОбъектов.Справочник Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.Значения
		|ГДЕ Владелец = &ОбъектИсточник";
		Запрос.УстановитьПараметр("ОбъектИсточник", Выборка.ОбъектИсточникСсылка);
        Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			СоздатьПКПД(Выборка.ОбъектИсточникСсылка, Выборка.ИсточникИдентификатор, ТаблицаПравил, Параметры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ИДПравила(Тип, Имя)
	// Укорачиваем тип.
	ТекТип = СтрЗаменить(СокрЛП(Тип), " ", "");
	ТекИмя = СтрЗаменить(СокрЛП(Имя), " ", "");
	Если ТекТип = "Справочник" Тогда
		Префикс = "Спр";
	ИначеЕсли ТекТип = "Документ" Тогда
		Префикс = "Док";
	ИначеЕсли ТекТип = "Бизнеспроцесс" Тогда
		Префикс = "БП";
	ИначеЕсли ТекТип = "Задача" Тогда
		Префикс = "ЗД";
	ИначеЕсли ТекТип = "Планвидоврасчета" Тогда
		Префикс = "ПВР";
	ИначеЕсли ТекТип = "Планвидовхарактеристик" Тогда
		Префикс = "ПВХ";
	ИначеЕсли ТекТип = "Плансчетов" Тогда
		Префикс = "ПС";
	ИначеЕсли ТекТип = "Регистрбухгалтерии" Тогда
		Префикс = "РБ";
	ИначеЕсли ТекТип = "Регистрсведений" Тогда
		Префикс = "РС";
	ИначеЕсли ТекТип = "Регистрнакопления" Тогда
		Префикс = "РН";
	ИначеЕсли ТекТип = "Регистррасчета" Тогда
		Префикс = "РР";
	ИначеЕсли ТекТип = "Перечисление" Тогда
		Префикс = "Пер"; 
	Иначе
		Префикс = ТекТип;
	КонецЕсли;
	ИДПравила = Префикс + "_" + ТекИмя;
	Если СтрДлина(ИДПравила) < 50 Тогда
		Возврат ИДПравила;
	КонецЕсли;
	Постфикс = Лев(ТекИмя, 22) + "_" + Прав(ТекИмя, 22);
	Возврат Префикс + "_" + Постфикс;
КонецФункции

Процедура СоздатьПОД(Выборка, ПОД, ПКО, ТаблицаПравил, Порядок, Параметры)
	Если ПОД = Неопределено Тогда
		ПОДОбъект = Справочники.ПравилаОбработкиДанных.СоздатьЭлемент(); 		
	Иначе
		ПОДОбъект = ПОД.ПолучитьОбъект();
	КонецЕсли;
	ПОДОбъект.ИспользоватьДляОтправки = Истина;
	ПОДОбъект.Наименование = ИДПравила(Выборка.ИсточникТип, Выборка.ИсточникИмя);
	ПОДОбъект.ОбъектВыборки = Выборка.ОбъектИсточникСсылка;
	ПОДОбъект.ПравилоКонвертацииОбъекта = ПКО;
	ПОДОбъект.ГруппаПравил = СокрЛП(Выборка.ИсточникТип);
	ПОДОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XML;
	ПОДОбъект.Порядок = Порядок;
	ПОДОбъект.Записать();
	Если ПОД = Неопределено Тогда
		ЗаписатьНовоеПравилоВСоставКонвертации(ПОДОбъект.Ссылка, Параметры.Конвертация);
		СтрокаПравил = ТаблицаПравил.Добавить();
		СтрокаПравил.Правило = ПОДОбъект.Ссылка;
		СтрокаПравил.ИмяПравила = ПОДОбъект.Наименование;
		СтрокаПравил.Идентификатор = Выборка.ИсточникИдентификатор;
		СтрокаПравил.Используется = Истина;
		СтрокаПравил.ЭтоПКО = Ложь;
		СтрокаПравил.ЭтоПОД = Истина;
		СтрокаПравил.ЭтоПКПД = Ложь;
	КонецЕсли; 
КонецПроцедуры

Процедура СоздатьПКС(ТаблицаПравил, Порядок, Параметры)
	// ПКС к удалению
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Правило.Ссылка КАК ПКО,
	|	Правило.ОбъектКонфигурации КАК Источник,
	|	Правило.ОбъектКонфигурацииКорреспондент КАК Приемник
	|ПОМЕСТИТЬ ТабПКО
	|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правило
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация
	|	И Состав.ЭлементКонвертации = Правило.Ссылка
	|	И Состав.ПометкаУдаления = ЛОЖЬ И Состав.Отключить = ЛОЖЬ
	|;
	|ВЫБРАТЬ
	|	Ссылка,
	|	ЛОЖЬ КАК Используется
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец В (ВЫБРАТЬ ПКО ИЗ ТабПКО) И НЕ ПометкаУдаления
	|;	
	|ВЫБРАТЬ
	|	ПКО,
	|	Источник,
	|	Источник.Тип КАК Тип,
	|	Приемник
	|ИЗ ТабПКО";
	Запрос.УстановитьПараметр("Конвертация", Параметры.Конвертация);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаПКС = РезультатЗапроса[1].Выгрузить();
	
	ВыборкаПКО = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаПКО.Следующий() Цикл
		// 1. реквизиты шапки.
		ЗапросСвойства = Новый Запрос;
		ЗапросСвойства.Текст = "ВЫБРАТЬ
		|	СвойстваИсточника.Ссылка КАК Источник,
		|	СвойстваПриемника.Ссылка КАК Приемник,
		|	Максимум(ВЫРАЗИТЬ(СвойстваИсточника.ТипыСтрокой КАК Строка(150))) КАК ИсточникТип,
		|	Максимум(ВЫРАЗИТЬ(СвойстваПриемника.ТипыСтрокой КАК Строка(150))) КАК ПриемникТип,
		|	Максимум(ПКС.Ссылка) КАК ПКС,
		|	Максимум(ТипыИсточника.Тип) КАК ИсточникКакОбъект,
		|	Максимум(ТипыИсточника.Тип.Идентификатор) КАК ИсточникКакОбъектИД
		|ИЗ Справочник.Свойства КАК СвойстваИсточника
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства КАК СвойстваПриемника
		|ПО (СвойстваИсточника.Идентификатор = СвойстваПриемника.Идентификатор
		|		И СвойстваИсточника.Идентификатор <> """")
		|	ИЛИ (СвойстваИсточника.Наименование = СвойстваПриемника.Наименование
		|		И СвойстваИсточника.Идентификатор = """"
		|		%ДопУсловие2%)
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК ТипыИсточника
		|ПО СвойстваИсточника.Ссылка = ТипыИсточника.Ссылка
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииСвойств КАК ПКС
		|ПО ПКС.СвойствоКонфигурации = СвойстваИсточника.Ссылка
		|	И ПКС.СвойствоКонфигурацииКорреспондента = СвойстваПриемника.Ссылка
		|	И ПКС.ЭтоГруппа = ЛОЖЬ
		|	И ПКС.Владелец = &ПКО
		|ГДЕ СвойстваИсточника.Владелец = &ОбъектКонфигурацииИсточник
		|	И  СвойстваПриемника.Владелец = &ОбъектКонфигурацииПриемник
		|	И СвойстваИсточника.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
		|	И СвойстваПриемника.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
		|	И СвойстваИсточника.ЭтоГруппа = ЛОЖЬ И СвойстваПриемника.ЭтоГруппа = ЛОЖЬ
		|	И СвойстваИсточника.ПометкаУдаления = ЛОЖЬ И СвойстваПриемника.ПометкаУдаления = ЛОЖЬ
		|	%ДопУсловие1%
		|	И СвойстваИсточника.Наименование <> ""Предопределенный""
		|СГРУППИРОВАТЬ ПО СвойстваИсточника.Ссылка, СвойстваПриемника.Ссылка";
		ЗапросСвойства.УстановитьПараметр("ОбъектКонфигурацииИсточник", ВыборкаПКО.Источник);
		ЗапросСвойства.УстановитьПараметр("ОбъектКонфигурацииПриемник", ВыборкаПКО.Приемник);
		ЗапросСвойства.УстановитьПараметр("ПКО", ВыборкаПКО.ПКО);
		// Для всех объектов кроме регистров доп условие - ПКС только для реквизитов.
		ТипОбъекта = ВыборкаПКО.Тип;
		ЭтоРегистр = ТипОбъекта = Перечисления.ТипыОбъектов.РегистрБухгалтерии
			Или ТипОбъекта = Перечисления.ТипыОбъектов.РегистрНакопления
			Или ТипОбъекта = Перечисления.ТипыОбъектов.РегистрРасчета
			Или ТипОбъекта = Перечисления.ТипыОбъектов.РегистрСведений;
		ПредопределенныеСвойства = ИменаПредопределенныхСвойств(ТипОбъекта);
		// Для планов счетов исключаем "Количественный", "Суммовой", "Валютный" (не выгружаются) 
		ИсключаемыеСвойства = ИменаИсключаемыхСвойств(ТипОбъекта);
		ЗапросСвойства.УстановитьПараметр("ПредопределенныеСвойства", ПредопределенныеСвойства);

		ДопУсловие1 = "";
		ДопУсловие2 = "";
		Если НЕ ЭтоРегистр Тогда
			ДопУсловие1 = "И (СвойстваИсточника.Идентификатор <> """" ИЛИ (СвойстваИсточника.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Реквизит) ИЛИ СвойстваИсточника.Наименование В (&ПредопределенныеСвойства)))";
			ДопУсловие2 = "И (СвойстваПриемника.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Реквизит) ИЛИ СвойстваИсточника.Наименование В (&ПредопределенныеСвойства))";
		КонецЕсли;
		ЗапросСвойства.Текст = СтрЗаменить(ЗапросСвойства.Текст, "%ДопУсловие1%", ДопУсловие1);
		ЗапросСвойства.Текст = СтрЗаменить(ЗапросСвойства.Текст, "%ДопУсловие2%", ДопУсловие2);
		ВыборкаСвойство = ЗапросСвойства.Выполнить().Выбрать();
		Пока ВыборкаСвойство.Следующий() Цикл
			Если ИсключаемыеСвойства.Найти(СокрЛП(ВыборкаСвойство.Источник)) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаСвойство.ПКС) Тогда
				ПКСОбъект = ВыборкаСвойство.ПКС.ПолучитьОбъект();
				СтрокиПравил = ТаблицаПКС.НайтиСтроки(Новый Структура("Ссылка", ВыборкаСвойство.ПКС));
				Если СтрокиПравил.Количество() > 0 Тогда
					СтрокиПравил[0].Используется = Истина;
				КонецЕсли;
			Иначе
				ПКСОбъект = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
				ПКСОбъект.Владелец = ВыборкаПКО.ПКО;
				ПКСОбъект.СвойствоКонфигурации = ВыборкаСвойство.Источник;
				ПКСОбъект.СвойствоКонфигурацииКорреспондента = ВыборкаСвойство.Приемник;
			КонецЕсли;
			ПКСОбъект.Наименование = "" + СокрЛП(ВыборкаСвойство.Источник) + " --> " + СокрЛП(ВыборкаСвойство.Приемник);
			ПКСОбъект.ТипСвойстваКонфигурации = ВыборкаСвойство.ИсточникТип;
			ПКСОбъект.ТипСвойстваКонфигурацииКорреспондента = ВыборкаСвойство.ПриемникТип;
			ПКСОбъект.ПолноеИмяСвойстваКонфигурации = СокрЛП(ВыборкаСвойство.Источник);
			ПКСОбъект.ПолноеИмяСвойстваКонфигурацииКорреспондента = СокрЛП(ВыборкаСвойство.Приемник);
			Если ЗначениеЗаполнено(ВыборкаСвойство.ИсточникКакОбъектИД) Тогда
				Если СтрНайти(ВыборкаСвойство.ИсточникТип, ",") > 0 Или СтрНайти(ВыборкаСвойство.ПриемникТип, ",") > 0 Тогда
					// Множественный тип источника и приемника, не надо прописывать ПКО.
					ПКСОбъект.ПравилоКонвертацииСвойства = "";
					ПКОДляПКСМножественныйТип(ВыборкаСвойство.Источник, ВыборкаСвойство.Приемник, ТаблицаПравил, Порядок, Параметры);
				Иначе
					ПКСОбъект.ПравилоКонвертацииСвойства = ПКОДляПКС(ВыборкаСвойство.Источник, ВыборкаСвойство.Приемник, ВыборкаСвойство.ИсточникКакОбъект, ВыборкаСвойство.ИсточникКакОбъектИД, ТаблицаПравил, Порядок, Параметры);
				КонецЕсли;
			Иначе
				ПКСОбъект.ПравилоКонвертацииСвойства = "";
			КонецЕсли;
			ПКСОбъект.Записать();
		КонецЦикла;
		
		// 3. Табличные части и их свойства.
		ОбрабатыватьДвижения = Параметры.СоздаватьПравилаДляДвиженийДокументов И (ВыборкаПКО.Тип = Перечисления.ТипыОбъектов.Документ);
		ОбъектСДвижениями = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаПКО.ПКО, "ОбъектСДвижениями");
		ОбъектСДвижениямиНовый = ОбъектСДвижениями;
		Если НЕ ОбрабатыватьДвижения Тогда
			ОбъектСДвижениямиНовый = Ложь;
		КонецЕсли;
		
		ЗапросСвойства = Новый Запрос;
		ЗапросСвойства.Текст = "ВЫБРАТЬ
		|	СвойстваИсточника.Ссылка КАК Источник,
		|	СвойстваПриемника.Ссылка КАК Приемник,
		|	СвойстваИсточника.Вид КАК ВидТЧ,
		|	Максимум(ВЫРАЗИТЬ(СвойстваИсточника.ТипыСтрокой КАК Строка(150))) КАК ИсточникТип,
		|	Максимум(ВЫРАЗИТЬ(СвойстваПриемника.ТипыСтрокой КАК Строка(150))) КАК ПриемникТип,
		|	Максимум(ПКС.Ссылка) КАК ПКС
		|ИЗ Справочник.Свойства КАК СвойстваИсточника
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства КАК СвойстваПриемника
		|ПО СвойстваИсточника.Наименование = СвойстваПриемника.Наименование
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииСвойств КАК ПКС
		|ПО ПКС.СвойствоКонфигурации = СвойстваИсточника.Ссылка
		|	И ПКС.СвойствоКонфигурацииКорреспондента = СвойстваПриемника.Ссылка
		|	И ПКС.ЭтоГруппа = ИСТИНА
		|	И ПКС.Владелец = &ПКО
		|ГДЕ СвойстваИсточника.Владелец = &ОбъектКонфигурацииИсточник
		|	И  СвойстваПриемника.Владелец = &ОбъектКонфигурацииПриемник
		|	И СвойстваИсточника.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
		|	И СвойстваПриемника.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
		|	И СвойстваИсточника.ЭтоГруппа = ИСТИНА И СвойстваПриемника.ЭтоГруппа = ИСТИНА
		|	И (СвойстваИсточника.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть)
		|		ИЛИ (&ОбрабатыватьДвижения И СвойстваИсточника.Вид В (&НаборыДвижений)))
		|	И СвойстваИсточника.ПометкаУдаления = ЛОЖЬ И СвойстваПриемника.ПометкаУдаления = ЛОЖЬ
		|СГРУППИРОВАТЬ ПО СвойстваИсточника.Ссылка, СвойстваПриемника.Ссылка, СвойстваИсточника.Вид";
		ЗапросСвойства.УстановитьПараметр("ОбъектКонфигурацииИсточник", ВыборкаПКО.Источник);
		ЗапросСвойства.УстановитьПараметр("ОбъектКонфигурацииПриемник", ВыборкаПКО.Приемник);
		ЗапросСвойства.УстановитьПараметр("ПКО", ВыборкаПКО.ПКО);
		ЗапросСвойства.УстановитьПараметр("ОбрабатыватьДвижения", ОбрабатыватьДвижения);
		НаборДвиженийВид = Новый Массив;
		НаборДвиженийВид.Добавить(Перечисления.ВидыСвойств.НаборДвиженийРегистраБухгалтерии);
		НаборДвиженийВид.Добавить(Перечисления.ВидыСвойств.НаборДвиженийРегистраНакопления);
		НаборДвиженийВид.Добавить(Перечисления.ВидыСвойств.НаборДвиженийРегистраРасчета);
		НаборДвиженийВид.Добавить(Перечисления.ВидыСвойств.НаборДвиженийРегистраСведений);
		ЗапросСвойства.УстановитьПараметр("НаборыДвижений", НаборДвиженийВид);
		
		ТекстЗапросаСвойстваТЧ = "ВЫБРАТЬ
		|	СвойстваИсточника.Ссылка КАК Источник,
		|	СвойстваПриемника.Ссылка КАК Приемник,
		|	Максимум(ВЫРАЗИТЬ(СвойстваИсточника.ТипыСтрокой КАК Строка(150))) КАК ИсточникТип,
		|	Максимум(ВЫРАЗИТЬ(СвойстваПриемника.ТипыСтрокой КАК Строка(150))) КАК ПриемникТип,
		|	Максимум(ПКС.Ссылка) КАК ПКС,
		|	Максимум(ТипыИсточника.Тип) КАК ИсточникКакОбъект,
		|	Максимум(ТипыИсточника.Тип.Идентификатор) КАК ИсточникКакОбъектИД
		|ИЗ Справочник.Свойства КАК СвойстваИсточника
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства КАК СвойстваПриемника
		|ПО %1%
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК ТипыИсточника
		|ПО СвойстваИсточника.Ссылка = ТипыИсточника.Ссылка
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииСвойств КАК ПКС
		|ПО ПКС.СвойствоКонфигурации = СвойстваИсточника.Ссылка
		|	И ПКС.СвойствоКонфигурацииКорреспондента = СвойстваПриемника.Ссылка
		|	И ПКС.ЭтоГруппа = ЛОЖЬ И ПКС.Владелец = &ПКО
		|ГДЕ СвойстваИсточника.Владелец = &ОбъектКонфигурацииИсточник
		|	И  СвойстваПриемника.Владелец = &ОбъектКонфигурацииПриемник
		|	И СвойстваИсточника.Родитель = &ИсточникРодитель
		|	И СвойстваПриемника.Родитель = &ПриемникРодитель
		|	И СвойстваИсточника.ЭтоГруппа = ЛОЖЬ И СвойстваПриемника.ЭтоГруппа = ЛОЖЬ
		|	И СвойстваИсточника.ПометкаУдаления = ЛОЖЬ И СвойстваПриемника.ПометкаУдаления = ЛОЖЬ
		|СГРУППИРОВАТЬ ПО СвойстваИсточника.Ссылка, СвойстваПриемника.Ссылка";
		
	
		ВыборкаСвойство = ЗапросСвойства.Выполнить().Выбрать();
		Пока ВыборкаСвойство.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаСвойство.ПКС) Тогда
				ПКСОбъект = ВыборкаСвойство.ПКС.ПолучитьОбъект();
				СтрокиПравил = ТаблицаПКС.НайтиСтроки(Новый Структура("Ссылка", ВыборкаСвойство.ПКС));
				Если СтрокиПравил.Количество() > 0 Тогда
					СтрокиПравил[0].Используется = Истина;
				КонецЕсли;
			Иначе
				ПКСОбъект = Справочники.ПравилаКонвертацииСвойств.СоздатьГруппу();
				ПКСОбъект.Владелец = ВыборкаПКО.ПКО;
				ПКСОбъект.СвойствоКонфигурации = ВыборкаСвойство.Источник;
				ПКСОбъект.СвойствоКонфигурацииКорреспондента = ВыборкаСвойство.Приемник;
			КонецЕсли;
			ПКСОбъект.Наименование = "" + СокрЛП(ВыборкаСвойство.Источник) + " --> " + СокрЛП(ВыборкаСвойство.Приемник);
			ПКСОбъект.ТипСвойстваКонфигурации = ВыборкаСвойство.ИсточникТип;
			ПКСОбъект.ТипСвойстваКонфигурацииКорреспондента = ВыборкаСвойство.ПриемникТип;
			ПКСОбъект.Записать();
			
			Если ОбрабатыватьДвижения И НЕ ОбъектСДвижениямиНовый И НаборДвиженийВид.Найти(ВыборкаСвойство.ВидТЧ) <> Неопределено Тогда
				ОбъектСДвижениямиНовый = Истина;
			КонецЕсли;
			
			ЗапросСвойстваТЧ = Новый Запрос;
			Если ВыборкаСвойство.ВидТЧ = Перечисления.ВидыСвойств.ТабличнаяЧасть Тогда
				ЗапросСвойстваТЧ.Текст = СтрЗаменить(ТекстЗапросаСвойстваТЧ, "%1%", "(СвойстваИсточника.Идентификатор = СвойстваПриемника.Идентификатор)
				|	ИЛИ (СвойстваИсточника.Идентификатор = """" И СвойстваИсточника.Наименование = СвойстваПриемника.Наименование
				|		И СвойстваИсточника.Владелец.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовРасчета))");
			ИначеЕсли НаборДвиженийВид.Найти(ВыборкаСвойство.ВидТЧ) Тогда
				ЗапросСвойстваТЧ.Текст = СтрЗаменить(ТекстЗапросаСвойстваТЧ, "%1%", "(СвойстваИсточника.Идентификатор = СвойстваПриемника.Идентификатор
				|		И СвойстваИсточника.Идентификатор <> """")
				|	ИЛИ (СвойстваИсточника.Идентификатор = """" И СвойстваИсточника.Наименование = СвойстваПриемника.Наименование
				|		)");
				
			Иначе
				ЗапросСвойстваТЧ.Текст = СтрЗаменить(ТекстЗапросаСвойстваТЧ, "%1%", "СвойстваИсточника.Наименование = СвойстваПриемника.Наименование");
			КонецЕсли;
			ЗапросСвойстваТЧ.УстановитьПараметр("ОбъектКонфигурацииИсточник", ВыборкаПКО.Источник);
			ЗапросСвойстваТЧ.УстановитьПараметр("ОбъектКонфигурацииПриемник", ВыборкаПКО.Приемник);
			ЗапросСвойстваТЧ.УстановитьПараметр("ПКО", ВыборкаПКО.ПКО);
			ЗапросСвойстваТЧ.УстановитьПараметр("ИсточникРодитель", ВыборкаСвойство.Источник);
			ЗапросСвойстваТЧ.УстановитьПараметр("ПриемникРодитель", ВыборкаСвойство.Приемник);
			ВыборкаСвойствоТЧ = ЗапросСвойстваТЧ.Выполнить().Выбрать();
			Пока  ВыборкаСвойствоТЧ.Следующий() Цикл
				ИмяСвойстваДляСравнения = НРег(СокрЛП(ВыборкаСвойствоТЧ.Источник));
				Если ВыборкаСвойство.ВидТЧ = Перечисления.ВидыСвойств.НаборДвиженийРегистраРасчета Тогда
					Если 
					(ИмяСвойстваДляСравнения = "периоддействия" 
					Или ИмяСвойстваДляСравнения = "фактическийпериоддействия") Тогда
						// Это свойства не доступны для записи.
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСвойствоТЧ.ПКС) Тогда
					ПКСТЧОбъект = ВыборкаСвойствоТЧ.ПКС.ПолучитьОбъект();
					СтрокиПравил = ТаблицаПКС.НайтиСтроки(Новый Структура("Ссылка", ВыборкаСвойствоТЧ.ПКС));
					Если СтрокиПравил.Количество() > 0 Тогда
						СтрокиПравил[0].Используется = Истина;
					КонецЕсли;
				Иначе
					ПКСТЧОбъект = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
					ПКСТЧОбъект.Владелец = ВыборкаПКО.ПКО;
					ПКСТЧОбъект.СвойствоКонфигурации = ВыборкаСвойствоТЧ.Источник;
					ПКСТЧОбъект.СвойствоКонфигурацииКорреспондента = ВыборкаСвойствоТЧ.Приемник;
				КонецЕсли;
				ПКСТЧОбъект.Родитель = ПКСОбъект.Ссылка;
				ПКСТЧОбъект.Наименование = "" + СокрЛП(ВыборкаСвойствоТЧ.Источник) + " --> " + СокрЛП(ВыборкаСвойствоТЧ.Приемник);
				ПКСТЧОбъект.ТипСвойстваКонфигурации = ВыборкаСвойствоТЧ.ИсточникТип;
				ПКСТЧОбъект.ТипСвойстваКонфигурацииКорреспондента = ВыборкаСвойствоТЧ.ПриемникТип;
				ПКСТЧОбъект.ПолноеИмяСвойстваКонфигурации = СокрЛП(ВыборкаСвойство.Источник) + "." + СокрЛП(ВыборкаСвойствоТЧ.Источник);
				ПКСТЧОбъект.ПолноеИмяСвойстваКонфигурацииКорреспондента = СокрЛП(ВыборкаСвойство.Приемник) + "." + СокрЛП(ВыборкаСвойствоТЧ.Приемник); 
				Если СокрЛП(ВыборкаСвойствоТЧ.Источник) = "СубконтоДт" Или СокрЛП(ВыборкаСвойствоТЧ.Источник) = "СубконтоКт" Тогда
					ПКСТЧОбъект.АлгоритмПриВыгрузкеСвойства = "Выполнить(Алгоритмы.ОпределитьИмяПКОВидСубконто);"; 
                КонецЕсли;
				Если СокрЛП(ВыборкаСвойствоТЧ.Источник) = "Регистратор" Тогда
					ПКСТЧОбъект.ПравилоКонвертацииСвойства = СокрЛП(ВыборкаПКО.ПКО);
					ПКСТЧОбъект.ТипСвойстваКонфигурации = СокрЛП(ВыборкаПКО.Источник);
					ПКСТЧОбъект.ТипСвойстваКонфигурацииКорреспондента = СокрЛП(ВыборкаПКО.Приемник);
				ИначеЕсли ЗначениеЗаполнено(ВыборкаСвойствоТЧ.ИсточникКакОбъектИД) Тогда
					Если СтрНайти(ВыборкаСвойствоТЧ.ИсточникТип, ",") > 0 Или СтрНайти(ВыборкаСвойствоТЧ.ПриемникТип, ",") > 0 Тогда
						// Множественный тип источника и приемника, не надо прописывать ПКО.
						ПКСТЧОбъект.ПравилоКонвертацииСвойства = "";
						ПКОДляПКСМножественныйТип(ВыборкаСвойствоТЧ.Источник, ВыборкаСвойствоТЧ.Приемник, ТаблицаПравил, Порядок, Параметры);
					Иначе
						ПКСТЧОбъект.ПравилоКонвертацииСвойства = ПКОДляПКС(ВыборкаСвойствоТЧ.Источник, ВыборкаСвойствоТЧ.Приемник, ВыборкаСвойствоТЧ.ИсточникКакОбъект, ВыборкаСвойствоТЧ.ИсточникКакОбъектИД, ТаблицаПравил, Порядок, Параметры);
					КонецЕсли;
				Иначе
					ПКСТЧОбъект.ПравилоКонвертацииСвойства = "";
				КонецЕсли;
				ПКСТЧОбъект.Записать();
			КонецЦикла;
		КонецЦикла;
		// Корректировка флага ОбъектСДвижениями для ПКО
		Если ОбъектСДвижениями <> ОбъектСДвижениямиНовый Тогда
			ПКООбъект = ВыборкаПКО.ПКО.ПолучитьОбъект();
			ПКООбъект.ОбъектСДвижениями = ОбъектСДвижениямиНовый;
			ПКООбъект.Записать();
		КонецЕсли;
	КонецЦикла; //Пока ВыборкаПКО.Следующий() Цикл

	
	Для Каждого Строка Из ТаблицаПКС Цикл
		Если НЕ Строка.Используется Тогда
			ПКСОбъект = Строка.Ссылка.ПолучитьОбъект();
			ПКСОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПКОДляПКС(СвойствоИсточник, СвойствоПриемник, ОбъектИсточник, ОбъектИсточникИД, ТаблицаПравил, Порядок, Параметры)
	СтрокиПравил = ТаблицаПравил.НайтиСтроки(Новый Структура("Идентификатор, ЭтоПКО", ОбъектИсточникИД, Истина));
	Если СтрокиПравил.Количество() > 0 Тогда
		СтрокиПравил[0].Используется = Истина;
		Возврат СтрокиПравил[0].ИмяПравила;
	КонецЕсли;
	СтрокиПравил = ТаблицаПравил.НайтиСтроки(Новый Структура("Идентификатор, ЭтоПКПД", ОбъектИсточникИД, Истина));
	Если СтрокиПравил.Количество() > 0 Тогда
		СтрокиПравил[0].Используется = Истина;
		Возврат СтрокиПравил[0].ИмяПравила;
	КонецЕсли;
	ТипОбъектаИсточника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектИсточник, "Тип");
	Если ТипОбъектаИсточника = Перечисления.ТипыОбъектов.Перечисление Тогда
		Возврат СоздатьПКПД(ОбъектИсточник, ОбъектИсточникИД, ТаблицаПравил, Параметры);
	КонецЕсли;
	
	// Создание ПКС для объекта который не входит в план обмена
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	Объекты.Ссылка КАК ОбъектИсточникСсылка,
	|	Объекты.Имя КАК ИсточникИмя,
	|	Объекты.Тип КАК ИсточникТип,
	|	Объекты.Идентификатор КАК ИсточникИдентификатор,
	|	ОбъектыПриемника.Ссылка КАК ОбъектПриемникСсылка
	|ИЗ Справочник.Объекты КАК Объекты
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОбъектыПриемника
	|ПО ОбъектыПриемника.Идентификатор = Объекты.Идентификатор
	|	И ОбъектыПриемника.Владелец = &КонфигурацияПриемник
	|	И ОбъектыПриемника.Идентификатор <> """"
	|ГДЕ Объекты.Ссылка = &ОбъектИсточник
	|";
	Запрос.УстановитьПараметр("КонфигурацияПриемник", Параметры.КонфигурацияПриемник);
	Запрос.УстановитьПараметр("ОбъектИсточник", ОбъектИсточник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПКО = Неопределено;
		СоздатьПКО(Выборка, ПКО, ТаблицаПравил, Порядок, Параметры);
		
		Порядок = Порядок + 10;
		Возврат ПКО.Код;
	КонецЕсли;
	Возврат "";
КонецФункции

Процедура ПКОДляПКСМножественныйТип(СвойствоИсточник, СвойствоПриемник, ТаблицаПравил, Порядок, Параметры)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвойстваИсточник.Тип КАК ИсточникТип,
	|	СвойстваПриемник.Тип КАК ПриемникТип,
	|	СвойстваИсточник.Тип.Идентификатор КАК ИдОбъекта,
	|	СвойстваИсточник.Тип.Тип КАК ТипОбъекта,
	|	СвойстваИсточник.Тип.Имя КАК ИмяОбъекта
	|ИЗ Справочник.Свойства.Типы КАК СвойстваИсточник
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Свойства.Типы КАК СвойстваПриемник
	|ПО СвойстваИсточник.Ссылка = &СвойствоИсточник
	|	И СвойстваПриемник.Ссылка = &СвойствоПриемник
	|	И СвойстваИсточник.Тип.Идентификатор = СвойстваПриемник.Тип.Идентификатор
	|";
	Запрос.УстановитьПараметр("СвойствоИсточник", СвойствоИсточник);
	Запрос.УстановитьПараметр("СвойствоПриемник", СвойствоПриемник);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.ИДОбъекта) Тогда
			// Это объект - простой тип, правила не нужны.
			Продолжить;
		КонецЕсли;
		ЭтоПКО = ?(Выборка.ТипОбъекта <> Перечисления.ТипыОбъектов.Перечисление, Истина, Ложь);
		СтрПоиска = Новый Структура("Идентификатор", Выборка.ИДОбъекта);
		Если ЭтоПКО Тогда
			СтрПоиска.Вставить("ЭтоПКО", Истина);
		Иначе
			СтрПоиска.Вставить("ЭтоПКПД", Истина);
		КонецЕсли;
		СтрокиПравил = ТаблицаПравил.НайтиСтроки(СтрПоиска);
		Если СтрокиПравил.Количество() > 0 Тогда
			СтрокиПравил[0].Используется = Истина;
			Продолжить;
		КонецЕсли;
		// Правила нет.
		Если НЕ ЭтоПКО Тогда
			СоздатьПКПД(Выборка.ИсточникТип, Выборка.ИДОбъекта, ТаблицаПравил, Параметры);
			Продолжить;
		КонецЕсли;
		ПКО = Неопределено;
		ПараметрыПКО = Новый Структура("ОбъектИсточникСсылка, ИсточникИмя, ИсточникТип, ИсточникИдентификатор, ОбъектПриемникСсылка", 
			Выборка.ИсточникТип, Выборка.ИмяОбъекта, Выборка.ТипОбъекта, Выборка.ИДОбъекта, Выборка.ПриемникТип);
		СоздатьПКО(ПараметрыПКО, ПКО, ТаблицаПравил, Порядок, Параметры);
		
		Порядок = Порядок + 10;

	КонецЦикла;
КонецПроцедуры

Функция СоздатьПКПД(ОбъектИсточник, ОбъектИсточникИД, ТаблицаПравил, Параметры)
	ЗапросПриемник = Новый Запрос;
	ЗапросПриемник.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка,
	|	Тип,
	|	Имя
	|ИЗ Справочник.Объекты
	|ГДЕ Владелец = &КонфигурацияПриемник И Идентификатор = &ИД 
	|И (Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Перечисление) 
	|	ИЛИ Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик) 
	|	ИЛИ Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Справочник)
	|	ИЛИ Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланСчетов)
	|	)";
	ЗапросПриемник.УстановитьПараметр("КонфигурацияПриемник", Параметры.КонфигурацияПриемник);
	ЗапросПриемник.УстановитьПараметр("ИД", ОбъектИсточникИД);
	ВыборкаПриемник = ЗапросПриемник.Выполнить().Выбрать();
	Если ВыборкаПриемник.Следующий() Тогда
		ОбъектПриемник = ВыборкаПриемник.Ссылка;
	Иначе
		Возврат "";
	КонецЕсли;  
	ПКПД = Неопределено;
	Если Параметры.СпособЗагрузки > 0 Тогда
		СущПравила = ТаблицаПравил.НайтиСтроки(Новый Структура("Идентификатор", ОбъектИсточникИД));
		Для Каждого Правило Из СущПравила Цикл
			Если Правило.ЭтоПОД Или Правило.ЭтоПКО Тогда
				Продолжить;
			Иначе
				ПКПД = Правило.Правило
			КонецЕсли;
			Правило.Используется = Истина;
		КонецЦикла;
    КонецЕсли;
	Если ПКПД <> Неопределено Тогда
		ПКПДОбъект = ПКПД.ПолучитьОбъект(); 
		ПКПДОбъект.СопоставлениеЗначений.Очистить();
	Иначе
		ПКПДОбъект = Справочники.ПравилаКонвертацииПредопределенныхДанных.СоздатьЭлемент();
	КонецЕсли;
	ПКПДОбъект.Код = ИДПравила(ВыборкаПриемник.Тип, ВыборкаПриемник.Имя);
	ПКПДОбъект.ОбъектКонфигурации = ОбъектИсточник;
	ПКПДОбъект.ОбъектКонфигурацииКорреспондент = ВыборкаПриемник.Ссылка;
	ПКПДОбъект.ИспользоватьДляОтправки = Истина;
	ПКПДОбъект.ГруппаПравил = СокрЛП(ВыборкаПриемник.Тип);
	ПКПДОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XML;
	
	ЗапросПКЗ = Новый Запрос;
	ЗапросПКЗ.Текст = "ВЫБРАТЬ
	|ЗначенияИсточник.Наименование КАК ЗначениеКонфигурации,
	|ЗначенияИсточник.Идентификатор КАК ИДЗначение,
	|ЗначенияПриемник.Наименование КАК ЗначениеКонфигурацииКорреспондент
	|ИЗ Справочник.Значения КАК ЗначенияИсточник
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Значения КАК ЗначенияПриемник
	// сопоставление по УИД если он задан
	// либо по Наименованию если УИД не задан
	|ПО (ЗначенияИсточник.Идентификатор = ЗначенияПриемник.Идентификатор
	|	И ЗначенияИсточник.Идентификатор <> """")
	|	ИЛИ (ЗначенияИсточник.Наименование = ЗначенияПриемник.Наименование 
	|		И ЗначенияИсточник.Идентификатор = """")
	|ГДЕ ЗначенияИсточник.Владелец = &ОбъектИсточник
	|	И ЗначенияПриемник.Владелец = &ОбъектПриемник";
	ЗапросПКЗ.УстановитьПараметр("ОбъектИсточник", ОбъектИсточник);
	ЗапросПКЗ.УстановитьПараметр("ОбъектПриемник", ВыборкаПриемник.Ссылка);
	ВыборкаЗначения = ЗапросПКЗ.Выполнить().Выбрать();
	Пока ВыборкаЗначения.Следующий() Цикл
		СтрЗнач = ПКПДОбъект.СопоставлениеЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрЗнач, ВыборкаЗначения);
	КонецЦикла;
	ПКПДОбъект.Записать();
	Если ПКПД = Неопределено Тогда
		ЗаписатьНовоеПравилоВСоставКонвертации(ПКПДОбъект.Ссылка, Параметры.Конвертация);
		СтрокаПравил = ТаблицаПравил.Добавить();
		СтрокаПравил.Правило = ПКПДОбъект.Ссылка;
		СтрокаПравил.ИмяПравила = ПКПДОбъект.Код;
		СтрокаПравил.Идентификатор = ОбъектИсточникИД;
		СтрокаПравил.Используется = Истина;
		СтрокаПравил.ЭтоПКО = Ложь;
		СтрокаПравил.ЭтоПОД = Ложь;
		СтрокаПравил.ЭтоПКПД = Истина;
	КонецЕсли;
	Возврат ПКПДОбъект.Код; 	
КонецФункции

Процедура ЗаписатьНовоеПравилоВСоставКонвертации(ПравилоСсылка, Конвертация)
	СправочникОбъект = Справочники.СоставыКонвертаций.СоздатьЭлемент();
	СправочникОбъект.Владелец = Конвертация;
	СправочникОбъект.ЭлементКонвертации = ПравилоСсылка;
	СправочникОбъект.Записать();

КонецПроцедуры

Функция ИменаПредопределенныхСвойств(ТипОбъекта)
	ПредопределенныеСвойства = Новый Массив;
	Если ТипОбъекта = Перечисления.ТипыОбъектов.РегистрБухгалтерии
		Или ТипОбъекта = Перечисления.ТипыОбъектов.РегистрНакопления 
		Или ТипОбъекта = Перечисления.ТипыОбъектов.РегистрРасчета
		Или ТипОбъекта = Перечисления.ТипыОбъектов.РегистрСведений Тогда
		ПредопределенныеСвойства.Добавить("Регистратор");
		ПредопределенныеСвойства.Добавить("Активность");
		ПредопределенныеСвойства.Добавить("Период");
		Если ТипОбъекта = Перечисления.ТипыОбъектов.РегистрБухгалтерии Тогда
			ПредопределенныеСвойства.Добавить("СчетДт");
			ПредопределенныеСвойства.Добавить("СчетКт");
			ПредопределенныеСвойства.Добавить("Счет");
			ПредопределенныеСвойства.Добавить("СубконтоДт");
			ПредопределенныеСвойства.Добавить("СубконтоКт");
			ПредопределенныеСвойства.Добавить("Субконто");
		ИначеЕсли  ТипОбъекта = Перечисления.ТипыОбъектов.РегистрНакопления Тогда
			ПредопределенныеСвойства.Добавить("ВидДвижения");
		ИначеЕсли  ТипОбъекта = Перечисления.ТипыОбъектов.РегистрРасчета Тогда
			ПредопределенныеСвойства.Добавить("ПериодРегистрации");
			ПредопределенныеСвойства.Добавить("Сторно");
			ПредопределенныеСвойства.Добавить("ВидРасчета");
			ПредопределенныеСвойства.Добавить("ПериодДействия");
			ПредопределенныеСвойства.Добавить("ПериодДействияНачало");
			ПредопределенныеСвойства.Добавить("ПериодДействияКонец");
			ПредопределенныеСвойства.Добавить("ВидРасчета");
			ПредопределенныеСвойства.Добавить("БазовыйПериодНачало");
			ПредопределенныеСвойства.Добавить("БазовыйПериодКонец");
		КонецЕсли;
	Иначе
		ПредопределенныеСвойства.Добавить("ПометкаУдаления");
	КонецЕсли;
	Если ТипОбъекта = Перечисления.ТипыОбъектов.Справочник 
		Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов
		Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета Тогда
		ПредопределенныеСвойства.Добавить("Код");
		ПредопределенныеСвойства.Добавить("Наименование");
		ПредопределенныеСвойства.Добавить("Предопределенный");
		ПредопределенныеСвойства.Добавить("ИмяПредопределенныхДанных");
		Если ТипОбъекта <> Перечисления.ТипыОбъектов.ПланВидовРасчета Тогда
			ПредопределенныеСвойства.Добавить("ЭтоГруппа");
			ПредопределенныеСвойства.Добавить("Родитель");
		КонецЕсли;
		Если ТипОбъекта = Перечисления.ТипыОбъектов.Справочник Тогда
			ПредопределенныеСвойства.Добавить("Владелец");
		ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик Тогда
			ПредопределенныеСвойства.Добавить("ТипЗначения");
		ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов Тогда
			ПредопределенныеСвойства.Добавить("Порядок");
			ПредопределенныеСвойства.Добавить("Вид");
			ПредопределенныеСвойства.Добавить("Забалансовый");
		ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета Тогда
			ПредопределенныеСвойства.Добавить("ПериодДействияБазовый");
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Документ Тогда
		ПредопределенныеСвойства.Добавить("Номер");
		ПредопределенныеСвойства.Добавить("Дата");
		ПредопределенныеСвойства.Добавить("Проведен");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.БизнесПроцесс Тогда
		ПредопределенныеСвойства.Добавить("Стартован");
		ПредопределенныеСвойства.Добавить("Завершен");
		ПредопределенныеСвойства.Добавить("ВедущаяЗадача");
		ПредопределенныеСвойства.Добавить("Дата"); 
		ПредопределенныеСвойства.Добавить("Номер");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Задача Тогда
		ПредопределенныеСвойства.Добавить("Дата");
		ПредопределенныеСвойства.Добавить("Выполнена");
		ПредопределенныеСвойства.Добавить("Номер");
		ПредопределенныеСвойства.Добавить("Наименование");
		ПредопределенныеСвойства.Добавить("БизнесПроцесс");
	КонецЕсли;
	Возврат ПредопределенныеСвойства;
КонецФункции

Функция ИменаИсключаемыхСвойств(ТипОбъекта)
	ИменаИскл = Новый Массив;
	Если ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов Тогда
		ИменаИскл.Добавить("Валютный");
		ИменаИскл.Добавить("Количественный");
        ИменаИскл.Добавить("Суммовой"); 
	КонецЕсли;
	Возврат ИменаИскл;
КонецФункции

Процедура НайтиСоздатьПравилаДляВидаСубконто(ТаблицаПравил, Порядок, Параметры)
	ДанныеДляВидовСубконто = Новый Массив;
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	ОбъектыИсточника.Ссылка КАК ОбъектИсточникСсылка,
	|	ОбъектыИсточника.Имя КАК ИсточникИмя,
	|	ОбъектыИсточника.Тип КАК ИсточникТип,
	|	ОбъектыИсточника.Идентификатор КАК ИсточникИдентификатор,
	|	ОбъектыПриемника.Ссылка КАК ОбъектПриемникСсылка
	|ИЗ Справочник.Объекты КАК ОбъектыИсточника
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОбъектыПриемника
	|ПО ОбъектыИсточника.Идентификатор = ОбъектыПРиемника.Идентификатор
	|ГДЕ ОбъектыИсточника.Владелец = &КонфигурацияИсточник 
	|	И ОбъектыПриемника.Владелец = &КонфигурацияПриемник
	|	И ОбъектыИсточника.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланВидовХарактеристик) 
	|	И ОбъектыИсточника.Имя ПОДОБНО ""%ВидыСубконто%""";
	Запрос.УстановитьПараметр("КонфигурацияИсточник", Параметры.КонфигурацияИсточник);
	Запрос.УстановитьПараметр("КонфигурацияПриемник", Параметры.КонфигурацияПриемник);  
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПКО = Неопределено;
		ПКПД = Неопределено;
		Если Параметры.СпособЗагрузки > 0 Тогда
			СущПравила = ТаблицаПравил.НайтиСтроки(Новый Структура("Идентификатор", Выборка.ИсточникИдентификатор));
	   		Для Каждого Правило Из СущПравила Цикл
				Если Правило.ЭтоПКО Тогда
					ПКО = Правило.Правило;
				Иначе
					ПКПД = Правило.Правило
				КонецЕсли;
				Правило.Используется = Истина;
			КонецЦикла; 
		Иначе
			// Проверка вдруг уже создали такое правило.
			ЗапросПравило = Новый Запрос;
			ЗапросПравило.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Правило.Код КАК Код
			|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правило
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
			|ПО Состав.Владелец = &Конвертация
			|	И Состав.ЭлементКонвертации = Правило.Ссылка
			|	И Состав.ПометкаУдаления = ЛОЖЬ И Состав.Отключить = ЛОЖЬ
            |ГДЕ Правило.ОбъектКонфигурации = &Объект";
			ЗапросПравило.УстановитьПараметр("Конвертация", Параметры.Конвертация);
			ЗапросПравило.УстановитьПараметр("Объект", Выборка.ОбъектИсточникСсылка);
			ВыборкаПравило = ЗапросПравило.Выполнить().Выбрать();
			Если ВыборкаПравило.Следующий() Тогда
				ДанныеДляВидовСубконто.Добавить(Новый Структура("ИмяОбъекта, ИмяПравила", Выборка.ИсточникИмя, ВыборкаПравило.Код));
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		// Создание ПКО
		СоздатьПКО(Выборка, ПКО, ТаблицаПравил, Порядок, Параметры);		
		
		ДанныеДляВидовСубконто.Добавить(Новый Структура("ИмяОбъекта, ИмяПравила", Выборка.ИсточникИмя, ПКО.Код));	
	КонецЦикла; 
	Если ДанныеДляВидовСубконто.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Параметры.Вставить("ДанныеДляВидовСубконто", ДанныеДляВидовСубконто);   
	
	// Создание алгоритма ОпределитьИмяПКОВидСубконто.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Правило.Ссылка
	|ИЗ Справочник.Алгоритмы КАК Правило
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация
	|	И Состав.ЭлементКонвертации = Правило.Ссылка
	|	И Состав.ПометкаУдаления = ЛОЖЬ И Состав.Отключить = ЛОЖЬ
	|ГДЕ Правило.Код = &Код";
	Запрос.УстановитьПараметр("Конвертация", Параметры.Конвертация);
	Запрос.УстановитьПараметр("Код", "ОпределитьИмяПКОВидСубконто");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		АлгоритмОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе 
		АлгоритмОбъект = Справочники.Алгоритмы.СоздатьЭлемент();
		АлгоритмОбъект.Код = "ОпределитьИмяПКОВидСубконто"; 
		АлгоритмОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XML;
		АлгоритмОбъект.Записать();
		ЗаписатьНовоеПравилоВСоставКонвертации(АлгоритмОбъект.Ссылка, Параметры.Конвертация);
	КонецЕсли;
	Если ДанныеДляВидовСубконто.Количество() = 1 Тогда
		АлгоритмОбъект.Алгоритм = "ИмяПКОВидСубконто = """ + ДанныеДляВидовСубконто[0].ИмяПравила + """;";
	Иначе
		// Сложный алгоритм.
		ТекАлгоритм = "";
		Для Каждого ВидСубк Из ДанныеДляВидовСубконто Цикл
			Если СтрНайти(ВидСубк.ИмяПравила, "Хозрасчетн") Тогда
				ИмяПланаСчетов = "Хозрасчетный";
			ИначеЕсли СтрНайти(ВидСубк.ИмяПравила, "Международн") Тогда
				ИмяПланаСчетов = "Международный";
			Иначе
				ИмяПланаСчетов = "<подставить нужное>";
			КонецЕсли;
			ТекАлгоритм = ТекАлгоритм + "Если ТипЗнч(ОбъектКоллекции.СчетДт) = Тип(""ПланСчетовСсылка." + ИмяПланаСчетов + """) Тогда" + Символы.ПС + Символы.Таб 
				+ "ИмяПКОВидСубконто = """ + ВидСубк.ИмяПравила + """;" + Символы.ПС +
			"КонецЕсли;" + Символы.ПС;
		КонецЦикла; 
		АлгоритмОбъект.Алгоритм = ТекАлгоритм;
	КонецЕсли;
	АлгоритмОбъект.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли