#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подготовка модуля менеджера обмена через универсальный формат.
// Возвращаемое значение: 
//		ТекстовыйДокумент - документ с текстом модуля
Функция ВыполнитьВыгрузкуМодулей() Экспорт
	МакетТекстовМодулей = ПолучитьМакет("ШаблоныТекстовМодулей");
	
	ОбщийТекстМодуля = Новый ТекстовыйДокумент;
	// Первая строка - имя конвертации.
	СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '// Менеджер обмена обмена через универсальный формат (%1 от %2)'"),
		Конвертация.Наименование,
		ТекущаяДатаСеанса());
	ОбщийТекстМодуля.ДобавитьСтроку("////////////////////////////////////////////////////////////////////////////////");
	ОбщийТекстМодуля.ДобавитьСтроку(СтрокаЗаголовка);
	ОбщийТекстМодуля.ДобавитьСтроку("//");
	ОбщийТекстМодуля.ДобавитьСтроку("////////////////////////////////////////////////////////////////////////////////");
		
	ВерсияФорматаМенеджера = КонвертацияДанныхXDTOСервер.ВерсияФорматаМенеджераОбмена(Конвертация);
	
	ТекстПроцедурыВызоваОбработчика = "";
	ТекстФункцииВызоваОбработчика = "";

	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПроцедурыКонвертации");
	ТекстПроцедуры_Конвертация = ЗаполнитьТекстПроцедурыКонвертации(МакетТекстовМодулей);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_Конвертация);
	Если ВерсияФорматаМенеджера <> "1" Тогда
		ВерсияФорматаМенеджераТекст = МакетТекстовМодулей.ПолучитьОбласть("ВерсияФорматаМенеджераОбмена").ПолучитьТекст();
		ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст,
			"#Область ВерсияФорматаМенеджераОбмена" + Символы.ПС, "");
		ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст, "&ВерсияФорматаМенеджераОбмена", 
									"""" + ВерсияФорматаМенеджера + """");
		ОбщийТекстМодуля.ДобавитьСтроку(ВерсияФорматаМенеджераТекст);
	КонецЕсли;
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");

	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПОД");
	ТекстПроцедуры_ПОД = ЗаполнитьТекстПроцедурыПОД(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика, ТекстФункцииВызоваОбработчика);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_ПОД);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");

	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПКО");
	ТекстПроцедуры_ПКО = ЗаполнитьТекстПроцедурыПКО(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика, ВерсияФорматаМенеджера);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_ПКО);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");

	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПКПД");
	ТекстПроцедуры_ПКПД = ЗаполнитьТекстПроцедурыПКПД(МакетТекстовМодулей);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_ПКПД);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");

	ОбщийТекстМодуля.ДобавитьСтроку("#Область Алгоритмы");
	ТекстПроцедуры_Алгоритмы = ЗаполнитьТекстПроцедурыАлгоритмы(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_Алгоритмы);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");

	ОбщийТекстМодуля.ДобавитьСтроку("#Область Параметры");
	ТекстПроцедуры_Параметры = ЗаполнитьТекстПроцедурыПараметры(МакетТекстовМодулей);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_Параметры);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	
	ОбщийТекстМодуля.ДобавитьСтроку("#Область ОбщегоНазначения");
	ТекстПроцедуры_Общие = ЗаполнитьТекстПроцедурыОбщие(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика, ТекстФункцииВызоваОбработчика);
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстПроцедуры_Общие);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	
	КоличествоСтрок = ОбщийТекстМодуля.КоличествоСтрок();
	СтрокаПредыдущая = "";
	
	Для ОбратныйСчетчик = 0 По КоличествоСтрок - 1 Цикл
		НомерСтроки = КоличествоСтрок - ОбратныйСчетчик;
		
		Строка = ОбщийТекстМодуля.ПолучитьСтроку(НомерСтроки);
		Если (СокрЛП(Строка) = "//-- Локализация"
				И СокрЛП(СтрокаПредыдущая) = "//++ Локализация") Тогда
				ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки + 1);
				ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки);
				СтрокаПредыдущая = "";
		Иначе
			СтрокаПредыдущая = Строка;
		КонецЕсли;
	КонецЦикла;
	
	Для ОбратныйСчетчик = 0 По КоличествоСтрок - 1 Цикл
		
		НомерСтроки = КоличествоСтрок - ОбратныйСчетчик;
		
		Строка = ОбщийТекстМодуля.ПолучитьСтроку(НомерСтроки);
		Если (СокрЛП(Строка) = "//--НЕ УТ"
				И СокрЛП(СтрокаПредыдущая) = "//++НЕ УТ")
			ИЛИ (СокрЛП(Строка) = "//--НЕ УТКА"
				И СокрЛП(СтрокаПредыдущая) = "//++НЕ УТКА") Тогда
			ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки + 1);
			ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки);
			СтрокаПредыдущая = "";
		ИначеЕсли Найти(Строка, "---") > 0 Тогда
			ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки);
		Иначе
			СтрокаПредыдущая = Строка;
		КонецЕсли;
	КонецЦикла;
	
	Стр = ОбщийТекстМодуля.ПолучитьТекст();
	ОбщийТекстМодуля.УстановитьТекст(Стр);
	
	Возврат ОбщийТекстМодуля;
	

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТекстПроцедурыКонвертации(МакетТекстовМодулей)
	
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Конвертации.АлгоритмПередКонвертацией КАК АлгоритмПередКонвертацией,
	|	Конвертации.АлгоритмПослеКонвертации КАК АлгоритмПослеКонвертации,
	|	Конвертации.АлгоритмПередОтложеннымЗаполнением КАК АлгоритмПередОтложеннымЗаполнением
	|ИЗ
	|	Справочник.Конвертации КАК Конвертации
	|ГДЕ
	|	Конвертации.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Конвертация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТекстПроцедуры.ДобавитьСтроку("Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт");
	ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередКонвертацией));
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");
	
	ТекстПроцедуры.ДобавитьСтроку("Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт");
	ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПослеКонвертации));
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");

	
	ТекстПроцедуры.ДобавитьСтроку("Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт");
	ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередОтложеннымЗаполнением));
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");

	
	Возврат ТекстПроцедуры.ПолучитьТекст();
	
КонецФункции

Функция ЗаполнитьТекстПроцедурыПОД(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика, ТекстФункцииВызоваОбработчика)
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаОбработкиДанных");
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("ПравилаОбработкиДанных");
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("ПравилаОбработкиДанных");
	КонецЕсли;
	
	ВсяПроцедура = Новый ТекстовыйДокумент;
	
	ЗапросПОД = Новый Запрос;

	ЗапросПОД.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка 
	|ПОМЕСТИТЬ КОбработке
	|ИЗ (" + КОбработке + ") КАК Свод
	|;
	|ВЫБРАТЬ
	|	ПОД.Ссылка,
	|	0 КАК Направление
	|ПОМЕСТИТЬ ТабПравил
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПОД
	|ГДЕ
	|	ПОД.ИспользоватьДляОтправки = ИСТИНА
	|	И ПОД.ИспользоватьДляПолучения = ЛОЖЬ
	|	И НЕ ПОД.Отключить
	|	И ПОД.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)  
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПОД.Ссылка,
	|	1
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПОД
	|ГДЕ
	|	ПОД.ИспользоватьДляОтправки = ЛОЖЬ
	|	И ПОД.ИспользоватьДляПолучения = ИСТИНА
	|	И НЕ ПОД.Отключить
	|	И ПОД.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)  
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПОД.Ссылка,
	|	2
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПОД
	|ГДЕ
	|	ПОД.ИспользоватьДляОтправки = ИСТИНА
	|	И ПОД.ИспользоватьДляПолучения = ИСТИНА
	|	И НЕ ПОД.Отключить
	|	И ПОД.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПравил.Ссылка КАК Ссылка,
	|	ТабПравил.Ссылка.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
	|	ТабПравил.Ссылка.Наименование КАК Наименование,
	|	ТабПравил.Ссылка.Наименование КАК Код,
	|	ТабПравил.Ссылка.ОбъектВыборки КАК ОбъектВыборки,
	|	ВЫБОР
	|		КОГДА ТабПравил.Ссылка.ИспользоватьДляОтправки
	|			ТОГДА ТабПравил.Ссылка.ОбъектВыборки
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОбъектКонфигурации,
	|	ТабПравил.Ссылка.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
	|	ТабПравил.Ссылка.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
	|	ТабПравил.Ссылка.АлгоритмПриОбработке КАК ПриОбработке,
	|	ВЫБОР
	|		КОГДА ТабПравил.Ссылка.ИспользоватьДляОтправки
	|			ТОГДА ТабПравил.Ссылка.АлгоритмВыборкаДанных
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВыборкаДанных,
	|	ВЫБОР
	|		КОГДА ТабПравил.Ссылка.ИспользоватьДляОтправки
	|			ТОГДА ОбъектыКонф.Тип
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипОбъектаВыборки,
	|	ТабПравил.Направление КАК Направление,
	|	ТабПравил.Ссылка.ОчисткаДанных КАК ОчисткаДанных
	|ИЗ
	|	ТабПравил КАК ТабПравил
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОбъектыКонф
	|		ПО (ОбъектыКонф.Владелец = &Конфигурация)
	|			И ТабПравил.Ссылка.ОбъектВыборки = ОбъектыКонф.Наименование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|		ПО (СоставыКонвертаций.ЭлементКонвертации = ТабПравил.Ссылка)
	|			И (СоставыКонвертаций.Владелец = &Конвертация)
	|			И (СоставыКонвертаций.Отключить = ЛОЖЬ)
	|ГДЕ
	|	ТабПравил.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Направление,
	|	ТабПравил.Ссылка.Наименование
	|ИТОГИ ПО
	|	Направление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПКО.ПравилоКонвертацииОбъекта КАК ПКО,
	|	ТабПКО.Ссылка КАК ПОД
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов КАК ТабПКО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПравил КАК ТабПравил
	|		ПО ТабПКО.Ссылка = ТабПравил.Ссылка
	|";
	ЗапросПОД.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросПОД.УстановитьПараметр("Конфигурация", Конвертация.Конфигурация);
	ЗапросПОД.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

	ТелоПроцедуры = Новый ТекстовыйДокумент;
	
	РезультатЗапроса = ЗапросПОД.ВыполнитьПакет();
	ВыборкаПоНаправлению = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЕслиОткрыто = Ложь;
	ТелоПроцедурыПоТегам = Новый Соответствие;
	Пока ВыборкаПоНаправлению.Следующий() Цикл
		
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			ТелоПроцедуры.ДобавитьСтроку("Если НаправлениеОбмена = ""Отправка"" Тогда");
			ТелоПроцедуры.ДобавитьСтроку(Символы.Таб + "Если ПравилаОбработкиДанных.Колонки.Найти(""ОчисткаДанных"") = Неопределено Тогда");
			ТелоПроцедуры.ДобавитьСтроку(Символы.Таб + Символы.Таб + "ПравилаОбработкиДанных.Колонки.Добавить(""ОчисткаДанных"");");
			ТелоПроцедуры.ДобавитьСтроку(Символы.Таб + "КонецЕсли;");
			ЕслиОткрыто = Истина;
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			ДобавитьВызовыСТегамиВТелоПроцедуры(ТелоПроцедурыПоТегам, ТелоПроцедуры);
			ТелоПроцедурыПоТегам = Новый Соответствие;
			Если Не ЕслиОткрыто Тогда
				Строка = "Если";
			Иначе
				Строка = "ИначеЕсли";
			КонецЕсли;
			ТелоПроцедуры.ДобавитьСтроку(Строка + " НаправлениеОбмена = ""Получение"" Тогда");
			ЕслиОткрыто = Истина;
		Иначе
			Если ЕслиОткрыто Тогда
				КусокПоТегу = ТелоПроцедурыПоТегам.Получить("БезТэга");
				Если КусокПоТегу = Неопределено Тогда
					КусокПоТегу = Новый ТекстовыйДокумент;
				КонецЕсли;
				КусокПоТегу.ДобавитьСтроку("КонецЕсли;");
				ТелоПроцедурыПоТегам.Вставить("БезТэга", КусокПоТегу);
				ЕслиОткрыто = Ложь;
			КонецЕсли;
			// Добавление в тело процедуры накопленного текста.
			ДобавитьВызовыСТегамиВТелоПроцедуры(ТелоПроцедурыПоТегам, ТелоПроцедуры);
			ТелоПроцедурыПоТегам = Новый Соответствие;
		КонецЕсли;
	
		ВыборкаДетальная = ВыборкаПоНаправлению.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ТегСлужебный = ОпределитьСлужебныйТег(ВыборкаДетальная.Ссылка);
			ТегЛокализации = ОпределитьТегЛокализации(ВыборкаДетальная.Ссылка);
			Если ТегСлужебный = "" Тогда
				ТегСлужебный = "БезТэга";
			КонецЕсли;
			КусокПоТегу = ТелоПроцедурыПоТегам.Получить(ТегСлужебный);
			Если КусокПоТегу = Неопределено Тогда
				КусокПоТегу = Новый ТекстовыйДокумент;
			КонецЕсли;

			Строка = ?(ЕслиОткрыто, Символы.Таб, "") + "ДобавитьПОД_" + ВыборкаДетальная.Наименование + "(ПравилаОбработкиДанных);";
			Если ТегЛокализации <> "" Тогда
				Строка = "//++ " + ТегЛокализации + Символы.ПС + Строка;
			КонецЕсли;
			Если ТегЛокализации <> "" Тогда
				Строка = Строка + Символы.ПС + "//-- " + ТегЛокализации;
			КонецЕсли;
			КусокПоТегу.ДобавитьСтроку(Строка);
			ТелоПроцедурыПоТегам.Вставить(ТегСлужебный, КусокПоТегу);
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЕслиОткрыто Тогда
		КусокПоТегу = ТелоПроцедурыПоТегам.Получить("БезТэга");
		Если КусокПоТегу = Неопределено Тогда
			КусокПоТегу = Новый ТекстовыйДокумент;
		КонецЕсли;
		КусокПоТегу.ДобавитьСтроку("КонецЕсли;");
		ТелоПроцедурыПоТегам.Вставить("БезТэга", КусокПоТегу);
	КонецЕсли;
	// Добавление в тело процедуры накопленного текста.
	ДобавитьВызовыСТегамиВТелоПроцедуры(ТелоПроцедурыПоТегам, ТелоПроцедуры);
	
	ТекстТелаПроцедуры = ДобавитьОтступыВСтроку(ТелоПроцедуры.ПолучитьТекст());
	
	ЗаполнитьПравилаОбработкиДанныхТекст = МакетТекстовМодулей.ПолучитьОбласть("ЗаполнитьПравилаОбработкиДанных").ПолучитьТекст();
	ЗаполнитьПравилаОбработкиДанныхТекст = СтрЗаменить(ЗаполнитьПравилаОбработкиДанныхТекст,
		"#Область ЗаполнитьПравилаОбработкиДанных" + Символы.ПС, "");
	ЗаполнитьПравилаОбработкиДанныхТекст = СтрЗаменить(ЗаполнитьПравилаОбработкиДанныхТекст, "&ТелоПроцедуры", ТекстТелаПроцедуры);
	ВсяПроцедура.ДобавитьСтроку(ЗаполнитьПравилаОбработкиДанныхТекст);
	
	ТабПКО = РезультатЗапроса[3].Выгрузить();
	ТабПКО.Индексы.Добавить("ПОД");
	
	РазделПравил = Новый ТекстовыйДокумент;
	ВыборкаПоНаправлению.Сбросить();
	Пока ВыборкаПоНаправлению.Следующий() Цикл
		
		// Разбивка по направлениям.
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			РазделПравил.ДобавитьСтроку("#Область Отправка");
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			РазделПравил.ДобавитьСтроку("#Область Получение");
		Иначе
			РазделПравил.ДобавитьСтроку("#Область ОтправкаИПолучение");
		КонецЕсли;
		
		ВыборкаДетальная = ВыборкаПоНаправлению.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			
			ОбластьПОДТекст = МакетТекстовМодулей.ПолучитьОбласть("ПОД").ПолучитьТекст();
			
			ТегСлужебный = ОпределитьСлужебныйТег(ВыборкаДетальная.Ссылка);
			Если ТегСлужебный <> "" Тогда
				ОбластьПОДТекст = "//++" + ТегСлужебный + Символы.ПС + ОбластьПОДТекст;
			КонецЕсли;
			
			ТегЛокализации = ОпределитьТегЛокализации(ВыборкаДетальная.Ссылка);
			Если ТегЛокализации <> "" Тогда
				ОбластьПОДТекст = "//++ " + ТегЛокализации + Символы.ПС + ОбластьПОДТекст;
			КонецЕсли;
			
			ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "#Область ПОД" + Символы.ПС, "");
			ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&КонецОбласти" + Символы.ПС, "#КонецОбласти");
			
			ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъявлениеОбласти", "#Область " + СокрЛП(ВыборкаДетальная.Наименование));
			ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ИмяПОДДляТаблицы", СокрЛП(ВыборкаДетальная.Наименование));
			ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ИмяПОД", "ДобавитьПОД_" + СокрЛП(ВыборкаДетальная.Наименование));
			
			Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
				ОбъектВыборкиМетаданные = ПолучитьТипМетаданные(ВыборкаДетальная.ТипОбъектаВыборки, ВыборкаДетальная.ОбъектВыборки);
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиМетаданные", ОбъектВыборкиМетаданные);
			Иначе
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиМетаданные", "---");
			КонецЕсли;
			
			Если ВыборкаДетальная.ИспользоватьДляПолучения Тогда
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиФормат", СокрЛП(ВыборкаДетальная.ОбъектВыборки));
			Иначе
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиФормат", "---");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальная.ПриОбработке) Тогда
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ПриОбработке",
					"ПОД_" + СокрЛП(ВыборкаДетальная.Наименование) + "_ПриОбработке");
			Иначе
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ПриОбработке", "---");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальная.ВыборкаДанных)
				И ВыборкаДетальная.ИспользоватьДляОтправки Тогда
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ВыборкаДанных",
					"ПОД_" + СокрЛП(ВыборкаДетальная.Наименование) + "_ВыборкаДанных");
			Иначе
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ВыборкаДанных", "---");
			КонецЕсли;
			Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОчисткаДанных", ?(ВыборкаДетальная.ОчисткаДанных, "Истина", "Ложь"));
			Иначе
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОчисткаДанных", "---");
			КонецЕсли;
			ЗаполнениеМассиваПравил = Новый ТекстовыйДокумент;
			КоллекцияПКО = ТабПКО.НайтиСтроки(Новый Структура("ПОД", ВыборкаДетальная.Ссылка));
			Если КоллекцияПКО.Количество() > 0
				Или ЗначениеЗаполнено(ВыборкаДетальная.ПравилоКонвертацииОбъекта) Тогда
				Для Каждого Строка Из КоллекцияПКО Цикл
					ЗаполнениеМассиваПравил.ДобавитьСтроку("ПравилоОбработки.ИспользуемыеПКО.Добавить(""" + Строка.ПКО + """);");
				КонецЦикла;
				Если ЗначениеЗаполнено(ВыборкаДетальная.ПравилоКонвертацииОбъекта) Тогда
					ЗаполнениеМассиваПравил.ДобавитьСтроку("ПравилоОбработки.ИспользуемыеПКО.Добавить(""" + ВыборкаДетальная.ПравилоКонвертацииОбъекта + """);");
				КонецЕсли;
				ЗаполнениеМассиваПравилТекст = ДобавитьОтступыВСтроку(ЗаполнениеМассиваПравил.ПолучитьТекст());
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ЗаполнениеМассиваПравил", ЗаполнениеМассиваПравилТекст);
			Иначе
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ЗаполнениеМассиваПравил", "---");
			КонецЕсли;
			
			ТекстОбработчики = "";
			ДобавитьОбработчикиВТекстМодуля(ПараметрыФормированияОбработчиков("ПОД", "ПриОбработке", ТегСлужебный, ТегЛокализации),
				ВыборкаДетальная, ТекстОбработчики,МакетТекстовМодулей, 
				ТекстПроцедурыВызоваОбработчика, ТекстФункцииВызоваОбработчика);
			Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
				ДобавитьОбработчикиВТекстМодуля(ПараметрыФормированияОбработчиков("ПОД", "ВыборкаДанных", ТегСлужебный, ТегЛокализации),
					ВыборкаДетальная, ТекстОбработчики,МакетТекстовМодулей, 
					ТекстПроцедурыВызоваОбработчика, ТекстФункцииВызоваОбработчика);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекстОбработчики) Тогда
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбработчикиПОД", ТекстОбработчики);
			Иначе
				ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбработчикиПОД", "---");
			КонецЕсли;
			Если ТегСлужебный <> "" Тогда
				ОбластьПОДТекст = ОбластьПОДТекст + Символы.ПС + "//--" + ТегСлужебный;
			КонецЕсли;
			Если ТегЛокализации <> "" Тогда
				ОбластьПОДТекст = ОбластьПОДТекст + Символы.ПС + "//-- " + ТегЛокализации;
			КонецЕсли;
			РазделПравил.ДобавитьСтроку(ОбластьПОДТекст);

		КонецЦикла;
		РазделПравил.УстановитьТекст(РазделПравил.ПолучитьТекст() + "#КонецОбласти"); // Разбивка по направлениям.
		
	КонецЦикла;
	
	ВсяПроцедура.ДобавитьСтроку(РазделПравил.ПолучитьТекст());
	
	Возврат ВсяПроцедура.ПолучитьТекст();
	
КонецФункции

Функция ЗаполнитьТекстПроцедурыПКО(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика, ВерсияФорматаМенеджера)
	
	ВсяПроцедура = Новый ТекстовыйДокумент;
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииОбъектов");
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов");
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("ПравилаКонвертацииОбъектов");
	КонецЕсли;

	ЗапросПКО = Новый Запрос;
	ЗапросПКО.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|;
		|ВЫБРАТЬ
		|	СоставыКонвертаций.ЭлементКонвертации КАК ЭлементКонвертации
		|ПОМЕСТИТЬ ЭлементыКонвертацииПКО
		|ИЗ
		|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
		|ГДЕ
		|	СоставыКонвертаций.Владелец = &Конвертация
		|	И ТИПЗНАЧЕНИЯ(СоставыКонвертаций.ЭлементКонвертации) = ТИП(Справочник.ПравилаКонвертацииОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПКО.Ссылка КАК Ссылка,
		|	0 КАК Направление
		|ПОМЕСТИТЬ ТабПравил
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭлементыКонвертацииПКО КАК ЭлементыКонвертацииПКО
		|		ПО (ЭлементыКонвертацииПКО.ЭлементКонвертации = ПКО.Ссылка)
		|ГДЕ
		|	ПКО.ИспользоватьДляОтправки = ИСТИНА
		|	И ПКО.ИспользоватьДляПолучения = ЛОЖЬ
		|	И НЕ ПКО.Отключить
		|	И ПКО.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПКО.Ссылка,
		|	1
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭлементыКонвертацииПКО КАК ЭлементыКонвертацииПКО
		|		ПО (ЭлементыКонвертацииПКО.ЭлементКонвертации = ПКО.Ссылка)
		|ГДЕ
		|	ПКО.ИспользоватьДляОтправки = ЛОЖЬ
		|	И ПКО.ИспользоватьДляПолучения = ИСТИНА
		|	И НЕ ПКО.Отключить
		|	И ПКО.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПКО.Ссылка,
		|	2
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭлементыКонвертацииПКО КАК ЭлементыКонвертацииПКО
		|		ПО (ЭлементыКонвертацииПКО.ЭлементКонвертации = ПКО.Ссылка)
		|ГДЕ
		|	ПКО.ИспользоватьДляОтправки = ИСТИНА
		|	И ПКО.ИспользоватьДляПолучения = ИСТИНА
		|	И НЕ ПКО.Отключить
		|	И ПКО.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПравил.Ссылка КАК Ссылка,
		|	ТабПравил.Ссылка.Код КАК Код,
		|	ТабПравил.Ссылка.ВариантИдентификации КАК ВариантИдентификации,
		|	ТабПравил.Ссылка.ОбъектКонфигурации КАК ОбъектКонфигурации,
		|	ТабПравил.Ссылка.ОбъектФормата КАК ОбъектФормата,
		|	ТабПравил.Ссылка.ПравилоДляГруппыСправочника КАК ПравилоДляГруппыСправочника,
		|	ТабПравил.Ссылка.АлгоритмПриОтправкеДанных КАК ПриОтправкеДанных,
		|	ТабПравил.Ссылка.АлгоритмПередПолучениемДанных КАК ПриКонвертацииДанныхXDTO,
		|	ТабПравил.Ссылка.АлгоритмПриПолученииДанных КАК ПередЗаписьюПолученныхДанных,
		|	ТабПравил.Ссылка.АлгоритмПослеЗагрузкиВсехДанных КАК ПослеЗагрузкиВсехДанных_Код,
		|	ТабПравил.Ссылка.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
		|	ТабПравил.Ссылка.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
		|	ОК.Тип КАК ТипДанных,
		|	ТабПравил.Направление КАК Направление
		|ИЗ
		|	ТабПравил КАК ТабПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОК
		|		ПО ТабПравил.Ссылка.ОбъектКонфигурации = ОК.Наименование
		|			И (ОК.Владелец = &Конфигурация)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставыКонвертаций
		|		ПО (СоставыКонвертаций.ЭлементКонвертации = ТабПравил.Ссылка)
		|			И (СоставыКонвертаций.Владелец = &Конвертация)
		|			И (СоставыКонвертаций.Отключить = ЛОЖЬ)
		|ГДЕ
		|	ТабПравил.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Направление,
		|	ТабПравил.Ссылка.Код
		|ИТОГИ ПО
		|	Направление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурации КАК СвойствоКонфигурации,
		|	ПравилаКонвертацииСвойств.СвойствоФормата КАК СвойствоФормата,
		|	ПравилаКонвертацииСвойств.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
		|	ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства КАК ПравилоКонвертацииСвойства,
		|	ПравилаКонвертацииСвойств.Владелец КАК ПравилоКонвертацииОбъекта,
		|	ТабПравил.Ссылка КАК Ссылка
		|ИЗ
		|	ТабПравил КАК ТабПравил
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
		|		ПО ТабПравил.Ссылка = ПравилаКонвертацииСвойств.Владелец
		|ГДЕ
		|	ПравилаКонвертацииСвойств.Отключить = ЛОЖЬ
		|	И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ
		|	И ПравилаКонвертацииСвойств.Родитель = ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИспользуетсяАлгоритмКонвертации,
		|	СвойствоКонфигурации.Наименование,
		|	СвойствоФормата,
		|	ПравилаКонвертацииСвойств.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаКонвертацииСвойств.Родитель.СвойствоФормата КАК ГруппаСвойствФормата,
		|	ПравилаКонвертацииСвойств.Родитель.СвойствоКонфигурации КАК ГруппаСвойствКонфигурации,
		|	ПравилаКонвертацииСвойств.СвойствоКонфигурации КАК СвойствоКонфигурации,
		|	ПравилаКонвертацииСвойств.СвойствоФормата КАК СвойствоФормата,
		|	ПравилаКонвертацииСвойств.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
		|	ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства КАК ПравилоКонвертацииСвойства,
		|	ПравилаКонвертацииСвойств.Владелец КАК ПравилоКонвертацииОбъекта,
		|	ПравилаКонвертацииСвойств.Код КАК Код,
		|	ТабПравил.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТабПКС_ТЧ
		|ИЗ
		|	ТабПравил КАК ТабПравил
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
		|		ПО ТабПравил.Ссылка = ПравилаКонвертацииСвойств.Владелец
		|ГДЕ
		|	ПравилаКонвертацииСвойств.Отключить = ЛОЖЬ
		|	И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ
		|	И ПравилаКонвертацииСвойств.Родитель <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабПКС_ТЧ.ГруппаСвойствФормата КАК ГруппаСвойствФормата,
		|	ТабПКС_ТЧ.ГруппаСвойствКонфигурации КАК ГруппаСвойствКонфигурации,
		|	ТабПКС_ТЧ.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
		|	ВЫБОР
		|		КОГДА ТабПКС_ТЧ.ГруппаСвойствФормата <> """"
		|				И ТабПКС_ТЧ.ГруппаСвойствКонфигурации <> """"
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПрямаяКонвертация
		|ИЗ
		|	ТабПКС_ТЧ КАК ТабПКС_ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабПКС_ТЧ.ГруппаСвойствФормата КАК ГруппаСвойствФормата,
		|	ТабПКС_ТЧ.ГруппаСвойствКонфигурации КАК ГруппаСвойствКонфигурации,
		|	ТабПКС_ТЧ.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
		|	ТабПКС_ТЧ.СвойствоКонфигурации КАК СвойствоКонфигурации,
		|	ТабПКС_ТЧ.СвойствоФормата КАК СвойствоФормата,
		|	ТабПКС_ТЧ.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
		|	ТабПКС_ТЧ.ПравилоКонвертацииСвойства КАК ПравилоКонвертацииСвойства,
		|	ТабПКС_ТЧ.Код КАК Код
		|ИЗ
		|	ТабПКС_ТЧ КАК ТабПКС_ТЧ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТабПКС_ТЧ.СвойствоКонфигурации,
		|	ТабПКС_ТЧ.СвойствоФормата,
		|	ТабПКС_ТЧ.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоляПоиска.РеквизитыПоиска КАК РеквизитыПоиска,
		|	ПоляПоиска.Ссылка КАК ПравилоКонвертацииОбъекта
		|ИЗ
		|	ТабПравил КАК ТабПравил
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииОбъектов.ИдентификацияПоПолямПоиска КАК ПоляПоиска
		|		ПО ТабПравил.Ссылка = ПоляПоиска.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоляПоиска.НомерСтроки";
	ЗапросПКО.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросПКО.УстановитьПараметр("Конфигурация", Конвертация.Конфигурация);
	ЗапросПКО.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

	
	ТелоПроцедуры = Новый ТекстовыйДокумент;
	// Заполнение процедуры ЗаполнитьПравилаКонвертацииОбъектов.
	ЕслиОткрыто = Ложь;
	ТелоПроцедурыПоТегам = Новый Соответствие;
	РезультатЗапроса = ЗапросПКО.ВыполнитьПакет();
	ВыборкаПоНаправлению = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоНаправлению.Следующий() Цикл
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			ТелоПроцедуры.ДобавитьСтроку("Если НаправлениеОбмена = ""Отправка"" Тогда");
			ЕслиОткрыто = Истина;
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			// Добавление в тело процедуры накопленного текста.
			ДобавитьВызовыСТегамиВТелоПроцедуры(ТелоПроцедурыПоТегам, ТелоПроцедуры);
			ТелоПроцедурыПоТегам = Новый Соответствие;
			Если Не ЕслиОткрыто Тогда
				Строка = "Если";
			Иначе
				Строка = "ИначеЕсли";
			КонецЕсли;
			ТелоПроцедуры.ДобавитьСтроку(Строка + " НаправлениеОбмена = ""Получение"" Тогда");
			ЕслиОткрыто = Истина;
		Иначе
			Если ЕслиОткрыто Тогда
				КусокПоТегу = ТелоПроцедурыПоТегам.Получить("БезТэга");
				Если КусокПоТегу = Неопределено Тогда
					КусокПоТегу = Новый ТекстовыйДокумент;
				КонецЕсли;
				КусокПоТегу.ДобавитьСтроку("КонецЕсли;");
				ТелоПроцедурыПоТегам.Вставить("БезТэга", КусокПоТегу);
				ЕслиОткрыто = Ложь;
			КонецЕсли;
			// Добавление в тело процедуры накопленного текста.
			ДобавитьВызовыСТегамиВТелоПроцедуры(ТелоПроцедурыПоТегам, ТелоПроцедуры);
			ТелоПроцедурыПоТегам = Новый Соответствие;
		КонецЕсли;
	
		ВыборкаДетальная = ВыборкаПоНаправлению.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ТегСлужебный = ОпределитьСлужебныйТег(ВыборкаДетальная.Ссылка);
			ТегЛокализации = ОпределитьТегЛокализации(ВыборкаДетальная.Ссылка);
			Если ТегСлужебный = "" Тогда
				ТегСлужебный = "БезТэга";
			КонецЕсли;
			КусокПоТегу = ТелоПроцедурыПоТегам.Получить(ТегСлужебный);
			Если КусокПоТегу = Неопределено Тогда
				КусокПоТегу = Новый ТекстовыйДокумент;
			КонецЕсли;
			Строка = ?(ЕслиОткрыто, Символы.Таб, "") + "ДобавитьПКО_" + ВыборкаДетальная.Код + "(ПравилаКонвертации);";
			Если ТегЛокализации <> "" Тогда
				Строка = "//++ " + ТегЛокализации + Символы.ПС + Строка;
			КонецЕсли;
			Если ТегЛокализации <> "" Тогда
				Строка = Строка + Символы.ПС + "//-- " + ТегЛокализации;
			КонецЕсли;
			КусокПоТегу.ДобавитьСтроку(Строка);
			ТелоПроцедурыПоТегам.Вставить(ТегСлужебный, КусокПоТегу);
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЕслиОткрыто Тогда
		КусокПоТегу = ТелоПроцедурыПоТегам.Получить("БезТэга");
		Если КусокПоТегу = Неопределено Тогда
			КусокПоТегу = Новый ТекстовыйДокумент;
		КонецЕсли;
		КусокПоТегу.ДобавитьСтроку("КонецЕсли;");
		ТелоПроцедурыПоТегам.Вставить("БезТэга", КусокПоТегу);
	КонецЕсли;
	// Добавление в тело процедуры накопленного текста.
	ДобавитьВызовыСТегамиВТелоПроцедуры(ТелоПроцедурыПоТегам, ТелоПроцедуры);
	
	ТекстТелаПроцедуры = ДобавитьОтступыВСтроку(ТелоПроцедуры.ПолучитьТекст());
	
	ЗаполнитьПравилаКонвертацииОбъектовТекст = МакетТекстовМодулей.ПолучитьОбласть("ЗаполнитьПравилаКонвертацииОбъектов").ПолучитьТекст();
	ЗаполнитьПравилаКонвертацииОбъектовТекст = СтрЗаменить(ЗаполнитьПравилаКонвертацииОбъектовТекст,
		"#Область ЗаполнитьПравилаКонвертацииОбъектов" + Символы.ПС, "");
	ЗаполнитьПравилаКонвертацииОбъектовТекст = СтрЗаменить(ЗаполнитьПравилаКонвертацииОбъектовТекст, "&ТелоПроцедуры", ТекстТелаПроцедуры);
	ВсяПроцедура.ДобавитьСтроку(ЗаполнитьПравилаКонвертацииОбъектовТекст);
	
	Если ВерсияФорматаМенеджера <> "1" Тогда
		ДобавитьПКСТекст =  МакетТекстовМодулей.ПолучитьОбласть("ДобавитьПКС").ПолучитьТекст();
		ВсяПроцедура.ДобавитьСтроку(ДобавитьПКСТекст);
	КонецЕсли;
	
	ТабПКС = РезультатЗапроса[4].Выгрузить();
	ТабПКС.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	
	ТабПКС_ТЧСвод = РезультатЗапроса[6].Выгрузить();
	ТабПКС_ТЧСвод.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	
	ТабПКС_ТЧ = РезультатЗапроса[7].Выгрузить();
	ТабПКС_ТЧ.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	ТабПКС_ТЧ.Индексы.Добавить("ГруппаСвойствФормата");
	ТабПКС_ТЧ.Индексы.Добавить("ГруппаСвойствКонфигурации");

	
	ТабПолейПоиска = РезультатЗапроса[8].Выгрузить();
	ТабПолейПоиска.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	
	РазделПравил = Новый ТекстовыйДокумент;
	ВыборкаПоНаправлению.Сбросить();
	Пока ВыборкаПоНаправлению.Следующий() Цикл
		
		// Разбивка по направлениям.
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			РазделПравил.ДобавитьСтроку("#Область Отправка");
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			РазделПравил.ДобавитьСтроку("#Область Получение");
		Иначе
			РазделПравил.ДобавитьСтроку("#Область ОтправкаИПолучение");
		КонецЕсли;
		
		ВыборкаДетальная = ВыборкаПоНаправлению.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ИмяОбластиПКО = "";
			// Для корректного выравнивания в процедурах заполнения ПКО используются разные области.
			Если ВыборкаДетальная.ИспользоватьДляПолучения Тогда
				ИмяОбластиПКО = "ПКО_ЕстьПолучение";
			Иначе
				ИмяОбластиПКО = "ПКО_ТолькоОтправка";
			КонецЕсли;

			ОбластьПКОТекст = МакетТекстовМодулей.ПолучитьОбласть(ИмяОбластиПКО).ПолучитьТекст();
			
			ТегСлужебный = ОпределитьСлужебныйТег(ВыборкаДетальная.Ссылка);
			ТегЛокализации = ОпределитьТегЛокализации(ВыборкаДетальная.Ссылка);
			
			Если ТегСлужебный <> "" Тогда
				ОбластьПКОТекст = "//++" + ТегСлужебный + Символы.ПС + ОбластьПКОТекст;
			КонецЕсли;
			
			Если ТегЛокализации <> "" Тогда
				ОбластьПКОТекст = "//++ " + ТегЛокализации + Символы.ПС + ОбластьПКОТекст;
			КонецЕсли;
			
			ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "#Область " + ИмяОбластиПКО + Символы.ПС, "");
			ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&КонецОбласти" + Символы.ПС, "#КонецОбласти");
			
			ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбъявлениеОбласти", "#Область " + СокрЛП(ВыборкаДетальная.Код));
			ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ИмяПКО", СокрЛП(ВыборкаДетальная.Код));
			
			ОбъектДанных = ПолучитьТипМетаданные(ВыборкаДетальная.ТипДанных, ВыборкаДетальная.ОбъектКонфигурации);
			ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбъектДанных", ОбъектДанных);
			
			ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбъектФормата", СокрЛП(ВыборкаДетальная.ОбъектФормата));
			Если ВыборкаДетальная.ПравилоДляГруппыСправочника Тогда
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПравилоДляГруппыСправочника","Истина");
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПравилоДляГруппыСправочника", "---");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальная.ПриОтправкеДанных)
					И ВыборкаДетальная.ИспользоватьДляОтправки Тогда
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриОтправкеДанных",
					"ПКО_" + СокрЛП(ВыборкаДетальная.Код) + "_ПриОтправкеДанных");
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриОтправкеДанных", "---");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальная.ПриКонвертацииДанныхXDTO)
				И ВыборкаДетальная.ИспользоватьДляПолучения Тогда
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриКонвертацииДанныхXDTO",
					"ПКО_" + СокрЛП(ВыборкаДетальная.Код) + "_ПриКонвертацииДанныхXDTO");
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриКонвертацииДанныхXDTO", "---");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальная.ПередЗаписьюПолученныхДанных)
				И ВыборкаДетальная.ИспользоватьДляПолучения Тогда
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПередЗаписьюПолученныхДанных",
					"ПКО_" + СокрЛП(ВыборкаДетальная.Код) + "_ПередЗаписьюПолученныхДанных");
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПередЗаписьюПолученныхДанных", "---");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальная.ПослеЗагрузкиВсехДанных_Код)
				И ВыборкаДетальная.ИспользоватьДляПолучения Тогда
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПослеЗагрузкиВсехДанных", СокрЛП(ВыборкаДетальная.ПослеЗагрузкиВсехДанных_Код));
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПослеЗагрузкиВсехДанных", "---");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаДетальная.ВариантИдентификации) Тогда
				ВариантИдентификацииСтрокой = Метаданные.Перечисления.ВариантыИдентификацииОбъектов.ЗначенияПеречисления.Получить(
					Перечисления.ВариантыИдентификацииОбъектов.Индекс(ВыборкаДетальная.ВариантИдентификации)).Имя;
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ВариантИдентификации", ВариантИдентификацииСтрокой);
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ВариантИдентификации", "---");
			КонецЕсли;
			
			ЗаполнениеПКС = Новый ТекстовыйДокумент;
			КоллекцияПКС = ТабПКС.НайтиСтроки(Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка));
			Если КоллекцияПКС.Количество() > 0 Тогда
				Если ВерсияФорматаМенеджера <> "1" Тогда
					ЗаполнениеПКС.ДобавитьСтроку("СвойстваШапки = ПравилоКонвертации.Свойства;");
					МаксДлинаСвойствоКонфигурации = 0;
					// Вычисление максимальной длины свойств для выравнивания.
					Для Каждого Строка Из КоллекцияПКС Цикл
						Если СтрДлина(СокрЛП(Строка.СвойствоКонфигурации)) > МаксДлинаСвойствоКонфигурации Тогда
							МаксДлинаСвойствоКонфигурации = СтрДлина(СокрЛП(Строка.СвойствоКонфигурации));
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Для Каждого Строка Из КоллекцияПКС Цикл
					Если ПустаяСтрока(СокрЛП(Строка.СвойствоКонфигурации)) И ПустаяСтрока(СокрЛП(Строка.СвойствоФормата)) Тогда
						Продолжить;
					КонецЕсли;
					Если ВерсияФорматаМенеджера = "1" Тогда
						ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();");
						Если ЗначениеЗаполнено(Строка.СвойствоКонфигурации) Тогда
							ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.СвойствоКонфигурации = """ + Строка.СвойствоКонфигурации + """;");
						КонецЕсли;
						Если ЗначениеЗаполнено(Строка.СвойствоФормата) Тогда
							ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.СвойствоФормата = """ + Строка.СвойствоФормата + """;");
						КонецЕсли;
						Если Строка.ИспользуетсяАлгоритмКонвертации Тогда
							ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;");
						КонецЕсли;
						Если ЗначениеЗаполнено(Строка.ПравилоКонвертацииСвойства) Тогда
							ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.ПравилоКонвертацииСвойства = """ + Строка.ПравилоКонвертацииСвойства + """;");
						КонецЕсли;
						ЗаполнениеПКС.ДобавитьСтроку("");
					Иначе
						ОтступСвойствоФормата = "";
						Для СчетчикПробелов = 1 По МаксДлинаСвойствоКонфигурации - СтрДлина(СокрЛП(Строка.СвойствоКонфигурации)) Цикл
							ОтступСвойствоФормата = ОтступСвойствоФормата + " ";
						КонецЦикла;
						ПараметрИспользуетсяАлгоритм = ?(Строка.ИспользуетсяАлгоритмКонвертации,"1","");
						СтрокаДобавлениеПКС = "ДобавитьПКС(СвойстваШапки, "  
										+ """" + СокрЛП(Строка.СвойствоКонфигурации) + """, " + ОтступСвойствоФормата
										+ """" + СокрЛП(Строка.СвойствоФормата) + """";
						Если НЕ ПустаяСтрока(ПараметрИспользуетсяАлгоритм) Или НЕ ПустаяСтрока(Строка.ПравилоКонвертацииСвойства) Тогда
							СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ", " + ?(ПустаяСтрока(ПараметрИспользуетсяАлгоритм),"",ПараметрИспользуетсяАлгоритм);
							СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ?(ПустаяСтрока(Строка.ПравилоКонвертацииСвойства),"",
											", """ + СокрЛП(Строка.ПравилоКонвертацииСвойства) + """");
						КонецЕсли;
						СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ");";
						ЗаполнениеПКС.ДобавитьСтроку(СтрокаДобавлениеПКС); 
					КонецЕсли;
				КонецЦикла;
				ЗаполнениеПКСТекст = ДобавитьОтступыВСтроку(ЗаполнениеПКС.ПолучитьТекст());
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПКС", ЗаполнениеПКСТекст);
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПКС", "---");
			КонецЕсли;
			
			ЗаполнениеПКС = Новый ТекстовыйДокумент;
			КоллекцияПКС_ТЧ = ТабПКС_ТЧСвод.НайтиСтроки(Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка));
			Если КоллекцияПКС_ТЧ.Количество() > 0 Тогда
				ТаблицаГруппировок = Новый ТаблицаЗначений;
				ТаблицаГруппировок.Колонки.Добавить("ГруппаСвойствФормата");
				ТаблицаГруппировок.Колонки.Добавить("ГруппаСвойствКонфигурации");
				ТаблицаГруппировок.Колонки.Добавить("ПрямаяКонвертация");
				МаксДлинаИмяТЧКонфигурации = 0;
				Для Каждого Строка_ТЧ Из КоллекцияПКС_ТЧ Цикл
					СтрокаГруппировки = ТаблицаГруппировок.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаГруппировки, Строка_ТЧ);
					Если СтрДлина(СокрЛП(Строка_ТЧ.ГруппаСвойствКонфигурации)) > МаксДлинаИмяТЧКонфигурации Тогда
						МаксДлинаИмяТЧКонфигурации = СтрДлина(СокрЛП(Строка_ТЧ.ГруппаСвойствКонфигурации));
					КонецЕсли;
				КонецЦикла;
				ИмяКлючевойГруппы = "";
				ИмяКлючевогоСвойства = "";
				Если ВыборкаПоНаправлению.Направление = 0 Тогда
					ИмяКлючевойГруппы = "ГруппаСвойствФормата";
					ИмяКлючевогоСвойства = "СвойствоФормата";
					ТаблицаГруппировок.Сортировать("ГруппаСвойствФормата, ПрямаяКонвертация убыв");
				ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
					ИмяКлючевойГруппы = "ГруппаСвойствКонфигурации";
					ИмяКлючевогоСвойства = "СвойствоКонфигурации";
					ТаблицаГруппировок.Сортировать("ГруппаСвойствКонфигурации, ПрямаяКонвертация убыв");
				Иначе
					ТаблицаГруппировок.Сортировать("ПрямаяКонвертация убыв, ГруппаСвойствКонфигурации, ГруппаСвойствФормата");
				КонецЕсли;
				ТекКлючеваяГруппа = "";
				ПерваяТЧ = Истина;
				Для Каждого Строка_ТЧ Из ТаблицаГруппировок Цикл
					Если ИмяКлючевойГруппы <> "" Тогда
						КлючеваяГруппа = Строка_ТЧ[ИмяКлючевойГруппы];
					Иначе
						КлючеваяГруппа = "" + Строка_ТЧ.ГруппаСвойствФормата  + "_" + Строка_ТЧ.ГруппаСвойствКонфигурации;
					КонецЕсли;
					Если ТекКлючеваяГруппа <> КлючеваяГруппа Тогда
						ТекКлючеваяГруппа = КлючеваяГруппа;
						ОтступТЧФормата = "";
						Для СчетчикПробелов = 1 По МаксДлинаИмяТЧКонфигурации - СтрДлина(СокрЛП(Строка_ТЧ.ГруппаСвойствКонфигурации)) Цикл
							ОтступТЧФормата = ОтступТЧФормата + " ";
						КонецЦикла;
						Если ПерваяТЧ Тогда
							ПерваяТЧ = Ложь;
						Иначе
							ЗаполнениеПКС.ДобавитьСтроку("");
						КонецЕсли; 
						Если ВерсияФорматаМенеджера = "1" Тогда
							Если ВыборкаПоНаправлению.Направление = 0 Тогда
								ТекТЧ = СокрЛП(Строка_ТЧ.ГруппаСвойствФормата);
							ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
								ТекТЧ = СокрЛП(Строка_ТЧ.ГруппаСвойствКонфигурации);
							Иначе
								ТекТЧ = ?(ЗначениеЗаполнено(СокрЛП(Строка_ТЧ.ГруппаСвойствФормата)), СокрЛП(Строка_ТЧ.ГруппаСвойствФормата), СокрЛП(Строка_ТЧ.ГруппаСвойствКонфигурации));
							КонецЕсли;
							ЗаполнениеПКС.ДобавитьСтроку("ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить(""" + ТекТЧ + """, ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());");
							ЗаполнениеПКС.ДобавитьСтроку("СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей." + ТекТЧ + ";");
							ЗаполнениеПКС.ДобавитьСтроку("");
						Иначе
							СтрокаЗаполнениеПКС = "СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "
									+ """" + СокрЛП(Строка_ТЧ.ГруппаСвойствКонфигурации) + """, " + ОтступТЧФормата
									+ """" + СокрЛП(Строка_ТЧ.ГруппаСвойствФормата) + """);";
							ЗаполнениеПКС.ДобавитьСтроку(СтрокаЗаполнениеПКС);
						КонецЕсли;
						
						СтруктураПоискаПКС = Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка);
						Если ИмяКлючевойГруппы = "" Тогда
							СтруктураПоискаПКС.Вставить("ГруппаСвойствФормата", Строка_ТЧ.ГруппаСвойствФормата);
							СтруктураПоискаПКС.Вставить("ГруппаСвойствКонфигурации", Строка_ТЧ.ГруппаСвойствКонфигурации);
						Иначе
							СтруктураПоискаПКС.Вставить(ИмяКлючевойГруппы, КлючеваяГруппа);
						КонецЕсли;
						КоллекцияПКС = ТабПКС_ТЧ.НайтиСтроки(СтруктураПоискаПКС);
						ТаблицаПКС = Новый ТаблицаЗначений;
						ТаблицаПКС.Колонки.Добавить("СвойствоКонфигурации");
						ТаблицаПКС.Колонки.Добавить("СвойствоФормата");
						ТаблицаПКС.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации");
						ТаблицаПКС.Колонки.Добавить("ПравилоКонвертацииСвойства");
						ТаблицаПКС.Колонки.Добавить("НомерСтроки");
						МаксДлинаСвойствоКонфигурации = 0;
						Для Каждого Строка Из КоллекцияПКС Цикл
							СтрокаПКС = ТаблицаПКС.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаПКС, Строка);
							Если СтрДлина(СокрЛП(Строка.СвойствоКонфигурации)) > МаксДлинаСвойствоКонфигурации Тогда
								МаксДлинаСвойствоКонфигурации = СтрДлина(СокрЛП(Строка.СвойствоКонфигурации));
							КонецЕсли;
						КонецЦикла;
						Если ЗначениеЗаполнено(ИмяКлючевогоСвойства) Тогда
							ТаблицаПКС.Сортировать(ИмяКлючевогоСвойства + ",НомерСтроки");
						Иначе
							ТаблицаПКС.Сортировать("НомерСтроки");
						КонецЕсли;
						Для Каждого Строка Из ТаблицаПКС Цикл
							Если ВерсияФорматаМенеджера = "1" Тогда
								ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока = СвойстваТЧ.Добавить();");
								Если ЗначениеЗаполнено(Строка.СвойствоКонфигурации) Тогда
									ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.СвойствоКонфигурации = """ + Строка.СвойствоКонфигурации + """;");
								КонецЕсли;

								Если ЗначениеЗаполнено(Строка.СвойствоФормата) Тогда
									ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.СвойствоФормата = """ + Строка.СвойствоФормата + """;");
								КонецЕсли;
								Если Строка.ИспользуетсяАлгоритмКонвертации Тогда
									ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;");
								КонецЕсли;
								Если ЗначениеЗаполнено(Строка.ПравилоКонвертацииСвойства) Тогда
									ЗаполнениеПКС.ДобавитьСтроку("НоваяСтрока.ПравилоКонвертацииСвойства = """ + Строка.ПравилоКонвертацииСвойства + """;");
								КонецЕсли;
								ЗаполнениеПКС.ДобавитьСтроку("");
							Иначе
								ОтступСвойствоФормата = "";
								Для СчетчикПробелов = 1 По МаксДлинаСвойствоКонфигурации - СтрДлина(СокрЛП(Строка.СвойствоКонфигурации)) Цикл
									ОтступСвойствоФормата = ОтступСвойствоФормата + " ";
								КонецЦикла;
								ПараметрИспользуетсяАлгоритм = ?(Строка.ИспользуетсяАлгоритмКонвертации,"1","");
								СтрокаДобавлениеПКС = "ДобавитьПКС(СвойстваТЧ, "  
								+ """" + СокрЛП(Строка.СвойствоКонфигурации) + """, " + ОтступСвойствоФормата
								+ """" + СокрЛП(Строка.СвойствоФормата) + """";
								Если НЕ ПустаяСтрока(ПараметрИспользуетсяАлгоритм) Или НЕ ПустаяСтрока(Строка.ПравилоКонвертацииСвойства) Тогда
									СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ", " + ?(ПустаяСтрока(ПараметрИспользуетсяАлгоритм),"",ПараметрИспользуетсяАлгоритм);
									СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ?(ПустаяСтрока(Строка.ПравилоКонвертацииСвойства),"",
									", """ + СокрЛП(Строка.ПравилоКонвертацииСвойства) + """");
								КонецЕсли;
								СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ");";
								ЗаполнениеПКС.ДобавитьСтроку(СтрокаДобавлениеПКС);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				ЗаполнениеПКСТекст = ДобавитьОтступыВТекстовыйДокумент(ЗаполнениеПКС);
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеТЧПКС", ЗаполнениеПКСТекст);
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеТЧПКС", "");
			КонецЕсли;
			ЗаполнениеПолейПоиска = Новый ТекстовыйДокумент;
			КоллекцияПолейПоиска = ТабПолейПоиска.НайтиСтроки(Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка));
			Если КоллекцияПолейПоиска.Количество() > 0 Тогда
				Для Каждого Строка Из КоллекцияПолейПоиска Цикл
					СтрокаПолейПоиска = """" + СокрЛП(Строка.РеквизитыПоиска) + """";
					ЗаполнениеПолейПоиска.ДобавитьСтроку("ПравилоКонвертации.ПоляПоиска.Добавить(""" + Строка.РеквизитыПоиска+""");");
				КонецЦикла;
				ЗаполнениеПолейПоискаТекст = ДобавитьОтступыВСтроку(ЗаполнениеПолейПоиска.ПолучитьТекст());
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПолейПоиска", ЗаполнениеПолейПоискаТекст);
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПолейПоиска", "---");
			КонецЕсли;
			
			ТекстОбработчики = "";
			Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
				ДобавитьОбработчикиВТекстМодуля(ПараметрыФормированияОбработчиков("ПКО", "ПриОтправкеДанных", ТегСлужебный, ТегЛокализации),
					ВыборкаДетальная, ТекстОбработчики, МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика);
			КонецЕсли;
			Если ВыборкаДетальная.ИспользоватьДляПолучения Тогда
				ДобавитьОбработчикиВТекстМодуля(ПараметрыФормированияОбработчиков("ПКО", "ПриКонвертацииДанныхXDTO", ТегСлужебный, ТегЛокализации), 
					ВыборкаДетальная, ТекстОбработчики, МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика);
				ДобавитьОбработчикиВТекстМодуля(ПараметрыФормированияОбработчиков("ПКО", "ПередЗаписьюПолученныхДанных", ТегСлужебный, ТегЛокализации),
					ВыборкаДетальная, ТекстОбработчики, МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекстОбработчики) Тогда
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбработчикиПКО", ТекстОбработчики);
			Иначе
				ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбработчикиПКО", "---");
			КонецЕсли;
			Если ТегСлужебный <> "" Тогда
				ОбластьПКОТекст = ОбластьПКОТекст + Символы.ПС + "//--" + ТегСлужебный;
			КонецЕсли;
			Если ТегЛокализации <> "" Тогда
				ОбластьПКОТекст = ОбластьПКОТекст + Символы.ПС + "//-- " + ТегЛокализации;
			КонецЕсли;

			РазделПравил.ДобавитьСтроку(ОбластьПКОТекст);
			
		КонецЦикла;
		РазделПравил.УстановитьТекст(РазделПравил.ПолучитьТекст() + "#КонецОбласти"); // Разбивка по направлениям.
		
	КонецЦикла;
	
	ВсяПроцедура.ДобавитьСтроку(РазделПравил.ПолучитьТекст());
	
	Возврат ВсяПроцедура.ПолучитьТекст();
	
КонецФункции

Функция ЗаполнитьТекстПроцедурыПКПД(МакетТекстовМодулей)
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииПредопределенныхДанных");
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииПредопределенныхДанных");
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("ПравилаКонвертацииПредопределенныхДанных");
	КонецЕсли;
	
	ОбластьКомментарий = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПроцедурыПКПД_Комментарий");
	ТекстПроцедуры.Вывести(ОбластьКомментарий);
	
	ОбластьШапки = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ЗаполнитьПравилаКонвертацииПредопределенныхДанных_Заголовок");
	ТекстПроцедуры.Вывести(ОбластьШапки);
	
	ЗапросПКО = Новый Запрос;
	ЗапросПКО.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка 
	|ПОМЕСТИТЬ КОбработке
	|ИЗ (" + КОбработке + ") КАК Свод
	|;
	|ВЫБРАТЬ
	|	ПКПД.Ссылка КАК Ссылка,
	|	ПКПД.Код КАК Наименование,
	|	ПКПД.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	ПКПД.ОбъектФормата КАК ОбъектФормата,
	|	ПКПД.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
	|	ПКПД.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
	|	ОК.Тип КАК ТипДанных
	|ПОМЕСТИТЬ ВсеПравила
	|ИЗ
	|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПКПД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОК
	|		ПО ПКПД.ОбъектКонфигурации = ОК.Наименование
	|			И ОК.Владелец = &Конфигурация
	|ГДЕ
	|	ПКПД.ПометкаУдаления = ЛОЖЬ И ПКПД.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПравила.Ссылка,
	|	ВсеПравила.Наименование,
	|	ВсеПравила.ОбъектКонфигурации,
	|	ВсеПравила.ОбъектФормата,
	|	ВсеПравила.ИспользоватьДляОтправки,
	|	ВсеПравила.ИспользоватьДляПолучения,
	|	ВсеПравила.ТипДанных
	|ИЗ
	|	ВсеПравила КАК ВсеПравила
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|		ПО (СоставыКонвертаций.ЭлементКонвертации = ВсеПравила.Ссылка)
	|			И (СоставыКонвертаций.Владелец = &Конвертация)
	|			И (СоставыКонвертаций.Отключить = ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВсеПравила.Наименование";

	ЗапросПКО.УстановитьПараметр("Конфигурация", Конвертация.Конфигурация);
	ЗапросПКО.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросПКО.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	ТекстДляОтправки = Новый ТекстовыйДокумент;
	ТекстДляПолучения = Новый ТекстовыйДокумент;
	ТекстОбщий = Новый ТекстовыйДокумент;

	
	Выборка = ЗапросПКО.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТегСлужебный = ОпределитьСлужебныйТег(Выборка.Ссылка);
		ТегЛокализации = ОпределитьТегЛокализации(Выборка.Ссылка);

		ОбластьСтрока = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ЗаполнитьПравилаКонвертацииПредопределенныхДанных_СтрокаПравила");
		ОбластьСтрокаТекст = ОбластьСтрока.ПолучитьТекст();
		
		Если ТегСлужебный <> "" Тогда
			ОбластьСтрокаТекст = "//++" + ТегСлужебный + Символы.ПС + ОбластьСтрокаТекст;
		КонецЕсли;
		
		Если ТегЛокализации <> "" Тогда
			ОбластьСтрокаТекст = "//++ " + ТегЛокализации + Символы.ПС + ОбластьСтрокаТекст;
		КонецЕсли;
		
		ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "#Область Конвертация_ЗаполнитьПравилаКонвертацииПредопределенныхДанных_СтрокаПравила", "");
		ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "[Наименование]", СокрЛП(Выборка.Наименование));
		ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "[ОбъектФормата]", СокрЛП(Выборка.ОбъектФормата));
		
		ОбъектДанных = ПолучитьТипМетаданные(Выборка.ТипДанных, Выборка.ОбъектКонфигурации);
		ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "[ОбъектДанных]", ОбъектДанных);
		// Правила конвертации значений.
		ТекстЗначенияДляОтправки = Символы.Таб + "ЗначенияДляОтправки = Новый Соответствие;";
		ТекстЗначенияДляПолучения = Символы.Таб + "ЗначенияДляПолучения = Новый Соответствие;";
		ТаблицаСопоставления = Выборка.Ссылка.СопоставлениеЗначений.Выгрузить();
		ТаблицаСопоставления.Сортировать("ЗначениеКонфигурации, ЗначениеФормата");
		Для Каждого ПКЗ Из ТаблицаСопоставления Цикл
			СтрокаЗначениеМетаданных = ПолучитьТипМетаданные(Выборка.ТипДанных, Выборка.ОбъектКонфигурации, Истина)
							+ "." + СокрЛП(ПКЗ.ЗначениеКонфигурации);
			СтрокаЗначениеФормата = """"+СокрЛП(ПКЗ.ЗначениеФормата)+"""";
			Если Выборка.ИспользоватьДляОтправки Тогда
				ТекстЗначенияДляОтправки = ТекстЗначенияДляОтправки + Символы.ПС + Символы.Таб
					+ "ЗначенияДляОтправки.Вставить(" + СтрокаЗначениеМетаданных + ", " 
					+ СтрокаЗначениеФормата + ");";
			КонецЕсли;
			Если Выборка.ИспользоватьДляПолучения Тогда
				ТекстЗначенияДляПолучения = ТекстЗначенияДляПолучения + Символы.ПС + Символы.Таб
					+ "ЗначенияДляПолучения.Вставить(" + СтрокаЗначениеФормата + ", "
					+  СтрокаЗначениеМетаданных + ");";
			КонецЕсли;
		КонецЦикла;
		ТекстЗначенияДляОтправки = ТекстЗначенияДляОтправки + Символы.ПС + Символы.Таб 
			+ "ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;";
		ТекстЗначенияДляПолучения = ТекстЗначенияДляПолучения + Символы.ПС + Символы.Таб 
			+ "ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;";
		Если Выборка.ИспользоватьДляОтправки И Выборка.ИспользоватьДляПолучения Тогда
			ТекстОбщий.ДобавитьСтроку(ОбластьСтрокаТекст);
			ТекстОбщий.ДобавитьСтроку(ТекстЗначенияДляОтправки);
			ТекстОбщий.ДобавитьСтроку(ТекстЗначенияДляПолучения);
			Если ТегСлужебный <> "" Тогда
				ТекстОбщий.ДобавитьСтроку("//--" + ТегСлужебный);
			КонецЕсли;
			Если ТегЛокализации <> "" Тогда
				ТекстОбщий.ДобавитьСтроку("//-- " + ТегЛокализации);
			КонецЕсли;
		ИначеЕсли Выборка.ИспользоватьДляОтправки Тогда
			ТекстДляОтправки.ДобавитьСтроку(ОбластьСтрокаТекст);
			ТекстДляОтправки.ДобавитьСтроку(ТекстЗначенияДляОтправки);
			Если ТегСлужебный <> "" Тогда
				ТекстДляОтправки.ДобавитьСтроку("//--" + ТегСлужебный);
			КонецЕсли;
			Если ТегЛокализации <> "" Тогда
				ТекстДляОтправки.ДобавитьСтроку("//-- " + ТегЛокализации);
			КонецЕсли;
		Иначе
			ТекстДляПолучения.ДобавитьСтроку(ОбластьСтрокаТекст);
			ТекстДляПолучения.ДобавитьСтроку(ТекстЗначенияДляПолучения);
			Если ТегСлужебный <> "" Тогда
				ТекстДляПолучения.ДобавитьСтроку("//--" + ТегСлужебный);
			КонецЕсли;
			Если ТегЛокализации <> "" Тогда
				ТекстДляПолучения.ДобавитьСтроку("//-- " + ТегЛокализации);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ДополнитьТекстПроцедурыСУсловиями(ТекстПроцедуры, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий);

	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");

	Возврат ТекстПроцедуры.ПолучитьТекст();

КонецФункции

Функция ЗаполнитьТекстПроцедурыАлгоритмы(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика)
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	ОбластьКомментарий = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Алгоритмы_Комментарий");
	ТекстКомментарий = СтрЗаменить(ОбластьКомментарий.ПолучитьТекст(), "#Область Конвертация_Алгоритмы_Комментарий","");
	ТекстПроцедуры.ДобавитьСтроку(ТекстКомментарий);
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("Алгоритмы");
			КОбработкеПКО = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов");
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("Алгоритмы");
			КОбработкеПКО = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов");
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("Алгоритмы");
		КОбработкеПКО = ТекстЗапросаБезСовместнойРаботы("ПравилаКонвертацииОбъектов");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПравилаКонвертацииОбъектов.АлгоритмПослеЗагрузкиВсехДанных КАК Код
	|ПОМЕСТИТЬ АлгоритмыОтложеннойОбработки
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Код
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка 
	|ПОМЕСТИТЬ КОбработке
	|ИЗ (" + КОбработке + ") КАК Свод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Алгоритмы.Код КАК Код,
	|	Алгоритмы.Параметры КАК Параметры,
	|	Алгоритмы.Алгоритм КАК Алгоритм,
	|	Алгоритмы.ЭтоФункция КАК ЭтоФункция,
	|	Алгоритмы.Экспортный КАК Экспортный, 
	|	Алгоритмы.Комментарий КАК Комментарий,
	|	Алгоритмы.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА АлгоритмыОтложеннойОбработки.Код ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоАлгоритмПослеЗагрузкиВсехДанных
	|ИЗ
	|	Справочник.Алгоритмы КАК Алгоритмы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|		ПО Алгоритмы.Ссылка = СоставыКонвертаций.ЭлементКонвертации
	|			И (СоставыКонвертаций.Владелец = &Конвертация)
	|			И (СоставыКонвертаций.Отключить = ЛОЖЬ)
	|			И (Алгоритмы.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ АлгоритмыОтложеннойОбработки КАК АлгоритмыОтложеннойОбработки
	|		ПО Алгоритмы.Код = АлгоритмыОтложеннойОбработки.Код
	|ГДЕ Алгоритмы.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|;
	|ВЫБРАТЬ
	|	Код,
	|	Количество(Ссылка) КАК Количество
	|ИЗ
	|	Справочник.Алгоритмы КАК Алгоритмы
	|ГДЕ Алгоритмы.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|СГРУППИРОВАТЬ ПО Код
	|ИМЕЮЩИЕ Количество(Ссылка) > 1
	|";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());

	Результат = Запрос.ВыполнитьПакет();
	КоличествоТаблиц = Результат.Количество();
	ВыборкаДубли = Результат[КоличествоТаблиц - 1].Выбрать();
	Пока ВыборкаДубли.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю("Обнаружены алгоритмы с одинаковыми именами: " + ВыборкаДубли.Код);
	КонецЦикла;
	Выборка = Результат[КоличествоТаблиц - 2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ТегСлужебный = ОпределитьСлужебныйТег(Выборка.Ссылка);
		ТегЛокализации = ОпределитьТегЛокализации(Выборка.Ссылка);
		
		Если ТегЛокализации <> "" Тогда
			ТекстПроцедуры.ДобавитьСтроку("//++ " + ТегЛокализации);
		КонецЕсли;
		Если ТегСлужебный <> "" Тогда
			ТекстПроцедуры.ДобавитьСтроку("//++"+ТегСлужебный);
		КонецЕсли; 
		Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
			ТекстПроцедуры.ДобавитьСтроку(Выборка.Комментарий);
		КонецЕсли;

		ТекстПроцедуры.ДобавитьСтроку(?(Выборка.ЭтоФункция, "Функция ", "Процедура ") + СокрЛП(Выборка.Код) + "("
			+ СокрЛП(Выборка.Параметры)+")" + ?(Выборка.Экспортный," Экспорт",""));
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.Алгоритм));
		ТекстПроцедуры.ДобавитьСтроку(?(Выборка.ЭтоФункция, "КонецФункции", "КонецПроцедуры"));
		Если ТегСлужебный <> "" Тогда
			ТекстПроцедуры.ДобавитьСтроку("//--"+ТегСлужебный);
		КонецЕсли;
		Если ТегЛокализации <> "" Тогда
			ТекстПроцедуры.ДобавитьСтроку("//-- "+ТегЛокализации);
		КонецЕсли;

		Если Выборка.ЭтоАлгоритмПослеЗагрузкиВсехДанных Тогда
			
			ТекстПараметрыВызова = Выборка.Параметры;
			НовыйМассивПараметров = Новый Массив;
			МассивПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПараметрыВызова, ",");
			Для Каждого ПараметрСтрокой Из МассивПараметров Цикл
				Если НРЕГ(СокрЛП(ПараметрСтрокой)) = НРег("ПараметрыКонвертации") Тогда
					ПараметрСтрокойПолный = "Параметры.КомпонентыОбмена." + СокрЛП(ПараметрСтрокой);
				Иначе
					ПараметрСтрокойПолный = "Параметры." + СокрЛП(ПараметрСтрокой);
				КонецЕсли;
				НовыйМассивПараметров.Добавить(ПараметрСтрокойПолный);
			КонецЦикла;
			ТекстПараметрыВызова = СтрСоединить(НовыйМассивПараметров, ", ");
			
			ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика
				+ ?(ТекстПроцедурыВызоваОбработчика = "", "Если ","")
				+ ?(ТегЛокализации = "","",Символы.ПС + "//++ "+ТегЛокализации)
				+ ?(ТегСлужебный = "","",Символы.ПС + "//++"+ТегСлужебный)
				+ ?(ТекстПроцедурыВызоваОбработчика = "", "", Символы.ПС + "ИначеЕсли ")
				+ "ИмяПроцедуры = """ + СокрЛП(Выборка.Код) + """ Тогда " + Символы.ПС + Символы.Таб
				+ СокрЛП(Выборка.Код) + "(" + Символы.ПС + Символы.Таб + Символы.Таб + ТекстПараметрыВызова + ");"
				+ ?(ТегСлужебный = "","",Символы.ПС + "//--"+ТегСлужебный)
				+ ?(ТегЛокализации = "", "", Символы.ПС + "//-- " + ТегЛокализации)
				+ Символы.ПС;
		КонецЕсли;
			
	КонецЦикла;
	Возврат ТекстПроцедуры.ПолучитьТекст();

КонецФункции

Функция ЗаполнитьТекстПроцедурыПараметры(МакетТекстовМодулей)
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	ОбластьКомментарий = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Параметры_Комментарий");
	ТекстПроцедуры.Вывести(ОбластьКомментарий);
	
	ОбластьШапки = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ЗаполнитьПараметрыКонвертации_Заголовок");
	ТекстПроцедуры.Вывести(ОбластьШапки);

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|Параметр КАК Параметр
	|ИЗ Справочник.Конвертации.Параметры
	|ГДЕ Ссылка = &Конвертация 
	|УПОРЯДОЧИТЬ ПО НомерСтроки
	|";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстПроцедуры.ДобавитьСтроку(Символы.Таб
		+ "ПараметрыКонвертации.Вставить(" + """" + СокрЛП(Выборка.Параметр) + """" + ");");
	КонецЦикла;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	Возврат ТекстПроцедуры.ПолучитьТекст();

КонецФункции

Функция ЗаполнитьТекстПроцедурыОбщие(МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика, ТекстФункцииВызоваОбработчика = "")
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	ОбластьКомментарий = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Общие_Комментарий");
	ТекстПроцедуры.Вывести(ОбластьКомментарий);
	
	ЗаголовокПроцедуры = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПроцедураВызоваОбработчика_Заголовок");
	ТекстПроцедуры.Вывести(ЗаголовокПроцедуры);
	Если ЗначениеЗаполнено(ТекстПроцедурыВызоваОбработчика) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(ТекстПроцедурыВызоваОбработчика));
		ТекстПроцедуры.ДобавитьСтроку(Символы.Таб + "КонецЕсли;");
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");

	Если ТекстФункцииВызоваОбработчика <> "" Тогда
		ЗаголовокПроцедуры = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ФункцияВызоваОбработчика_Заголовок");
		ТекстПроцедуры.Вывести(ЗаголовокПроцедуры);
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(ТекстФункцииВызоваОбработчика));
		ТекстПроцедуры.ДобавитьСтроку(Символы.Таб + "КонецЕсли;"+ Символы.ПС+"КонецФункции");
	КонецЕсли;
	
	Возврат ТекстПроцедуры.ПолучитьТекст();

КонецФункции

Функция ПараметрыФормированияОбработчиков(ВидПравил, ИмяОбработчика, ТегСлужебный = "", ТегЛокализации = "")
	Параметры = Новый Структура("ВидПравил, ИмяОбработчика, ТегСлужебный, ТегЛокализации",
					ВидПравил, ИмяОбработчика, ТегСлужебный, ТегЛокализации);
	Возврат Параметры;
КонецФункции

Процедура ДобавитьОбработчикиВТекстМодуля(ПараметрыФормирования, Выборка, ТекстОбработчики, МакетТекстовМодулей, ТекстПроцедурыВызоваОбработчика, ТекстФункцииВызоваОбработчика = "")
	ВидПравил = ПараметрыФормирования.ВидПравил;
	ИмяОбработчика = ПараметрыФормирования.ИмяОбработчика;
	ТегСлужебный = ПараметрыФормирования.ТегСлужебный;
	ТегЛокализации = ПараметрыФормирования.ТегЛокализации;
	
	ИмяПроцедуры = "";
	Если СокрЛП(Выборка[ИмяОбработчика]) <> "" Тогда
		ИмяПроцедуры = ВидПравил+"_"+СокрЛП(Выборка.Код)+"_"+ИмяОбработчика;
		
		ОбластьПараметры = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Параметры_"+ВидПравил+"_"+ИмяОбработчика);
		ТекстПараметры = СтрПолучитьСтроку(ОбластьПараметры.ПолучитьТекст(),2);
		// Параметры в месте объявления процедуры (общие).
		ТекстПараметрыПроцедуры = СтрЗаменить(ТекстПараметры, "_", "");
		
		Если ВидПравил = "ПОД" Тогда
			ИмяПараметра = ?(Выборка.ИспользоватьДляОтправки, "ДанныеИБ", "ДанныеXDTO");
			ТекстПараметрыПроцедуры = СтрЗаменить(ТекстПараметрыПроцедуры, "ОбъектОбработки", ИмяПараметра);
		КонецЕсли;
		
		// Параметры в месте вызова процедуры.
		ТекстПараметрыВызова = СтрЗаменить(ТекстПараметры, "_", "Параметры.");
		ТекстПараметрыВызова = СтрЗаменить(ТекстПараметрыВызова, "(", "(" + Символы.ПС + Символы.Таб + Символы.Таб);
		// Возможно, есть произвольные комментарии.
		Комментарий = РегистрыСведений.КомментарииКОбработчикам.ПрочитатьКомментарийКОбработчику(Выборка.Ссылка, ИмяОбработчика);
		Если ЗначениеЗаполнено(Комментарий) Тогда
			ТекстОбработчики = ТекстОбработчики + Символы.ПС + Комментарий;
		КонецЕсли;
		
		Если ИмяОбработчика = "ВыборкаДанных" Тогда
			
			ТекстОбработчики = ТекстОбработчики + Символы.ПС + ?(ТекстОбработчики <> "", Символы.ПС,"") 
				+ "Функция " + ИмяПроцедуры + ТекстПараметрыПроцедуры 
				+ Символы.ПС + ДобавитьОтступыВСтроку(Выборка[ИмяОбработчика])
				+ Символы.ПС + "КонецФункции";
			ТекстФункцииВызоваОбработчика = ТекстФункцииВызоваОбработчика 
				+ ?(ТекстФункцииВызоваОбработчика = "", "Если ", "")
				+ ?(ТегЛокализации = "", "", Символы.ПС + "//++ " + ТегЛокализации)
				+ ?(ТегСлужебный = "", "", Символы.ПС + "//++"+ТегСлужебный)
				+ ?(ТекстФункцииВызоваОбработчика = "", "",Символы.ПС + "ИначеЕсли ")
				+ "ИмяФункции = """ + ИмяПроцедуры + """ Тогда " + Символы.ПС + Символы.Таб
				+ "Возврат " + ИмяПроцедуры + ТекстПараметрыВызова + ";"
				+ ?(ТегСлужебный = "", "", Символы.ПС + "//--"+ТегСлужебный)
				+ ?(ТегЛокализации = "", "", Символы.ПС + "//-- " + ТегЛокализации)
				+ Символы.ПС;
		Иначе
			
			ТекстОбработчика = Выборка[ИмяОбработчика];
			ПриВыгрузкеОбработчика(ИмяОбработчика, ТекстОбработчика, Выборка.ОбъектКонфигурации);
			
			ТекстОбработчики = ТекстОбработчики + Символы.ПС + ?(ТекстОбработчики <> "", Символы.ПС,"")
				+ "Процедура " + ИмяПроцедуры + ТекстПараметрыПроцедуры 
				+ Символы.ПС + ДобавитьОтступыВСтроку(ТекстОбработчика)
				+ Символы.ПС + "КонецПроцедуры";
			ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика 
				+ ?(ТекстПроцедурыВызоваОбработчика = "", "Если ", "")
				+ ?(ТегЛокализации = "", "", Символы.ПС + "//++ " + ТегЛокализации)
				+ ?(ТегСлужебный = "", "", Символы.ПС + "//++"+ТегСлужебный)
				+ ?(ТекстПроцедурыВызоваОбработчика = "", "", Символы.ПС + "ИначеЕсли ")
				+ "ИмяПроцедуры = """ + ИмяПроцедуры + """ Тогда " + Символы.ПС + Символы.Таб
				+ ИмяПроцедуры + ТекстПараметрыВызова + ";"
				+ ?(ТегСлужебный = "", "", Символы.ПС + "//--"+ТегСлужебный)
				+ ?(ТегЛокализации = "", "", Символы.ПС + "//-- " + ТегЛокализации)
				+ Символы.ПС;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыгрузкеОбработчика(ИмяОбработчика, ТекстОбработчика, ОбъектКонфигурацииСтрокой)
	Если Не ВыгрузкаДляРасширенногоСинтаксическогоКонтроля Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектКонфигурацииСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяОбработчика = "ПриОтправкеДанных"
		Или ИмяОбработчика = "ПередЗаписьюПолученныхДанных"
		Или ИмяОбработчика = "ПриОбработке" Тогда
		
			Если Найти(ОбъектКонфигурацииСтрокой, "ДокументСсылка.") > 0 Тогда
				ТекстОбработчика = "ДанныеИБ = Документы." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "ДокументСсылка.", "")
					+ ".СоздатьДокумент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			ИначеЕсли Найти(ОбъектКонфигурацииСтрокой, "СправочникСсылка.") > 0 Тогда
				ТекстОбработчика = "ДанныеИБ = Справочники." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "СправочникСсылка.", "")
					+ ".СоздатьЭлемент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			КонецЕсли;
	КонецЕсли;
		
	Если ИмяОбработчика = "ПриКонвертацииДанныхXDTO"
		Или ИмяОбработчика = "ПередЗаписьюПолученныхДанных" Тогда
		
		Если Найти(ОбъектКонфигурацииСтрокой, "ДокументСсылка.") > 0 Тогда
				ТекстОбработчика = "ПолученныеДанные = Документы." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "ДокументСсылка.", "")
					+ ".СоздатьДокумент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			ИначеЕсли Найти(ОбъектКонфигурацииСтрокой, "СправочникСсылка.") > 0 Тогда
				ТекстОбработчика = "ПолученныеДанные = Справочники." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "СправочникСсылка.", "")
					+ ".СоздатьЭлемент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТипМетаданные(ТипОбъектаВыборки, ОбъектВыборки, БезМетаданных = Ложь)
	Если СокрЛП(ОбъектВыборки) = "" Тогда
		Возврат "Неопределено";
	КонецЕсли;
	
	Если БезМетаданных Тогда
		ТипМетаданные = "";
	Иначе
		ТипМетаданные = "Метаданные.";
	КонецЕсли;
	
	ИмяОбъекта = СокрЛП(ОбъектВыборки);
	ИмяОбъекта = Прав(ИмяОбъекта, СтрДлина(ИмяОбъекта) - Найти(ИмяОбъекта,"."));
	Если ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Справочник
		Или Найти(НРег(ОбъектВыборки), НРег("СправочникСсылка.")) > 0 Тогда
		ТипОбъекта = "Справочники";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Документ
		Или Найти(НРег(ОбъектВыборки), НРег("ДокументСсылка.")) > 0 Тогда
		ТипОбъекта = "Документы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.БизнесПроцесс
		Или Найти(НРег(ОбъектВыборки), НРег("БизнесПроцессСсылка.")) > 0 Тогда
		ТипОбъекта = "БизнесПроцессы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Задача
		Или Найти(НРег(ОбъектВыборки), НРег("ЗадачаСсылка.")) > 0 Тогда
		ТипОбъекта = "Задачи";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.НаборКонстант
		Или Найти(НРег(ОбъектВыборки), НРег("КонстантыНабор")) > 0 Тогда
		ТипОбъекта = "Константы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или Найти(НРег(ОбъектВыборки), НРег("ПланВидовХарактеристикСсылка.")) > 0 Тогда
		ТипОбъекта = "ПланыВидовХарактеристик";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Перечисление
		Или Найти(НРег(ОбъектВыборки), НРег("ПеречислениеСсылка.")) > 0 Тогда
		ТипОбъекта = "Перечисления";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.РегистрСведений
		Или Найти(НРег(ОбъектВыборки), НРег("РегистрСведенийЗапись.")) > 0 Тогда
		ТипОбъекта = "РегистрыСведений";
	Иначе
		ТипОбъекта = "";
	КонецЕсли;
	Возврат ТипМетаданные+ТипОбъекта+"."+ИмяОбъекта;
КонецФункции

Функция ДобавитьОтступыВСтроку(СтрокаАлгоритма)
	ТекСтрокаАлгоритма = СокрЛП(СтрокаАлгоритма);
	Возврат Символы.Таб + СтрЗаменить(ТекСтрокаАлгоритма, Символы.ПС, Символы.ПС+Символы.Таб);
КонецФункции

Функция ДобавитьОтступыВТекстовыйДокумент(ИсходныйДокумент)
	ПреобразованныйДокумент = Новый ТекстовыйДокумент;
	Для Стр = 0 По ИсходныйДокумент.КоличествоСтрок() Цикл
		ТекСтрока = ИсходныйДокумент.ПолучитьСтроку(Стр);
		СтрокаСОтступом = Символы.Таб + СокрЛП(ТекСтрока);
		ПреобразованныйДокумент.ДобавитьСтроку(СтрокаСОтступом);
	КонецЦикла;
	Возврат ПреобразованныйДокумент.ПолучитьТекст();
КонецФункции

Процедура ДополнитьТекстПроцедурыСУсловиями(ТекстПроцедуры, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий)
	СтрокаТекстДляОтправки = ТекстДляОтправки.ПолучитьТекст();
	Если СокрЛП(СтрокаТекстДляОтправки) <> "" Тогда
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"Если НаправлениеОбмена = ""Отправка"" Тогда");
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+ДобавитьОтступыВСтроку(СтрокаТекстДляОтправки));
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"КонецЕсли;");
	КонецЕсли;
	СтрокаТекстДляПолучения = ТекстДляПолучения.ПолучитьТекст();
	Если СокрЛП(СтрокаТекстДляПолучения) <> "" Тогда
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"Если НаправлениеОбмена = ""Получение"" Тогда");
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+ДобавитьОтступыВСтроку(СтрокаТекстДляПолучения));
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"КонецЕсли;");
	КонецЕсли;
	СтрокаТекстОбщий = ТекстОбщий.ПолучитьТекст();
	Если СокрЛП(СтрокаТекстОбщий) <> "" Тогда
		ТекстПроцедуры.ДобавитьСтроку(СтрокаТекстОбщий);
	КонецЕсли;
КонецПроцедуры

Функция ОпределитьСлужебныйТег(ЭлементКонвертацииСсылка)
	Если ТаблицаСопоставленияКонвертаций.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	СтруктураПоиска = Новый Структура("СсылкаГК", ЭлементКонвертацииСсылка);
	РезультатПоиска = ТаблицаСопоставленияКонвертаций.НайтиСтроки(СтруктураПоиска);
	Если РезультатПоиска.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	СтрокаПоиска = РезультатПоиска[0];
	Если СтрокаПоиска.ЕстьПК = 0 Тогда
		Возврат "НЕ УТКА";
	ИначеЕсли СтрокаПоиска.ЕстьПК2 = 0 Тогда
		Возврат "НЕ УТ";
	КонецЕсли;
	Возврат "";
КонецФункции

Функция ОпределитьТегЛокализации(ЭлементКонвертацииСсылка)
	
	Если ТаблицаЛокализуемыхЭлементов.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ЭлементКонвертации", ЭлементКонвертацииСсылка);
	РезультатПоиска = ТаблицаЛокализуемыхЭлементов.НайтиСтроки(СтруктураПоиска);
	
	Если РезультатПоиска.Количество() = 0 Тогда
		Возврат "";
	Иначе
		Возврат "Локализация";
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьВызовыСТегамиВТелоПроцедуры(ТелоПроцедурыПоТегам, ТелоПроцедуры)
	КусокБезТэга = "";
	Для Каждого КлючИЗначение Из ТелоПроцедурыПоТегам Цикл
		Если КлючИЗначение.Ключ = "БезТэга" Тогда
			КусокБезТэга = КлючИЗначение.Значение.ПолучитьТекст();
			Продолжить;
		КонецЕсли;
		ТелоПроцедуры.ДобавитьСтроку("//++" + КлючИЗначение.Ключ);
		ТелоПроцедуры.ДобавитьСтроку(КлючИЗначение.Значение.ПолучитьТекст());
		ТелоПроцедуры.ДобавитьСтроку("//--" + КлючИЗначение.Ключ);
	КонецЦикла;
	Если КусокБезТэга <> "" Тогда
		ТелоПроцедуры.ДобавитьСтроку(КусокБезТэга);
	КонецЕсли;
КонецПроцедуры


Функция ТекстЗапросаБезСовместнойРаботы(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ";	
КонецФункции

Функция ТекстЗапросаВсеИзХранилища(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И (Правила.Захвачен = ЛОЖЬ
	|	ИЛИ Правила.Копия = ИСТИНА)";
КонецФункции

Функция ТекстЗапросаСвоиДоработки(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Захвачен = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник." + ИмяСправочника +"
	|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
	|ПО ДанныеЗахвата.РабочаяКопия = Правила.Ссылка
	|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Копия = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник." + ИмяСправочника +"
	|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
	|ПО ДанныеЗахвата.Объект = Правила.Ссылка
	|	И ДанныеЗахвата.Пользователь = &ТекущийПользователь
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Копия = ЛОЖЬ И Правила.Захвачен = ИСТИНА
	|";
	
КонецФункции


#КонецОбласти
#КонецЕсли