#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		ТипКонвертации = ДанныеЗаполнения.ТипКонвертации;
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XML
			Или ДанныеЗаполнения.ИспользоватьДляОтправки Тогда
			ИспользоватьДляОтправки = Истина;
			ОбъектВыборки = ДанныеЗаполнения.ОбъектКонфигурации;
		Иначе
			ИспользоватьДляПолучения = Истина;
			ОбъектВыборки = ДанныеЗаполнения.ОбъектФормата;
		КонецЕсли;
		Наименование = СокрЛП(ОбъектВыборки);
		ПравилоКонвертацииОбъекта = ДанныеЗаполнения.Код;
		
		ЗаполнитьСписокКонвертацийНовогоОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	// Зачистка лишних алгоритмов которые не используются для типа конвертации.
	Если ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
		АлгоритмВыборкаДанных = "";
		АлгоритмПриОбработке = "";
	Иначе
		Если ЗначениеЗаполнено(АлгоритмВыборкаДанных) И НЕ ИспользоватьДляОтправки Тогда
			АлгоритмВыборкаДанных = "";
		КонецЕсли;
		АлгоритмПередОбработкойПравила = "";
		АлгоритмПослеОбработкиПравила = "";
		АлгоритмПередВыгрузкойОбъекта = "";
		АлгоритмПослеВыгрузкиОбъекта = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(Ссылка) 
		И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		КонвертацияДанныхXDTOСервер.ПроверитьЗахватОбъектаПриПометкеНаУдаление(Ссылка.Захвачен, ПометкаУдаления, Отказ);
		Если НЕ Отказ Тогда
			КонвертацияДанныхXDTOВызовСервера.ОбработатьПометкуНаУдалениеЭлементаКонвертации(Ссылка, ПометкаУдаления);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьСписокКонвертацийНовогоОбъекта(НовыйОбъект, ДанныеЗаполнения)
	СписокКонвертаций = Новый СписокЗначений();
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(ДанныеЗаполнения, СписокКонвертаций);
	
	СсылкаНового = НовыйОбъект.ПолучитьСсылкуНового();
	КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(СсылкаНового, СписокКонвертаций);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Запись нового объекта в режиме совместной работы: следует добавить запись в регистр захвата.
	Если ДополнительныеСвойства.Свойство("ЭтоНовый")
		И ДополнительныеСвойства.ЭтоНовый 
		И Захвачен И Константы.СовместнаяРабота.Получить()  Тогда
		КонвертацияДанныхXDTOСервер.ОтразитьЗахватНовогоОбъекта(Ссылка);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
