#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	Если Не ЗначениеЗаполнено(Код) Тогда
		Если ИспользоватьДляОтправки
			И ИспользоватьДляПолучения Тогда
			Код = "" + СтрЗаменить(СокрЛП(ОбъектКонфигурации), ".", "_")
				+ "_" + СтрЗаменить(СокрЛП(ОбъектФормата), ".", "_");
		ИначеЕсли ИспользоватьДляОтправки Тогда
			Код = "" + СтрЗаменить(СокрЛП(ОбъектКонфигурации), ".", "_")
				+ "_" + НСтр("ru = 'Отправка'");
		ИначеЕсли ИспользоватьДляПолучения Тогда
			Код = "" + СтрЗаменить(СокрЛП(ОбъектФормата), ".", "_")
				+ "_" + НСтр("ru = 'Получение'");
		Иначе
			Код = "" + СтрЗаменить(СокрЛП(ОбъектКонфигурации), ".", "_")
				+ "_" + СтрЗаменить(СокрЛП(ОбъектФормата), ".", "_");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ИспользоватьДляОтправки 
		И ЗначениеЗаполнено(АлгоритмПриОтправкеДанных) Тогда
		АлгоритмПриОтправкеДанных = "";
	КонецЕсли;
	
	Если Не ИспользоватьДляПолучения
		И (ЗначениеЗаполнено(АлгоритмПередПолучениемДанных)
			Или ЗначениеЗаполнено(АлгоритмПриПолученииДанных)
			Или ЗначениеЗаполнено(АлгоритмПослеЗагрузкиВсехДанных)) Тогда
		АлгоритмПередПолучениемДанных = "";
		АлгоритмПриПолученииДанных = "";
		АлгоритмПослеЗагрузкиВсехДанных = "";
	КонецЕсли;
	
	Если ОбъектКонфигурации.Тип = Перечисления.ТипыОбъектов.НаборКонстант
		И ВариантИдентификации <> Перечисления.ВариантыИдентификацииОбъектов.ПоПолямПоиска Тогда
		ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоПолямПоиска;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка)
		И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		
		КонвертацияДанныхXDTOСервер.ПроверитьЗахватОбъектаПриПометкеНаУдаление(Ссылка.Захвачен, ПометкаУдаления, Отказ);
		Если НЕ Отказ Тогда
			КонвертацияДанныхXDTOВызовСервера.ОбработатьПометкуНаУдалениеЭлементаКонвертации(Ссылка, ПометкаУдаления);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ИспользоватьДляПолучения Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ВариантИдентификации");
		Если Не Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Запись нового объекта в режиме совместной работы: следует добавить запись в регистр захвата.
	Если ДополнительныеСвойства.Свойство("ЭтоНовый")
		И ДополнительныеСвойства.ЭтоНовый 
		И Захвачен И Константы.СовместнаяРабота.Получить()  Тогда
		КонвертацияДанныхXDTOСервер.ОтразитьЗахватНовогоОбъекта(Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#КонецЕсли