#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
	Если Объект.ИсточникЗагрузки = -1 Тогда
		Объект.ИсточникЗагрузки = 3;
	КонецЕсли; 
	Если Объект.СоздатьНовуюКонфигурацию Или Объект.ОбновлятьМетаданные Тогда
		Элементы.ИсточникЗагрузки_ТекстовыйФайл.Видимость = Ложь; 
		Элементы.ИсточникЗагрузки_ФайлXML.Видимость = Ложь;
	КонецЕсли;
	Элементы.ИмяМенеджераРегистрации.Доступность = Объект.ИсточникЗагрузки > 1;
	Элементы.ИмяМенеджераРегистрации.АвтоОтметкаНезаполненного = Элементы.ИмяМенеджераРегистрации.Доступность;  
	Элементы.ДекорацияЗаполнениеМодуля.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РасположениеФайловНаКлиентеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НастройкиДиалога = Новый Структура;
	МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент"); 
	Если Объект.ИсточникЗагрузки = 1 Тогда
		СтандартнаяОбработка = Ложь;
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru='Текстовый документ(*.txt)|*.txt'"));
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите файл с модулем менеджера'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "РасположениеФайловНаКлиенте", СтандартнаяОбработка, НастройкиДиалога);
	ИначеЕсли Объект.ИсточникЗагрузки = 0 Тогда
		СтандартнаяОбработка = Ложь;
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru='Текстовый документ(*.xml)|*.xml'"));
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите файл с макетом правил'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "РасположениеФайловНаКлиенте", СтандартнаяОбработка, НастройкиДиалога);
	ИначеЕсли Объект.ИсточникЗагрузки = 2 Тогда
		СтандартнаяОбработка = Ложь;
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru='Файл проекта(project)|*project*'"));
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите файл проекта project'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "РасположениеФайловНаКлиенте", СтандартнаяОбработка, НастройкиДиалога);
	Иначе
		ОповещениеЗавершения = Новый ОписаниеОповещения("ВыбранКаталогСДанными", ЭтотОбъект);
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите каталог с данными для загрузки'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайловогоКаталога(Объект, "РасположениеФайловНаКлиенте", СтандартнаяОбработка, НастройкиДиалога, ОповещениеЗавершения);
	КонецЕсли; 
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы  
&НаКлиенте
Процедура ОК(Команда)
	ОписаниеРезультата = "";
	Если НЕ ЗначениеЗаполнено(Объект.РасположениеФайловНаКлиенте) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран каталог для загрузки'")); 
		Возврат;
	КонецЕсли;  
	Если Объект.ИсточникЗагрузки > 1 И НЕ ЗначениеЗаполнено(Объект.ИмяМенеджераРегистрации) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указано имя модуля'")); 
		Возврат;
	КонецЕсли;
	Если Объект.ИсточникЗагрузки = 1 Тогда
		ОписаниеРезультата = НСтр("ru='Выполняется загрузка из текстового файла: %1'");  
	ИначеЕсли Объект.ИсточникЗагрузки = 0 Тогда
		ОписаниеРезультата = НСтр("ru='Выполняется загрузка из файла XML: %1'");
	Иначе
		ОписаниеРезультата = НСтр("ru='Выполняется загрузка из %2, каталог: %1'");
	КонецЕсли;
	ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%1", СокрЛП(Объект.РасположениеФайловНаКлиенте));
	Если Объект.ИсточникЗагрузки >= 2 Тогда
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", ?(Объект.ИсточникЗагрузки = 3, "XML", "EDT")); 
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеРезультата", ОписаниеРезультата);
	Результат.Вставить("ИсточникЗагрузки", Объект.ИсточникЗагрузки);
	Результат.Вставить("ИмяМенеджераРегистрации", Объект.ИмяМенеджераРегистрации);
	Результат.Вставить("РасположениеФайловНаКлиенте", Объект.РасположениеФайловНаКлиенте);
	Закрыть(Результат);
 КонецПроцедуры

&НаКлиенте
 Процедура ИсточникЗагрузки_ПриИзменении(Элемент)
	 Элементы.ГруппаМенеджерРегистрации.Доступность = Объект.ИсточникЗагрузки > 1;
	 Элементы.ИмяМенеджераРегистрации.АвтоОтметкаНезаполненного = Элементы.ИмяМенеджераРегистрации.Доступность;
 КонецПроцедуры
 
 &НаКлиенте
 Процедура РасположениеФайловНаКлиентеПриИзменении(Элемент) 
	Если Объект.ИсточникЗагрузки > 1 Тогда
		ЗаполнитьСписокМодулейРегистрацииНаКлиенте(); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ВыбранКаталогСДанными(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли; 
	ЗаполнитьСписокМодулейРегистрацииНаКлиенте();
КонецПроцедуры

&НаСервере
 Процедура ЗаполнитьСписокМодулейРегистрацииНаСервере()
	ПомещенныеФайлыДляПередачи = Новый Массив;
	Для Каждого ПомФайл Из ФайлыДляОбработкиСервер Цикл
		ИмяФайлаСведений = ПолучитьИмяВременногоФайла("bsl");
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПомФайл.Значение.Хранение);
		ДвоичныеДанные.Записать(ИмяФайлаСведений);
	
		ПараметрыФайла = Новый Структура("ПолноеИмя, Хранение");
		ЗаполнитьЗначенияСвойств(ПараметрыФайла, ПомФайл.Значение); 
		ПараметрыФайла.Хранение = ИмяФайлаСведений;
		ПомещенныеФайлыДляПередачи.Добавить(ПараметрыФайла);
	КонецЦикла;
	СтруктураПараметров = Новый Структура("ПомещенныеФайлы",ПомещенныеФайлыДляПередачи);
 	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение списка модулей регистрации'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаРегистрации.ЗаполнитьСписокМодулейРегистрации",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		Ошибки = Ошибки + НСтр("ru = 'При заполнении списка модулей регистрации произошла ошибка'") + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		ЕстьОшибки = Истина;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокМодулейРегистрацииНаКлиенте() 
	Если НЕ ЗначениеЗаполнено(Объект.РасположениеФайловНаКлиенте) Тогда
		Объект.ИмяМенеджераРегистрации = "";
		Возврат;
	КонецЕсли; 
	ФайлыДляОбработки = Новый Массив;
	Если Объект.ИсточникЗагрузки = 3 Тогда
		КаталогПоиска = СокрЛП(Объект.РасположениеФайловНаКлиенте) + "/ExchangePlans";
	Иначе
		КаталогПоиска = СокрЛП(Объект.РасположениеФайловНаКлиенте) + "/src/ExchangePlans";
	КонецЕсли;
    ВложенныеФайлы = НайтиФайлы(КаталогПоиска,"ManagerModule.bsl", Истина);
	Для Каждого ВложенныйФайл Из ВложенныеФайлы Цикл
		Если ВложенныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		ФайлыДляОбработки.Добавить(ВложенныйФайл.ПолноеИмя); 
	КонецЦикла;
	Если ФайлыДляОбработки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не обнаружены файлы с модулями менеджера планов обмена. Заполнение имени модуля невозможно.'"));
		Возврат;
	КонецЕсли;
	Для Каждого ТекФайл Из ФайлыДляОбработки Цикл
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ТекФайл), УникальныйИдентификатор);
		ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение", ТекФайл, АдресХранилища));
	КонецЦикла; 
	ЗаполнитьСписокМодулейРегистрацииНаСервере();
	Элементы.ДекорацияЗаполнениеМодуля.Видимость = Истина;
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина); 

КонецПроцедуры

 &НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеЗагрузки", 1, Истина);  
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеЗагрузки() 
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата); 
	РезультатЗагрузкиУспешно = Ложь;
	СписокМодулейРегистрации = Новый Массив;
	Элементы.ИмяМенеджераРегистрации.КнопкаВыпадающегоСписка = Ложь; 
	Элементы.ИмяМенеджераРегистрации.СписокВыбора.Очистить();
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		РезультатЗагрузкиУспешно = РезультатЗагрузки.Успешно;
		СписокМодулейРегистрации = РезультатЗагрузки.СписокМодулейРегистрации;
	КонецЕсли;
	ДлительнаяОперация = Ложь;
	Если НЕ РезультатЗагрузкиУспешно Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'При заполнении списка модулей регистрации произошли ошибки'"));
		Возврат;  
	КонецЕсли; 
	Если СписокМодулейРегистрации.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не обнаружено общих модулей, содержащих правила регистрации'"));
		Возврат; 
	КонецЕсли;
	Объект.ИмяМенеджераРегистрации = СписокМодулейРегистрации[0];
	Если СписокМодулейРегистрации.Количество() > 1 Тогда
		Элементы.ИмяМенеджераРегистрации.СписокВыбора.ЗагрузитьЗначения(СписокМодулейРегистрации);
		Элементы.ИмяМенеджераРегистрации.КнопкаВыпадающегоСписка = Истина;
	КонецЕсли;
	Элементы.ДекорацияЗаполнениеМодуля.Видимость = Ложь;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры


#КонецОбласти
