#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Подготовка модуля менеджера обмена через универсальный формат.
// Возвращаемое значение: 
// 		Структура - содержит результат выгрузки:
//       	* Ключ: Строка, имя модуля 
//			* Значение: ТекстовыйДокумент, Текст модуля			
Функция ВыполнитьВыгрузкуМодулей() Экспорт

	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конвертация, "Конфигурация, ИспользоватьРазделениеМодуля, ИспользоватьТипизациюПеременных, ГруппироватьПоОбъектамВыгрузки, ЗапретитьПереводИменОбъектовФормата");
	Модули = Новый ТаблицаЗначений;
	Если ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка,
		|	Наименование,
		|	Раздел,
		|	ВЫБОР КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Базисный) ТОГДА
		|		4   
		|	КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Алгоритмы) ТОГДА
		|		1
		|	КОГДА Раздел = ЗНАЧЕНИЕ(Перечисление.РазделыДополнительныхМодулей.Пользовательский) ТОГДА
		|		3
		|	ИНАЧЕ 2
		|	КОНЕЦ КАК Сортировка,
		|	ЛОЖЬ КАК ЕстьПроцедурыВызоваОбработчика,
		|	ЛОЖЬ КАК ЕстьФункцииВызоваОбработчика,
		|	ЛОЖЬ КАК ЭтоМодульМенеджера,
		|	"""" КАК ИмяПапки
		|ИЗ Справочник.ДополнительныеМодули
		|ГДЕ Владелец = &Конвертация
		|УПОРЯДОЧИТЬ ПО Сортировка, Наименование";
		Запрос.УстановитьПараметр("Конвертация", Конвертация);
		Модули = Запрос.Выполнить().Выгрузить();
		Модули.Колонки.Добавить("ТекстМодуля");  
	КонецЕсли;
	
	// Вычисляем признак добавления тегов.
	Релиз = ДанныеКонвертации.Конфигурация;
	Конфигурация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Релиз, "КонфигурацияВладелец");
	ВыборкаТеги = Справочники.Теги.Выбрать(,Конфигурация);
	ДобавлятьТеги = Ложь; 
	СхлопываниеТегов = Новый Массив; 
	МаксимальнаяДлинаТега = 0;
	ВсеТеги = Новый Массив;
	Пока ВыборкаТеги.Следующий() Цикл
		ДобавлятьТеги = Истина;
		ТекТег = СокрЛП(ВыборкаТеги.Наименование);
		СтрСхлопывание = "//-- " + ТекТег + Символы.ПС + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание);  
		СтрСхлопывание = Символы.Таб + "//-- " + ТекТег + Символы.ПС + Символы.Таб + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание); 
		СтрСхлопывание = Символы.Таб + Символы.Таб + "//-- " + ТекТег + Символы.ПС + Символы.Таб + Символы.Таб + "//++ " + ТекТег;
		СхлопываниеТегов.Добавить(СтрСхлопывание); 
		ДлинаТега = СтрЧислоСтрок(СтрСхлопывание);
		Если ДлинаТега > МаксимальнаяДлинаТега Тогда
			МаксимальнаяДлинаТега = ДлинаТега;
		КонецЕсли;
		ВсеТеги.Добавить(ТекТег);
	КонецЦикла;

	ПараметрыМодуля = Новый Структура("Релиз, Конфигурация, ДобавлятьТеги, ИспользоватьРазделениеМодуля",
		Релиз, Конфигурация, ДобавлятьТеги, ДанныеКонвертации.ИспользоватьРазделениеМодуля); 
	ПараметрыМодуля.Вставить("ИспользоватьТипизациюПеременных", ДанныеКонвертации.ИспользоватьТипизациюПеременных);
	ПараметрыМодуля.Вставить("ГруппироватьПоОбъектамВыгрузки", ДанныеКонвертации.ГруппироватьПоОбъектамВыгрузки);
	МакетТекстовМодулей = ПолучитьМакет("ШаблоныТекстовМодулей"); 
	МакетТекстовМодулейДетализацияКомментариев = ПолучитьМакет("ШаблоныДетализацииКомментариев");
	ПараметрыМодуля.Вставить("МакетТекстовМодулей", МакетТекстовМодулей);
	ПараметрыМодуля.Вставить("МакетТекстовМодулейДетализацияКомментариев", МакетТекстовМодулейДетализацияКомментариев);
	ПараметрыМодуля.Вставить("ТекстПроцедурыВызоваОбработчика", "");
	ПараметрыМодуля.Вставить("ТекстФункцииВызоваОбработчика", ""); 
	ПараметрыМодуля.Вставить("ПрограммныйИнтерфейс", Новый ТекстовыйДокумент); 
	ПараметрыМодуля.Вставить("СхлопываниеТегов", СхлопываниеТегов);
	ПараметрыМодуля.Вставить("ВсеТеги", ВсеТеги);
	ПараметрыМодуля.Вставить("МаксимальнаяДлинаТега", МаксимальнаяДлинаТега);
	ПараметрыМодуля.Вставить("ЗапретитьПереводИменОбъектовФормата", ДанныеКонвертации.ЗапретитьПереводИменОбъектовФормата);
	
	// Заполнение таблиц правил ПОД, ПКО 
	ПараметрыМодуля.Вставить("ПОД_Отправка", Новый ТекстовыйДокумент); 
	ПараметрыМодуля.Вставить("ПОД_Получение", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_Отправка", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_Получение", Новый ТекстовыйДокумент);
	ПараметрыМодуля.Вставить("ПКО_ОтправкаИПолучение", Новый ТекстовыйДокумент); 
	
	Если ДанныеКонвертации.ИспользоватьРазделениеМодуля Тогда
		ПараметрыМодуля.Вставить("Модули", Модули);

		Результат = Новый Структура;
		Для Каждого СтрМодуль Из Модули Цикл
			Если СтрМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Базисный Тогда
				// Перед базисным модулем надо заполнить модули менеджера.
				ЗаполнитьМодулиМенеджеров(Результат, ПараметрыМодуля);
				// Базисный модуль.
				ЗаполнитьБазисныйМодуль(СтрМодуль, ПараметрыМодуля);
			ИначеЕсли СтрМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
				ЗаполнитьДополнительныйМодуль_Алгоритмы(СтрМодуль, ПараметрыМодуля);
			ИначеЕсли СтрМодуль.ЭтоМодульМенеджера Тогда
				// Дополнительный модуль с выгрузкой в модуль менеджера уже обработан.
				Продолжить;
			Иначе
				ЗаполнитьДополнительныйМодуль_Правила(СтрМодуль, ПараметрыМодуля);
			КонецЕсли; 
		КонецЦикла;
		// Замена вызовов алгоритмов после заполнения всех модулей.
		Для Каждого СтрМодуль Из Модули Цикл
			ПараметрыМодуля.Вставить("ТекущийМодуль", СтрМодуль);
			ОбщийТекстМодуля = СтрМодуль.ТекстМодуля; 
			ЗаменитьВызовыАлгоритмов(ПараметрыМодуля, ОбщийТекстМодуля);
			Если СтрМодуль.ЭтоМодульМенеджера Тогда 
				// Имя модуля в результирующей структуре
				ИмяМодуляДляВозврата = СтрЗаменить(СокрЛП(СтрМодуль.Наименование), ".", "_");
			Иначе
				ИмяМодуляДляВозврата = СокрЛП(СтрМодуль.Наименование);
			КонецЕсли; 
			// Удаление идентичных тегов закрытие + открытие
			ОбщийТекстМодуляСтрокой = ОбщийТекстМодуля.ПолучитьТекст();
			ВыполнитьСхлопываниеТеговВМодуле(ПараметрыМодуля, ОбщийТекстМодуляСтрокой);
			Результат.Вставить(ИмяМодуляДляВозврата, ОбщийТекстМодуляСтрокой);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	
	ОбщийТекстМодуля = Новый ТекстовыйДокумент;
	ДобавитьЗаголовокМодуля(ОбщийТекстМодуля);

	ТекстыПоГруппам = Новый Структура;
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПОД", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПОД", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПКО", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПКО", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам", Новый Структура);

	ТекстыПоГруппам.Вставить("ОбработчикиКонвертации", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("ОбработчикиКонвертацииПоГруппам", Новый Структура);


	ТекстПроцедуры_Конвертация = ЗаполнитьТекстПроцедурыКонвертации(МакетТекстовМодулей);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("#Область ПроцедурыКонвертации");
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ТекстПроцедуры_Конвертация);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("#КонецОбласти");
	ВерсияФорматаМенеджераТекст = ПолучитьВерсиюФорматаМенеджера(МакетТекстовМодулей);
	
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ВерсияФорматаМенеджераТекст);
	
	ЗаполнитьТекстПроцедурыПОД(ТекстыПоГруппам, ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПКО(ТекстыПоГруппам, ПараметрыМодуля); 
	
	ДобавитьПроцедурыПОДиПКОВМодуль(ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПКПД(ПараметрыМодуля);
	
	ЗаполнитьТекстПроцедурыАлгоритмы(ТекстыПоГруппам, ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПараметры(ПараметрыМодуля, ПараметрыМодуля.ПрограммныйИнтерфейс);
	
	ЗаполнитьТекстПроцедурыВызоваОбработчиков(ПараметрыМодуля); 
	
	ДобавитьПроцедурыВТекстМодуля(ОбщийТекстМодуля, ТекстыПоГруппам, ПараметрыМодуля);
	
	Стр = ОбщийТекстМодуля.ПолучитьТекст();
	// Удаление идентичных тегов закрытие + открытие
	ВыполнитьСхлопываниеТеговВМодуле(ПараметрыМодуля, Стр);
	
	ОбщийТекстМодуля.УстановитьТекст(Стр);
	
	Возврат Новый Структура("МенеджерОбменаЧерезУниверсальныйФормат", ОбщийТекстМодуля);
	

КонецФункции

// Формирование локального текста модуля для указанного правила, для сравнения правил при загрузке конвертации.
Функция СформироватьТекстПравила(Параметры) Экспорт
	Правило = Параметры.Правило;
	Конвертация = Параметры.Конвертация; 
	
	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Конвертация, "ИспользоватьРазделениеМодуля, ИспользоватьТипизациюПеременных, Конфигурация, ЗапретитьПереводИменОбъектовФормата"); 
	
	КонфигурацияВладелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКонвертации.Конфигурация, "КонфигурацияВладелец");
	ВыборкаТеги = Справочники.Теги.Выбрать(,КонфигурацияВладелец);
	Если ВыборкаТеги.Следующий() Тогда
		ДобавлятьТеги = Истина;
	КонецЕсли;
	
	ПараметрыМодуля = Новый Структура("Релиз, Конфигурация, ДобавлятьТеги, ИспользоватьРазделениеМодуля",
		ДанныеКонвертации.Конфигурация, КонфигурацияВладелец, ДобавлятьТеги, ДанныеКонвертации.ИспользоватьРазделениеМодуля); 
	ПараметрыМодуля.Вставить("ИспользоватьТипизациюПеременных", ДанныеКонвертации.ИспользоватьТипизациюПеременных);
	МакетТекстовМодулей = ПолучитьМакет("ШаблоныТекстовМодулей"); 
	МакетТекстовМодулейДетализацияКомментариев = ПолучитьМакет("ШаблоныДетализацииКомментариев");
	ПараметрыМодуля.Вставить("МакетТекстовМодулей", МакетТекстовМодулей);
	ПараметрыМодуля.Вставить("МакетТекстовМодулейДетализацияКомментариев", МакетТекстовМодулейДетализацияКомментариев);
	ПараметрыМодуля.Вставить("ТекстФункцииВызоваОбработчика", "");
	ПараметрыМодуля.Вставить("ТекстПроцедурыВызоваОбработчика", "");   
	ПараметрыМодуля.Вставить("ПрефиксВызоваОбработчика", "");
	ПараметрыМодуля.Вставить("СхлопываниеТегов", Новый Массив);
	ПараметрыМодуля.Вставить("ГруппироватьПоОбъектамВыгрузки", Ложь);
	ПараметрыМодуля.Вставить("МаксимальнаяДлинаТега", 0);
	ПараметрыМодуля.Вставить("ЗапретитьПереводИменОбъектовФормата", ДанныеКонвертации.ЗапретитьПереводИменОбъектовФормата);
	
	ТекстыПоГруппам = Новый Структура; 
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПОД", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПОД", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПКО", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПКО", Новый Структура);

	ТекстыПоГруппам.Вставить("ОбработчикиКонвертации", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("ОбработчикиКонвертацииПоГруппам", Новый Структура);


	ТекстПроцедуры = Новый ТекстовыйДокумент;
	Если ТипЗнч(Правило) = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТабПравил.Ссылка КАК Ссылка,
		|	ТабПравил.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
		|	ТабПравил.Наименование КАК Наименование,
		|	ТабПравил.Наименование КАК Код,
		|	ТабПравил.ОбъектВыборки КАК ОбъектВыборки,
		|	ВЫБОР
		|		КОГДА ТабПравил.ИспользоватьДляОтправки
		|		ТОГДА ТабПравил.ОбъектВыборки
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ОбъектКонфигурации,
		|	ТабПравил.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
		|	ТабПравил.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
		|	ТабПравил.АлгоритмПриОбработке КАК ПриОбработке,
		|	ВЫБОР
		|		КОГДА ТабПравил.ИспользоватьДляОтправки
		|		ТОГДА ТабПравил.АлгоритмВыборкаДанных
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВыборкаДанных,
		|	ВЫБОР
		|		КОГДА ТабПравил.ИспользоватьДляОтправки
		|		ТОГДА ВЫРАЗИТЬ(ТабПравил.ОбъектВыборки КАК Справочник.Объекты).Тип
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипОбъектаВыборки,
		|	ТабПравил.ОчисткаДанных КАК ОчисткаДанных,
		|	ТабПравил.ГруппаПравил
		|ИЗ
		|	Справочник.ПравилаОбработкиДанных КАК ТабПравил
		|ГДЕ ТабПравил.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабПКО.ПравилоКонвертацииОбъекта КАК ПКО,
		|	ТабПравил.Ссылка КАК ПОД
		|ИЗ
		|	Справочник.ПравилаОбработкиДанных КАК ТабПравил
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов КАК ТабПКО
		|	ПО ТабПКО.Ссылка = ТабПравил.Ссылка
		|ГДЕ ТабПравил.Ссылка = &Ссылка
		|	УПОРЯДОЧИТЬ ПО ПКО
		|";
		Запрос.УстановитьПараметр("Ссылка", Правило); 
		ТегиДляПравила = ПолучитьТегиДляПравила(Правило, ПараметрыМодуля);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ДанныеПравила = РезультатЗапроса[0].Выбрать();
		ДанныеПравила.Следующий(); 
		ТабПКО = РезультатЗапроса[1].Выгрузить();  
		ТекГруппаПравил = СокрЛП(ДанныеПравила.ГруппаПравил);
		ПривестиИмяГруппыПравил(ТекГруппаПравил);
		ОбластьПОДТекст = ПолучитьОбластьСТекстомПОД(ПараметрыМодуля, ДанныеПравила, ТабПКО, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила); 
		ТекстПроцедуры.ДобавитьСтроку(ОбластьПОДТекст);
		// Обработчиков может не быть.
		Если ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам.Свойство(ТекГруппаПравил) Тогда
			ТекстПроцедуры.ДобавитьСтроку(ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам[ТекГруппаПравил].ПолучитьТекст());
		КонецЕсли;
	ИначеЕсли ТипЗнч(Правило) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		// Заполняем версии формата с их расширениями.
		ЗапросВерсииФормата = Новый Запрос;
		ЗапросВерсииФормата.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|  Расширения.Расширение КАК ВерсияРасширение
		|ИЗ Справочник.ВерсииФормата КАК ВерсииФормата
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений КАК Расширения
		|ПО ВерсииФормата.Ссылка = Расширения.ВерсияФорматаОбмена
		|ГДЕ ВерсииФормата.Ссылка В (&ВерсииФормата)";
		ЗапросВерсииФормата.УстановитьПараметр("ВерсииФормата", Конвертация.ВерсииФормата.ВыгрузитьКолонку("ВерсияФормата"));
		ВерсииФормата = ЗапросВерсииФормата.Выполнить().Выгрузить().ВыгрузитьКолонку("ВерсияРасширение");

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Владелец.Наименование КАК НаименованиеОбъекта,
		|	Наименование КАК НаименованиеСвойства,
		|	ЕстьNULL(Родитель.Наименование, """") КАК НаименованиеРодителя,
		|	Родитель.ТипОбщегоСвойства КАК ТипОбщегоСвойства,
		|	ЕстьNULL(Владелец.Владелец.ПространствоИмен, """") КАК ПространствоИмен
		|ПОМЕСТИТЬ СвойстваФорматаИзРасширения
		|ИЗ Справочник.СвойстваФормата 
		|ГДЕ 
		|	Владелец.Владелец В (&ВерсииФормата)
		|;                                        
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилоСсылка.Ссылка,
		|	ВЫРАЗИТЬ(ПравилоСсылка.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
		|	ПравилоСсылка.Код КАК Код,
		|	ПравилоСсылка.ВариантИдентификации КАК ВариантИдентификации,
		|	ПравилоСсылка.ОбъектКонфигурации КАК ОбъектКонфигурации,
		|	ПравилоСсылка.ОбъектФормата КАК ОбъектФормата,
		|	ПравилоСсылка.ПравилоДляГруппыСправочника КАК ПравилоДляГруппыСправочника,
		|	ПравилоСсылка.АлгоритмПриОтправкеДанных КАК ПриОтправкеДанных,
		|	ПравилоСсылка.АлгоритмПередПолучениемДанных КАК ПриКонвертацииДанныхXDTO,
		|	ПравилоСсылка.АлгоритмПриПолученииДанных КАК ПередЗаписьюПолученныхДанных,
		|	ПравилоСсылка.АлгоритмПослеЗагрузкиВсехДанных КАК ПослеЗагрузкиВсехДанных_Код,
		|	ПравилоСсылка.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
		|	ПравилоСсылка.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
		|	ОК.Тип КАК ТипДанных
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК ПравилоСсылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОК
		|	ПО ПравилоСсылка.ОбъектКонфигурации = ОК.Наименование
		|		И ОК.Владелец = &Конфигурация
		|ГДЕ ПравилоСсылка.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвойствоКонфигурации,
		|	СвойствоКонфигурацииСтрокой,
		|	СвойствоФормата,
		|	ИспользуетсяАлгоритмКонвертации,
		|	ПространствоИмен КАК ПространствоИмен,
		|	Сортировка,
		|	ПравилоКонвертацииСвойства,
		|	ПравилоКонвертацииОбъекта,
		|	Код,
		|	Ссылка
		|ИЗ (
		|	ВЫБРАТЬ
		|		ПравилаКонвертацииСвойств.СвойствоКонфигурации КАК СвойствоКонфигурации,
		|		ПравилаКонвертацииСвойств.СвойствоКонфигурацииСтрокой КАК СвойствоКонфигурацииСтрокой,
		|		ПравилаКонвертацииСвойств.СвойствоФормата КАК СвойствоФормата,
		|		ПравилаКонвертацииСвойств.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
		|		СвойстваФорматаИзРасширения.ПространствоИмен КАК ПространствоИмен,
		|		ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства,
		|		ПравилаКонвертацииСвойств.Владелец КАК ПравилоКонвертацииОбъекта,
		|		ПравилаКонвертацииСвойств.Код КАК Код,
		|		ВЫБОР КОГДА ЕстьNULL(СвойствоКонфигурации.Наименование, """") = """" ТОГДА
		|			СвойствоФормата
		|		ИНАЧЕ СвойствоКонфигурации.Наименование КОНЕЦ КАК Сортировка,
		|		ПравилаКонвертацииСвойств.Ссылка КАК Ссылка
		|	ИЗ
		|	Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
		|	ЛЕВОЕ СОЕДИНЕНИЕ СвойстваФорматаИзРасширения КАК СвойстваФорматаИзРасширения
		|	ПО ПравилаКонвертацииСвойств.СвойствоФормата = СвойстваФорматаИзРасширения.НаименованиеСвойства
		|		И (СвойстваФорматаИзРасширения.НаименованиеРодителя = """"  
		|			ИЛИ СвойстваФорматаИзРасширения.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ГруппаОбщихСвойств)
		|			ИЛИ СвойстваФорматаИзРасширения.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.КлючевыеСвойства))
		|		И ПравилаКонвертацииСвойств.Владелец.ОбъектФормата = СвойстваФорматаИзРасширения.НаименованиеОбъекта
		|	ГДЕ
		|		ПравилаКонвертацииСвойств.Владелец = &Ссылка И ПравилаКонвертацииСвойств.Отключить = ЛОЖЬ И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ
		|		И ПравилаКонвертацииСвойств.Родитель = ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
		|		И НЕ ПравилаКонвертацииСвойств.ПометкаУдаления
		|) КАК Свод
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка,
		|	ИспользуетсяАлгоритмКонвертации,
		|	Код
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ГруппаСвойствФормата,
		|	ГруппаСвойствКонфигурации,
		|	ГруппаСвойствКонфигурацииСтрокой,
		|	СвойствоКонфигурации,
		|	СвойствоКонфигурацииСтрокой,
		|	СвойствоФормата,
		|	ИспользуетсяАлгоритмКонвертации,
		|	ПространствоИмен КАК ПространствоИмен,  
		|	ПравилоКонвертацииСвойства,
		|	ПравилоКонвертацииОбъекта,
		|	Код,
		|	Ссылка
		|ПОМЕСТИТЬ ТабПКС_ТЧ
		|ИЗ
		|	(
		|	ВЫБРАТЬ
		|		ПравилаКонвертацииСвойств.Родитель.СвойствоФормата КАК ГруппаСвойствФормата,
		|		ПравилаКонвертацииСвойств.Родитель.СвойствоКонфигурации КАК ГруппаСвойствКонфигурации,
		|		ПравилаКонвертацииСвойств.Родитель.СвойствоКонфигурацииСтрокой КАК ГруппаСвойствКонфигурацииСтрокой,
		|		ПравилаКонвертацииСвойств.СвойствоКонфигурации КАК СвойствоКонфигурации,
		|		ПравилаКонвертацииСвойств.СвойствоКонфигурацииСтрокой КАК СвойствоКонфигурацииСтрокой,
		|		ПравилаКонвертацииСвойств.СвойствоФормата КАК СвойствоФормата,
		|		ПравилаКонвертацииСвойств.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
		|		СвойстваФорматаИзРасширения.ПространствоИмен КАК ПространствоИмен,
		|		ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства,
		|		ПравилаКонвертацииСвойств.Владелец КАК ПравилоКонвертацииОбъекта,
		|		ПравилаКонвертацииСвойств.Код КАК Код,
		|		ПравилаКонвертацииСвойств.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
		|		ЛЕВОЕ СОЕДИНЕНИЕ СвойстваФорматаИзРасширения КАК СвойстваФорматаИзРасширения
		|		ПО ПравилаКонвертацииСвойств.СвойствоФормата = СвойстваФорматаИзРасширения.НаименованиеСвойства
		|			И СвойстваФорматаИзРасширения.НаименованиеРодителя = ПравилаКонвертацииСвойств.Родитель.СвойствоФормата
		|			И ПравилаКонвертацииСвойств.Владелец.ОбъектФормата = СвойстваФорматаИзРасширения.НаименованиеОбъекта
		|			
		|	ГДЕ 
		|		ПравилаКонвертацииСвойств.Владелец = &Ссылка И ПравилаКонвертацииСвойств.Отключить = ЛОЖЬ И ПравилаКонвертацииСвойств.Родитель.Отключить = ЛОЖЬ
		|		И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ
		|		И ПравилаКонвертацииСвойств.Родитель <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
		|) КАК Свод
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабПКС_ТЧ.ГруппаСвойствФормата КАК ГруппаСвойствФормата,
		|	ТабПКС_ТЧ.ГруппаСвойствКонфигурации КАК ГруппаСвойствКонфигурации,
		|	ТабПКС_ТЧ.ГруппаСвойствКонфигурацииСтрокой КАК ГруппаСвойствКонфигурацииСтрокой,
		|	ТабПКС_ТЧ.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
		|	ВЫБОР КОГДА ТабПКС_ТЧ.ГруппаСвойствФормата <> """"
		|		И ТабПКС_ТЧ.ГруппаСвойствКонфигурации <> """" ТОГДА
		|		ИСТИНА
		|	ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПрямаяКонвертация
		|ИЗ ТабПКС_ТЧ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабПКС_ТЧ.ГруппаСвойствФормата КАК ГруппаСвойствФормата,
		|	ТабПКС_ТЧ.ГруппаСвойствКонфигурации КАК ГруппаСвойствКонфигурации,
		|	ТабПКС_ТЧ.ГруппаСвойствКонфигурацииСтрокой КАК ГруппаСвойствКонфигурацииСтрокой,
		|	ТабПКС_ТЧ.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
		|	ТабПКС_ТЧ.СвойствоКонфигурации КАК СвойствоКонфигурации, 
		|	ТабПКС_ТЧ.СвойствоКонфигурацииСтрокой КАК СвойствоКонфигурацииСтрокой,
		|	ТабПКС_ТЧ.СвойствоФормата КАК СвойствоФормата,
		|	ТабПКС_ТЧ.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
		|	ТабПКС_ТЧ.ПространствоИмен КАК ПространствоИмен,
		|	ТабПКС_ТЧ.ПравилоКонвертацииСвойства КАК ПравилоКонвертацииСвойства,
		|	ТабПКС_ТЧ.Код КАК Код
		|ИЗ ТабПКС_ТЧ
		|УПОРЯДОЧИТЬ ПО
		|	ТабПКС_ТЧ.СвойствоКонфигурации.Наименование,
		|	ТабПКС_ТЧ.СвойствоФормата,
		|	ТабПКС_ТЧ.Код
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоляПоиска.РеквизитыПоиска КАК РеквизитыПоиска,
		|	ПоляПоиска.НомерСтроки КАК НомерСтроки,
		|	ПоляПоиска.Ссылка КАК ПравилоКонвертацииОбъекта
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов.ИдентификацияПоПолямПоиска КАК ПоляПоиска
		|ГДЕ ПоляПоиска.Ссылка = &Ссылка
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|";
		Запрос.УстановитьПараметр("Ссылка", Правило);  
		Запрос.УстановитьПараметр("Конфигурация", ПараметрыМодуля.Конфигурация);  
		Запрос.УстановитьПараметр("ВерсииФормата", ВерсииФормата);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ТегиДляПравила = ПолучитьТегиДляПравила(Правило, ПараметрыМодуля);

		ДанныеПравила = РезультатЗапроса[1].Выбрать();
		ДанныеПравила.Следующий(); 
		ТекГруппаПравил = СокрЛП(ДанныеПравила.ГруппаПравил);
		ПривестиИмяГруппыПравил(ТекГруппаПравил);
		Направление = 0;
		Если НЕ ДанныеПравила.ИспользоватьДляОтправки И ДанныеПравила.ИспользоватьДляПолучения Тогда
			Направление = 1;
		ИначеЕсли ДанныеПравила.ИспользоватьДляОтправки И ДанныеПравила.ИспользоватьДляПолучения Тогда
			Направление = 2;
		КонецЕсли;

		ТабПКС = РезультатЗапроса[2].Выгрузить();
		
		ТабПКС_ТЧСвод = РезультатЗапроса[4].Выгрузить();
		
		ТабПКС_ТЧ = РезультатЗапроса[5].Выгрузить();
		ТабПКС_ТЧ.Индексы.Добавить("ГруппаСвойствФормата");
		ТабПКС_ТЧ.Индексы.Добавить("ГруппаСвойствКонфигурации");
		
		ТабПолейПоиска = РезультатЗапроса[6].Выгрузить();

		ОбластьПКОТекст = ПолучитьОбластьСТекстомПКО(ПараметрыМодуля, ДанныеПравила, Направление, ТабПКС, ТабПКС_ТЧСвод, ТабПКС_ТЧ, ТабПолейПоиска, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила);
		ТекстПроцедуры.ДобавитьСтроку(ОбластьПКОТекст);
		// Обработчиков может не быть.
		Если ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам.Свойство(ТекГруппаПравил) Тогда
			ТекстПроцедуры.ДобавитьСтроку(ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам[ТекГруппаПравил].ПолучитьТекст());
		КонецЕсли;
	ИначеЕсли ТипЗнч(Правило) = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПКПД.Ссылка КАК Ссылка,
		|	ПКПД.Код КАК Наименование,
		|	ПКПД.ОбъектКонфигурации КАК ОбъектКонфигурации,
		|	ПКПД.ОбъектФормата КАК ОбъектФормата,
		|	ПКПД.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
		|	ПКПД.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
		|	ОК.Тип КАК ТипДанных
		|ИЗ
		|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПКПД
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОК
		|	ПО ПКПД.ОбъектКонфигурации = ОК.Наименование
		|		И ОК.Владелец = &Конфигурация
		|ГДЕ
		|	ПКПД.Ссылка = &Ссылка 
		|";
		Запрос.УстановитьПараметр("Ссылка", Правило);  
		Запрос.УстановитьПараметр("Конфигурация", ПараметрыМодуля.Конфигурация);  
		ТекстДляОтправки = Новый ТекстовыйДокумент;
		ТекстДляПолучения = Новый ТекстовыйДокумент; 
		ТекстОбщий = Новый ТекстовыйДокумент;

		ДанныеПравила = Запрос.Выполнить().Выбрать();
		ДанныеПравила.Следующий(); 
		ПолучитьОбластьСТекстомПКПД(ПараметрыМодуля, ДанныеПравила, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий);
		ДополнитьТекстПроцедурыСУсловиями(ТекстПроцедуры, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий);
	ИначеЕсли ТипЗнч(Правило) = Тип("СправочникСсылка.Алгоритмы") Тогда
		ДанныеАлгоритма = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "Код, Параметры, Алгоритм, ЭтоФункция, Экспортный, Комментарий");
		ДобавитьТекстАлгоритма(ТекстПроцедуры, ДанныеАлгоритма, Ложь, Ложь);
	КонецЕсли; 
	КоличествоСтрок = ТекстПроцедуры.КоличествоСтрок();
	Для ОбратныйСчетчик = 0 По КоличествоСтрок - 1 Цикл
		
		НомерСтроки = КоличествоСтрок - ОбратныйСчетчик;
		
		Строка = ТекстПроцедуры.ПолучитьСтроку(НомерСтроки);
		Если Найти(Строка, "---") > 0 Тогда
			ТекстПроцедуры.УдалитьСтроку(НомерСтроки);
		КонецЕсли;
	КонецЦикла;

	Возврат ТекстПроцедуры;
КонецФункции
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#Область СРазделениемМодулей
// Заполнение модуля с правилами (документы, прочее, опциональный модуль).


Процедура ЗаполнитьДополнительныйМодуль_Правила(СтрМодуль, ПараметрыМодуля)
	ОбщийТекстМодуля = Новый ТекстовыйДокумент;
	
	ТекстыПоГруппам = Новый Структура;
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПОД", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПОД", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункции_ПКО", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам_ПКО", Новый Структура);
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам", Новый Структура);

	ТекстыПоГруппам.Вставить("ОбработчикиКонвертации", Новый ТекстовыйДокумент);
	ТекстыПоГруппам.Вставить("ОбработчикиКонвертацииПоГруппам", Новый Структура);
	
	// Дополнение параметров модуля отбором.
	ПараметрыМодуля.Вставить("ТекущийМодуль", СтрМодуль);
	
	ЗаполнитьТекстПроцедурыПОД(ТекстыПоГруппам, ПараметрыМодуля);

	ЗаполнитьТекстПроцедурыПКО(ТекстыПоГруппам, ПараметрыМодуля);
	
	Если СтрМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский И НЕ СтрМодуль.ЭтоМодульМенеджера Тогда
		ЗаполнитьТекстПроцедурыАлгоритмы(ТекстыПоГруппам, ПараметрыМодуля);
	КонецЕсли;
	
	ДобавитьПроцедурыВТекстМодуля(ОбщийТекстМодуля, ТекстыПоГруппам, ПараметрыМодуля, СтрМодуль.ЭтоМодульМенеджера);

	// После заполнения модуля подменить вызовы алгоритмов
	СтрМодуль.ТекстМодуля = ОбщийТекстМодуля; 
КонецПроцедуры  

// Заполнение модуля с алгоритмами.
Процедура ЗаполнитьДополнительныйМодуль_Алгоритмы(СтрМодуль, ПараметрыМодуля)  
	ОбщийТекстМодуля = Новый ТекстовыйДокумент; 
    // Дополнение параметров модуля отбором.
	ПараметрыМодуля.Вставить("ТекущийМодуль", СтрМодуль);

	ТекстыПоГруппам = Новый Структура;
	ТекстыПоГруппам.Вставить("СлужебныеПроцедурыИФункцииПоГруппам", Новый Структура);

	ЗаполнитьТекстПроцедурыАлгоритмы(ТекстыПоГруппам, ПараметрыМодуля); 
	
	ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныеПроцедурыИФункции");
	ОбщийТекстМодуля.ДобавитьСтроку("#Область Алгоритмы");
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Алгоритмы.ПолучитьТекст());
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	УдалитьЛишниеСтрокиИзМодуля(ОбщийТекстМодуля);
	СтрМодуль.ТекстМодуля = ОбщийТекстМодуля; 
КонецПроцедуры

// Заполнение базисного модуля.
Процедура ЗаполнитьБазисныйМодуль(СтрМодуль, ПараметрыМодуля)
	ОбщийТекстМодуля = Новый ТекстовыйДокумент;
	ДобавитьЗаголовокМодуля(ОбщийТекстМодуля);
	
	ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныйПрограммныйИнтерфейс");
	// Обработчики конвертации и версия формата.
	ОбщийТекстМодуля.ДобавитьСтроку(ЗаполнитьТекстПроцедурыКонвертации(ПараметрыМодуля.МакетТекстовМодулей)); 
	ВерсияФорматаМенеджераТекст = ПолучитьВерсиюФорматаМенеджера(ПараметрыМодуля.МакетТекстовМодулей);
	ОбщийТекстМодуля.ДобавитьСтроку(ВерсияФорматаМенеджераТекст); 

	// Заполнение таблиц ПОД и ПКО 
	ДобавитьПроцедурыПОДиПКОВМодуль(ПараметрыМодуля);
	
	ЗаполнитьТекстПроцедурыПКПД(ПараметрыМодуля);
	
	// Процедуры вызова обработчиков. 
	ЗаполнитьТекстПроцедурыВызоваОбработчиков(ПараметрыМодуля);
	
	ОбщийТекстМодуля.ДобавитьСтроку(ПараметрыМодуля.ПрограммныйИнтерфейс.ПолучитьТекст());
	
	// Параметры конвертации.
	ЗаполнитьТекстПроцедурыПараметры(ПараметрыМодуля, ОбщийТекстМодуля);
	
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныеПроцедурыИФункции");
	ДобавитьУИДМодуля(ОбщийТекстМодуля);
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); 
	УдалитьЛишниеСтрокиИзМодуля(ОбщийТекстМодуля);
	СтрМодуль.ТекстМодуля = ОбщийТекстМодуля;
КонецПроцедуры

// Заполнение модулей которые выгружаются в модули менеджера.
Процедура ЗаполнитьМодулиМенеджеров(Результат, ПараметрыМодуля) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Свод.Объект КАК Объект,
	|	Свод.Объект.Тип КАК Тип,
	|	Свод.Объект.Имя КАК Имя,
	|	Свод.Ссылка КАК Правило,
	|	ЭтоПОД
	|ИЗ
	|	(    
	|// ПОД с явно указанным объектом для выгрузки модуля менеджера
	|	ВЫБРАТЬ
	|		Правила.Ссылка КАК Ссылка,
	|		Правила.ОбъектКонфигурацииДляВыгрузкиМодуля КАК Объект,
	|		ИСТИНА КАК ЭтоПОД
	|	ИЗ Справочник.ПравилаОбработкиДанных КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|	ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|		И СоставыКонвертаций.Владелец = &Конвертация
	|		И СоставыКонвертаций.Отключить = ЛОЖЬ
	|	ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|		И Правила.ВыгружатьВМодульМенеджера = ИСТИНА
	|		И Правила.ОбъектКонфигурацииДляВыгрузкиМодуля <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ  
	|// ПОД для отправки, объект конфигурации указан в правиле
	|	ВЫБРАТЬ
	|		Правила.Ссылка КАК Ссылка,
	|		ВЫРАЗИТЬ(Правила.ОбъектВыборки КАК Справочник.Объекты) КАК Объект,
	|		ИСТИНА КАК ЭтоПОД
	|	ИЗ Справочник.ПравилаОбработкиДанных КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|	ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|		И СоставыКонвертаций.Владелец = &Конвертация
	|		И СоставыКонвертаций.Отключить = ЛОЖЬ
	|	ГДЕ Правила.ПометкаУдаления = ЛОЖЬ И Правила.ИспользоватьДляОтправки = ИСТИНА
	|		И Правила.ВыгружатьВМодульМенеджера = ИСТИНА
	|		И Правила.ОбъектКонфигурацииДляВыгрузкиМодуля = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
	|		И ВЫРАЗИТЬ(Правила.ОбъектВыборки КАК Справочник.Объекты) <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|// ПОД для получения с ПКО в ТЧ
	|	ВЫБРАТЬ
	|		Правила.Ссылка КАК Ссылка,
	|		ПКО.ОбъектКонфигурации КАК Объект,
	|		ИСТИНА КАК ЭтоПОД
	|	ИЗ Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|	ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|		И СоставыКонвертаций.Владелец = &Конвертация
	|		И СоставыКонвертаций.Отключить = ЛОЖЬ 
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|	ПО (ПКО.Код = Правила.ПравилоКонвертацииОбъекта)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций2
	|	ПО СоставыКонвертаций2.ЭлементКонвертации = ПКО.Ссылка
	|		И СоставыКонвертаций2.Владелец = &Конвертация
	|		И СоставыКонвертаций2.Отключить = ЛОЖЬ 
	|	ГДЕ Правила.Ссылка.ПометкаУдаления = ЛОЖЬ И Правила.Ссылка.ИспользоватьДляПолучения = ИСТИНА
	|		И Правила.Ссылка.ВыгружатьВМодульМенеджера = ИСТИНА
	|		И Правила.Ссылка.ОбъектКонфигурацииДляВыгрузкиМодуля = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
    |// ПОД для получения с ПКО в Ш
	|	ВЫБРАТЬ
	|		Правила.Ссылка КАК Ссылка,
	|		ПКО.ОбъектКонфигурации КАК Объект,
	|		ИСТИНА КАК ЭтоПОД
	|	ИЗ Справочник.ПравилаОбработкиДанных КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|	ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|		И СоставыКонвертаций.Владелец = &Конвертация
	|		И СоставыКонвертаций.Отключить = ЛОЖЬ 
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|	ПО (ПКО.Код = Правила.ПравилоКонвертацииОбъекта)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций2
	|	ПО СоставыКонвертаций2.ЭлементКонвертации = ПКО.Ссылка
	|		И СоставыКонвертаций2.Владелец = &Конвертация
	|		И СоставыКонвертаций2.Отключить = ЛОЖЬ 
	|	ГДЕ Правила.ПометкаУдаления = ЛОЖЬ И Правила.ИспользоватьДляПолучения = ИСТИНА
	|		И Правила.ВыгружатьВМодульМенеджера = ИСТИНА 
	|		И Правила.ОбъектКонфигурацииДляВыгрузкиМодуля = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Правила.Ссылка КАК Ссылка,
	|		ВЫБОР КОГДА Правила.ОбъектКонфигурацииДляВыгрузкиМодуля <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка) ТОГДА
	|			Правила.ОбъектКонфигурацииДляВыгрузкиМодуля
	|		ИНАЧЕ Правила.ОбъектКонфигурации КОНЕЦ КАК Объект,
	|		ЛОЖЬ КАК ЭтоПОД
	|	ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правила
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|	ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|		И СоставыКонвертаций.Владелец = &Конвертация
	|		И СоставыКонвертаций.Отключить = ЛОЖЬ
	|	ГДЕ Правила.ПометкаУдаления = ЛОЖЬ И Правила.ВыгружатьВМодульМенеджера = ИСТИНА) КАК Свод
	|ИТОГИ ПО Свод.Объект";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаОбъекты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъекты.Следующий() Цикл
		МассивПОД = Новый Массив;
		МассивПКО = Новый Массив;
		ВыборкаПравило = ВыборкаОбъекты.Выбрать();
		Пока ВыборкаПравило.Следующий() Цикл
			Если ВыборкаПравило.ЭтоПОД Тогда
				МассивПОД.Добавить(ВыборкаПравило.Правило);
			Иначе
				МассивПКО.Добавить(ВыборкаПравило.Правило);
			КонецЕсли;
		КонецЦикла;
		
		// Добавляем модуль в таблицу модулей.
		СтрокаМодуль = ПараметрыМодуля.Модули.Добавить();
		СтрокаМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский;
		СтрокаМодуль.Ссылка = ВыборкаОбъекты.Объект; 
		// Наименование это путь к вызову процедур модуля, например: Документы.АвансовыйОтчет.
		Если ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.Документ Тогда
			ИмяМодуля = "Документы."; 
			ИмяПапки = "Documents";
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.Задача Тогда
            ИмяМодуля = "Задачи.";
			ИмяПапки = "Tasks";
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.Справочник Тогда
			ИмяМодуля = "Справочники.";
			ИмяПапки = "Catalogs";
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.ПланВидовХарактеристик Тогда
			ИмяМодуля = "ПланыВидовХарактеристик."; 
			ИмяПапки = "ChartsOfCharacteristicTypes";
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.ПланВидовРасчета Тогда
			ИмяМодуля = "ПланыВидовРасчета."; 
			ИмяПапки = "ChartsOfCalculationTypes";
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.РегистрСведений Тогда
			ИмяМодуля = "РегистрыСведений.";
			ИмяПапки = "InformationRegisters";
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.РегистрНакопления Тогда 
			ИмяМодуля = "РегистрыНакопления.";
			ИмяПапки = "AccumulationRegisters";
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.РегистрРасчета Тогда
			ИмяМодуля = "РегистрыРасчета.";
			ИмяПапки = "CalculationRegisters"; 
		ИначеЕсли ВыборкаОбъекты.Тип = Перечисления.ТипыОбъектов.РегистрБухгалтерии Тогда 
			ИмяМодуля = "РегистрыНакопления.";
			ИмяПапки = "AccumulationRegisters";

		КонецЕсли;
		СтрокаМодуль.Наименование = ИмяМодуля + СокрЛП(ВыборкаОбъекты.Имя); 
		СтрокаМодуль.ЭтоМодульМенеджера = Истина;
		
		// Добавим отбор в параметры модуля.
		ПараметрыМодуля.Вставить("МассивПОД", МассивПОД);
		ПараметрыМодуля.Вставить("МассивПКО", МассивПКО);
		
		// формируем текст модуля.
		ЗаполнитьДополнительныйМодуль_Правила(СтрокаМодуль, ПараметрыМодуля);
		// Добавляем теги. 
		ТегиДляМодуляМенеджера = КонвертацияДанныхXDTOСервер.ТегиДляМодуляМенеджераОбъекта();
        СтрокаМодуль.ТекстМодуля.ВставитьСтроку(1, ТегиДляМодуляМенеджера.ТегОткрытие);
		СтрокаМодуль.ТекстМодуля.ДобавитьСтроку(ТегиДляМодуляМенеджера.ТегЗакрытие);
		КаталогиМодулейМенеджеров = Неопределено;
		Результат.Свойство("КаталогиМодулейМенеджеров", КаталогиМодулейМенеджеров);
		Если КаталогиМодулейМенеджеров = Неопределено Тогда
			КаталогиМодулейМенеджеров = Новый Структура;
		КонецЕсли;
		ИмяМодуляДляВозврата = СтрЗаменить(СокрЛП(СтрокаМодуль.Наименование), ".", "_");
		КаталогиМодулейМенеджеров.Вставить(ИмяМодуляДляВозврата, ИмяПапки);
		Результат.Вставить("КаталогиМодулейМенеджеров", КаталогиМодулейМенеджеров);
	КонецЦикла;
	
КонецПроцедуры 

// Обход строк модуля с целью замены вызовов алгоритмов.
Процедура ЗаменитьВызовыАлгоритмов(ПараметрыМодуля, ОбщийТекстМодуля)
	ВызовыАлгоритмов = ПараметрыМодуля.ВызовыАлгоритмов;
    КоличествоСтрок = ОбщийТекстМодуля.КоличествоСтрок();
	Для ОбратныйСчетчик = 0 По КоличествоСтрок - 1 Цикл
		
		НомерСтроки = КоличествоСтрок - ОбратныйСчетчик;
		
		Строка = ОбщийТекстМодуля.ПолучитьСтроку(НомерСтроки);
		СтрокаЗамены = РезультатЗаменыВызоваАлгоритма(Строка, ВызовыАлгоритмов); 
		Если СтрокаЗамены <> "" Тогда
			ОбщийТекстМодуля.ЗаменитьСтроку(НомерСтроки, СтрокаЗамены);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

// Поиск и при необходимости замена вызова алгоритма в строке модуля.
Функция РезультатЗаменыВызоваАлгоритма(Знач Строка, ВызовыАлгоритмов)
	// 1. Поиск вызова из обработчика.
	СтрокаИсходная = Строка;
	КоличествоСкобок = СтрЧислоВхождений(Строка, "("); 
	СтрокаДляПоиска = НРег(СокрЛП(Строка)); 
	УжеЗаменено = Новый Массив;
	Если КоличествоСкобок > 0
		И СтрНайти(НРег(СтрокаДляПоиска), "процедура") = 0 И СтрНайти(НРег(СтрокаДляПоиска), "функция") = 0 Тогда
		Для НомерВхождения = 1 По КоличествоСкобок Цикл
			ПозицияСкобки = СтрНайти(Строка, "(",,, НомерВхождения);
			Если ПозицияСкобки > 0 Тогда
				ПозицияСкобкиВСтрокеПоиска = СтрНайти(СтрокаДляПоиска, "(",,, НомерВхождения);
				Если ПозицияСкобкиВСтрокеПоиска > 1 Тогда
					ПозицияПробелаВСтрокеПоиска = СтрНайти(СтрокаДляПоиска, " ", НаправлениеПоиска.СКонца, ПозицияСкобкиВСтрокеПоиска - 1, 1); 
					ПозицияПредыдущейСкобкиВСтрокеПоиска = СтрНайти(СтрокаДляПоиска, "(", НаправлениеПоиска.СКонца, ПозицияСкобкиВСтрокеПоиска - 1, 1);
				Иначе
					ПозицияПробелаВСтрокеПоиска = СтрНайти(СтрокаДляПоиска, " ", НаправлениеПоиска.СКонца); 
					ПозицияПредыдущейСкобкиВСтрокеПоиска = СтрНайти(СтрокаДляПоиска, "(", НаправлениеПоиска.СКонца);
				КонецЕсли;
				Если ПозицияПробелаВСтрокеПоиска = 0 И ПозицияПредыдущейСкобкиВСтрокеПоиска = 0 Тогда
					НачалоИмениАлгоритма = 0;
				Иначе
					НачалоИмениАлгоритма = Макс(ПозицияПробелаВСтрокеПоиска, ПозицияПредыдущейСкобкиВСтрокеПоиска);
				КонецЕсли;
				ВозможноеИмяАлгоритма = Сред(СтрокаДляПоиска, НачалоИмениАлгоритма + 1, ПозицияСкобкиВСтрокеПоиска - НачалоИмениАлгоритма);
				Если СтрНайти(ВозможноеИмяАлгоритма, ".") > 0 Или УжеЗаменено.Найти(ВозможноеИмяАлгоритма) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ЗаменаИмениАлгоритма = ВызовыАлгоритмов.Получить(ВозможноеИмяАлгоритма);
				Если ЗаменаИмениАлгоритма <> Неопределено Тогда
					ДлинаИмениАлгоритма = СтрДлина(ВозможноеИмяАлгоритма);
					ИсходноеИмяАлгоритма = Сред(Строка,ПозицияСкобки - ДлинаИмениАлгоритма + 1, ДлинаИмениАлгоритма);
					Строка = СтрЗаменить(Строка,ИсходноеИмяАлгоритма, ЗаменаИмениАлгоритма); 
					УжеЗаменено.Добавить(ВозможноеИмяАлгоритма);
				КонецЕсли;     
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если СтрокаИсходная <> Строка Тогда
		Возврат Строка;
	КонецЕсли;
	// 2. Поиск из логики формирования таблицы ПКО.
	Если СтрНайти(СтрокаДляПоиска,НРег(".ПослеЗагрузкиВсехДанных")) > 0 Тогда
		ПозицияКавычки1 = СтрНайти(Строка, """",,,1); 
		ПозицияКавычки2 = СтрНайти(Строка, """",,,2);
		Если ПозицияКавычки1 > 0 И ПозицияКавычки2 > 0 Тогда
			ИмяАлгоритма = Сред(Строка, ПозицияКавычки1 + 1, ПозицияКавычки2 - ПозицияКавычки1 - 1);
			ЗаменаИмениАлгоритма = ВызовыАлгоритмов.Получить(НРег(ИмяАлгоритма)+"("); 
			Если ЗаменаИмениАлгоритма <> Неопределено Тогда
				ЗаменаИмениАлгоритма = СтрЗаменить(ЗаменаИмениАлгоритма,"(", "");
				Возврат Лев(Строка, ПозицияКавычки1) + ЗаменаИмениАлгоритма + Сред(Строка, ПозицияКавычки2); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции
#КонецОбласти
#Область ФормированиеТекстаМодулей 
// Заголовок экспортного модуля.
Процедура ДобавитьЗаголовокМодуля(ОбщийТекстМодуля) 
	// Первая строка - имя конвертации.
	СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '// Менеджер обмена через универсальный формат (%1 от %2)'"),
		Конвертация.Наименование,
		ТекущаяДатаСеанса());
	ОбщийТекстМодуля.ДобавитьСтроку("////////////////////////////////////////////////////////////////////////////////");
	ОбщийТекстМодуля.ДобавитьСтроку(СтрокаЗаголовка);
	ОбщийТекстМодуля.ДобавитьСтроку("//");
	ОбщийТекстМодуля.ДобавитьСтроку("////////////////////////////////////////////////////////////////////////////////");	
КонецПроцедуры

// Уникальный идентификатор модуля.
Процедура ДобавитьУИДМодуля(ОбщийТекстМодуля)
	// Функция уникального идентификатора модуля.
	СтрокаУИД = """" + СокрЛП(Новый УникальныйИдентификатор()) + """";
	ОбщийТекстМодуля.ДобавитьСтроку("Функция Подключаемый_ИдентификаторМодуля() Экспорт"); 
	ОбщийТекстМодуля.ДобавитьСтроку(Символы.Таб + "Возврат " + СтрокаУИД + ";");
	ОбщийТекстМодуля.ДобавитьСтроку("КонецФункции");
КонецПроцедуры 

// Версия формата менеджера обмена.
Функция ПолучитьВерсиюФорматаМенеджера(МакетТекстовМодулей)
	ВерсияФорматаМенеджераТекст = МакетТекстовМодулей.ПолучитьОбласть("ВерсияФорматаМенеджераОбмена").ПолучитьТекст();
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст,
		"#Область ВерсияФорматаМенеджераОбмена" + Символы.ПС, "");
	ВерсияФорматаМенеджераТекст = СтрЗаменить(ВерсияФорматаМенеджераТекст, "&ВерсияФорматаМенеджераОбмена", 
									"""" + КонвертацияДанныхXDTOСервер.ВерсияФорматаМенеджераОбмена(Конвертация) + """");
	Возврат ВерсияФорматаМенеджераТекст;
КонецФункции

// Параметры конвертации.
Процедура ЗаполнитьТекстПроцедурыПараметры(ПараметрыМодуля, ТекстМодуля)
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	ОбластьКомментарий = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Параметры_Комментарий");
	ТекстПроцедуры.Вывести(ОбластьКомментарий);
	
	ОбластьШапки = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ЗаполнитьПараметрыКонвертации_Заголовок");
	ТекстПроцедуры.Вывести(ОбластьШапки);

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|Параметр КАК Параметр
	|ИЗ Справочник.Конвертации.Параметры
	|ГДЕ Ссылка = &Конвертация И ВременнаяКопия = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО НомерСтроки
	|";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстПроцедуры.ДобавитьСтроку(Символы.Таб
		+ "ПараметрыКонвертации.Вставить(" + """" + СокрЛП(Выборка.Параметр) + """" + ");");
	КонецЦикла;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстМодуля.ДобавитьСтроку("#Область ПараметрыКонвертации");
	ТекстМодуля.ДобавитьСтроку(ТекстПроцедуры.ПолучитьТекст());
	ТекстМодуля.ДобавитьСтроку("#КонецОбласти");
КонецПроцедуры

// Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных.
Процедура ЗаполнитьТекстПроцедурыПКПД(ПараметрыМодуля)
	ТекстМодуля = ПараметрыМодуля.ПрограммныйИнтерфейс;
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	ТекстПроцедуры.ДобавитьСтроку("#Область ПКПД");
	ОбластьКомментарий = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПроцедурыПКПД_Комментарий");
	ТекстПроцедуры.Вывести(ОбластьКомментарий);
	
	ОбластьШапки = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ЗаполнитьПравилаКонвертацииПредопределенныхДанных_Заголовок");
	ТекстПроцедуры.Вывести(ОбластьШапки);
	
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииПредопределенныхДанных");
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииПредопределенныхДанных");
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("ПравилаКонвертацииПредопределенныхДанных");
	КонецЕсли;

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросОбъекты = Новый Запрос;
	ЗапросОбъекты.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросОбъекты.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка 
	|ПОМЕСТИТЬ КОбработке
	|ИЗ (" + КОбработке + ") КАК Свод
	|;
	|///////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПКПД.Ссылка КАК Ссылка,
	|	ПКПД.Код КАК Наименование,
	|	ПКПД.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	ПКПД.ОбъектФормата КАК ОбъектФормата,
	|	ПКПД.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
	|	ПКПД.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
	|	ОК.Тип КАК ТипДанных
	|	ИЗ
	|		Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПКПД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОК
	|			ПО ПКПД.ОбъектКонфигурации = ОК.Наименование
	|				И ОК.Владелец = &Конфигурация
	|	ГДЕ
	|		ПКПД.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке) 
	|УПОРЯДОЧИТЬ ПО
	|	ПКПД.Код
	|";
	ЗапросОбъекты.УстановитьПараметр("Конфигурация", ПараметрыМодуля.Релиз);
	ЗапросОбъекты.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросОбъекты.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	ТекстДляОтправки = Новый ТекстовыйДокумент;
	ТекстДляПолучения = Новый ТекстовыйДокумент;
	ТекстОбщий = Новый ТекстовыйДокумент;
	
	Выборка = ЗапросОбъекты.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПолучитьОбластьСТекстомПКПД(ПараметрыМодуля, Выборка, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий);
	КонецЦикла;
	ДополнитьТекстПроцедурыСУсловиями(ТекстПроцедуры, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий);
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры"); 
	ТекстПроцедуры.ДобавитьСтроку("#КонецОбласти");
	ТекстМодуля.ДобавитьСтроку(ТекстПроцедуры.ПолучитьТекст());
КонецПроцедуры

Процедура ПолучитьОбластьСТекстомПКПД(ПараметрыМодуля, Выборка, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий)
	ТегиПравила = ПолучитьТегиДляПравила(Выборка.Ссылка, ПараметрыМодуля);
	ТегиПравила.ТегОткрытие = ДобавитьОтступыВСтроку(ТегиПравила.ТегОткрытие);
	ТегиПравила.ТегЗакрытие = ДобавитьОтступыВСтроку(ТегиПравила.ТегЗакрытие);
	// Добавить к тегам перевод строки если необходимо
	Если ЗначениеЗаполнено(ТегиПравила.ТегОткрытие) И Прав(ТегиПравила.ТегОткрытие,1) <> Символы.ПС Тогда
		ТегиПравила.ТегОткрытие = ТегиПравила.ТегОткрытие + Символы.ПС;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТегиПравила.ТегЗакрытие) И Прав(ТегиПравила.ТегЗакрытие,1) <> Символы.ПС Тогда
		ТегиПравила.ТегЗакрытие = ТегиПравила.ТегЗакрытие + Символы.ПС;
	КонецЕсли;

	ОбластьСтрока = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ЗаполнитьПравилаКонвертацииПредопределенныхДанных_СтрокаПравила");
	ОбластьСтрокаТекст = ОбластьСтрока.ПолучитьТекст();
	ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "#Область Конвертация_ЗаполнитьПравилаКонвертацииПредопределенныхДанных_СтрокаПравила", "---");
	ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "[Наименование]", СокрЛП(Выборка.Наименование));
	ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "[ОбъектФормата]", СокрЛП(Выборка.ОбъектФормата));
	
	ОбъектДанных = ПолучитьТипМетаданные(Выборка.ТипДанных, Выборка.ОбъектКонфигурации);
	ОбластьСтрокаТекст = СтрЗаменить(ОбластьСтрокаТекст, "[ОбъектДанных]", ОбъектДанных);
	// Правила конвертации значений.
	ТекстЗначенияДляОтправки = Символы.Таб + "ЗначенияДляОтправки = Новый Соответствие;";
	ТекстЗначенияДляПолучения = Символы.Таб + "ЗначенияДляПолучения = Новый Соответствие;";
	ЗапросСопоставление = Новый Запрос;
	ЗапросСопоставление.УстановитьПараметр("ПКПД", Выборка.Ссылка);
	ЗапросСопоставление.Текст = "ВЫБРАТЬ
	|	ЗначениеКонфигурации,
	|	ЗначениеФормата,
	|	Тег.Наименование КАК ТегВырезки
	|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений
	|ГДЕ Ссылка = &ПКПД
	|УПОРЯДОЧИТЬ ПО ЗначениеКонфигурации, ЗначениеФормата";
	ТаблицаСопоставления = ЗапросСопоставление.Выполнить().Выгрузить();
	Для Каждого ПКЗ Из ТаблицаСопоставления Цикл
		СтрокаЗначениеМетаданных = ПолучитьТипМетаданные(Выборка.ТипДанных, Выборка.ОбъектКонфигурации, Истина)
		+ "." + СокрЛП(ПКЗ.ЗначениеКонфигурации);
		СтрокаЗначениеФормата = """"+СокрЛП(ПКЗ.ЗначениеФормата)+"""";
		
		ТегОткрытие = "";
		ТегЗакрытие = "";
		Если ЗначениеЗаполнено(ПКЗ.ТегВырезки) Тогда
			ТегОткрытие = "//++ " + СокрЛП(ПКЗ.ТегВырезки);
			ТегЗакрытие = "//-- " + СокрЛП(ПКЗ.ТегВырезки);
		КонецЕсли;
		Если Выборка.ИспользоватьДляОтправки Тогда
			ТекстЗначенияДляОтправки = ТекстЗначенияДляОтправки + Символы.ПС 
			+ ?(ТегОткрытие = "", "", Символы.Таб + ТегОткрытие + Символы.ПС)
			+ Символы.Таб + "ЗначенияДляОтправки.Вставить(" + СтрокаЗначениеМетаданных + ", " 
			+ СтрокаЗначениеФормата + ");"
			+ ?(ТегЗакрытие = "", "", Символы.ПС + Символы.Таб + ТегЗакрытие);
		КонецЕсли;
		Если Выборка.ИспользоватьДляПолучения Тогда
			ТекстЗначенияДляПолучения = ТекстЗначенияДляПолучения + Символы.ПС 
			+ ?(ТегОткрытие = "", "", Символы.Таб + ТегОткрытие + Символы.ПС)
			+ Символы.Таб + "ЗначенияДляПолучения.Вставить(" + СтрокаЗначениеФормата + ", "
			+  СтрокаЗначениеМетаданных + ");"
			+ ?(ТегЗакрытие = "", "", Символы.ПС + Символы.Таб + ТегЗакрытие);
		КонецЕсли;
	КонецЦикла;
	ТекстЗначенияДляОтправки = ТекстЗначенияДляОтправки + Символы.ПС + Символы.Таб 
	+ "ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;";
	ТекстЗначенияДляПолучения = ТекстЗначенияДляПолучения + Символы.ПС + Символы.Таб 
	+ "ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;";
	Если Выборка.ИспользоватьДляОтправки И Выборка.ИспользоватьДляПолучения Тогда
		Если ЗначениеЗаполнено(ТегиПравила.ТегОткрытие) Тогда
			ТекстОбщий.ДобавитьСтроку(ТегиПравила.ТегОткрытие);
		КонецЕсли;

		ТекстОбщий.ДобавитьСтроку(ОбластьСтрокаТекст);
		ТекстОбщий.ДобавитьСтроку(ТекстЗначенияДляОтправки);
		ТекстОбщий.ДобавитьСтроку(ТекстЗначенияДляПолучения);
	 	Если ЗначениеЗаполнено(ТегиПравила.ТегЗакрытие) Тогда
			ТекстОбщий.ДобавитьСтроку(ТегиПравила.ТегЗакрытие);
		КонецЕсли;
	ИначеЕсли Выборка.ИспользоватьДляОтправки Тогда
		Если ЗначениеЗаполнено(ТегиПравила.ТегОткрытие) Тогда
			ТекстДляОтправки.ДобавитьСтроку(ТегиПравила.ТегОткрытие);
		КонецЕсли;
		ТекстДляОтправки.ДобавитьСтроку(ОбластьСтрокаТекст);
		ТекстДляОтправки.ДобавитьСтроку(ТекстЗначенияДляОтправки);
 		Если ЗначениеЗаполнено(ТегиПравила.ТегЗакрытие) Тогда
			ТекстДляОтправки.ДобавитьСтроку(ТегиПравила.ТегЗакрытие);
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ТегиПравила.ТегОткрытие) Тогда
			ТекстДляПолучения.ДобавитьСтроку(ТегиПравила.ТегОткрытие);
		КонецЕсли;
		ТекстДляПолучения.ДобавитьСтроку(ОбластьСтрокаТекст);
		ТекстДляПолучения.ДобавитьСтроку(ТекстЗначенияДляПолучения);
 		Если ЗначениеЗаполнено(ТегиПравила.ТегЗакрытие) Тогда
			ТекстДляПолучения.ДобавитьСтроку(ТегиПравила.ТегЗакрытие);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Процедура ЗаполнитьПравилаОбработкиДанных.
Процедура ЗаполнитьТекстПроцедурыПОД(ТекстыПоГруппам, ПараметрыМодуля)
	
	ЗапросОбъекты = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросОбъекты.МенеджерВременныхТаблиц = МенеджерВТ;
	ПрефиксВызоваОбработчика = "";
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаОбработкиДанных");
			КОбработке_ПКО = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииОбъектов"); 
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("ПравилаОбработкиДанных");
			КОбработке_ПКО = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов"); 
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("ПравилаОбработкиДанных");
		КОбработке_ПКО = ТекстЗапросаБезСовместнойРаботы("ПравилаКонвертацииОбъектов"); 
	КонецЕсли;
	Если ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		// Отбор по модулю либо по массиву правил. 
		Если ПараметрыМодуля.ТекущийМодуль.ЭтоМодульМенеджера Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод
			|ГДЕ Свод.Ссылка В (&МассивПОД) 
			|; ";
			ЗапросОбъекты.УстановитьПараметр("МассивПОД", ПараметрыМодуля.МассивПОД);
		ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод
			|ГДЕ Свод.Ссылка.ДополнительныйМодуль = &ДополнительныйМодуль И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|; ";
			ЗапросОбъекты.УстановитьПараметр("ДополнительныйМодуль", ПараметрыМодуля.ТекущийМодуль.Ссылка);
		ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляОтправки = ИСТИНА И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И (ЕстьNULL(ВЫРАЗИТЬ(Свод.Ссылка.ОбъектВыборки КАК Справочник.Объекты).Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ) 
			|		ИЛИ Свод.Ссылка.Наименование ПОДОБНО ""%Документ%"")
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|; ";
        ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляОтправки = ИСТИНА И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И НЕ (ЕстьNULL(ВЫРАЗИТЬ(Свод.Ссылка.ОбъектВыборки КАК Справочник.Объекты).Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ) 
			|		ИЛИ Свод.Ссылка.Наименование ПОДОБНО ""%Документ%"")
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|; ";

		ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляПолучения = ИСТИНА И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И (ВЫРАЗИТЬ(Свод.Ссылка.ОбъектВыборки КАК Строка(50)) ПОДОБНО ""Документ.%"" ИЛИ Свод.Ссылка.Наименование ПОДОБНО ""%Документ%"")
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|; ";

		Иначе
			// Прочее получение
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляПолучения = ИСТИНА И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И НЕ (ВЫРАЗИТЬ(Свод.Ссылка.ОбъектВыборки КАК Строка(50)) ПОДОБНО ""Документ.%"" ИЛИ Свод.Ссылка.Наименование ПОДОБНО ""%Документ%"")
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|; ";
		КонецЕсли;
		ПрефиксВызоваОбработчика = СокрЛП(ПараметрыМодуля.ТекущийМодуль.Наименование) + ".";
	Иначе
		ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|; "

	КонецЕсли;
	ПараметрыМодуля.Вставить("ПрефиксВызоваОбработчика", ПрефиксВызоваОбработчика);
	ЗапросОбъекты.Текст = ЗапросОбъекты.Текст + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка.Код КАК ИмяПКО,
	|	Ссылка.ОбъектКонфигурации КАК ОбъектКонфигурации
	|ПОМЕСТИТЬ ПКОДляПолучения
	|ИЗ (" + КОбработке_ПКО + ") КАК Свод
	|ГДЕ Ссылка.ИспользоватьДляПолучения = ИСТИНА
	|";
	ЗапросОбъекты.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросОбъекты.УстановитьПараметр("Конфигурация", ПараметрыМодуля.Релиз);
	ЗапросОбъекты.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	ЗапросОбъекты.Выполнить();
	
	ЗапросПОД = Новый Запрос;
	ЗапросПОД.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросПОД.Текст = "ВЫБРАТЬ 
	|	ПОД.Ссылка,
	|	0 КАК Направление
	|ПОМЕСТИТЬ ТабПравил
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПОД
	|ГДЕ
	|	ПОД.ИспользоватьДляОтправки = ИСТИНА
	|	И ПОД.ИспользоватьДляПолучения = ЛОЖЬ
	|	И ПОД.Ссылка В (ВЫБРАТЬ КОбработке.Ссылка ИЗ КОбработке)
	|	И НЕ ПОД.Отключить
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПОД.Ссылка,
	|	1
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПОД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов КАК ПОД_ПКО
	|	ПО ПОД.Ссылка = ПОД_ПКО.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПКОДляПолучения КАК ПКО
	|ПО (ПКО.ИмяПКО = ПОД_ПКО.ПравилоКонвертацииОбъекта
	|	ИЛИ ПКО.ИмяПКО = ПОД.ПравилоКонвертацииОбъекта)
	|ГДЕ
	|	ПОД.ИспользоватьДляОтправки = ЛОЖЬ
	|	И ПОД.ИспользоватьДляПолучения = ИСТИНА
	|	И ПОД.Ссылка В (ВЫБРАТЬ КОбработке.Ссылка ИЗ КОбработке)
	|	И НЕ ПОД.Отключить
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПОД.Ссылка,
	|	2
	|ИЗ
	|	Справочник.ПравилаОбработкиДанных КАК ПОД
	|ГДЕ
	|	ПОД.ИспользоватьДляОтправки = ИСТИНА
	|	И ПОД.ИспользоватьДляПолучения = ИСТИНА
	|	И ПОД.Ссылка В (ВЫБРАТЬ КОбработке.Ссылка ИЗ КОбработке)
	|	И НЕ ПОД.Отключить
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка.Наименование КАК Наименование,
	|	Ссылка КАК Правило,
	|	Направление 
	|ИЗ 
	|	ТабПравил КАК ТабПравил
	|УПОРЯДОЧИТЬ ПО
	|	Направление,
	|	Ссылка.Наименование
	|ИТОГИ ПО
	|	Направление
	|;  
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ 
	|	Ссылка,
	|	ПравилоКонвертацииОбъекта, 
	|	Наименование, 
	|	Код, 
	|	ОбъектВыборки, 
	|	ОбъектКонфигурации, 
	|	ИспользоватьДляОтправки, 
	|	ИспользоватьДляПолучения, 
	|	ПриОбработке, 
	|	ВыборкаДанных, 
	|	ТипОбъектаВыборки, 
	|	Свод.ГруппаПравил КАК ГруппаПравил, 
	|	ОчисткаДанных
	|ИЗ (
	|		ВЫБРАТЬ
	|			ТабПравил.Ссылка КАК Ссылка,
	|			ТабПравил.Ссылка.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
	|			ТабПравил.Ссылка.Наименование КАК Наименование,
	|			ТабПравил.Ссылка.Наименование КАК Код,
	|			ТабПравил.Ссылка.ОбъектВыборки КАК ОбъектВыборки,
	|			ВЫБОР
	|				КОГДА ТабПравил.Ссылка.ИспользоватьДляОтправки
	|				ТОГДА ТабПравил.Ссылка.ОбъектВыборки
	|				ИНАЧЕ """"
	|			КОНЕЦ КАК ОбъектКонфигурации,
	|			ТабПравил.Ссылка.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
	|			ТабПравил.Ссылка.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
	|			ТабПравил.Ссылка.АлгоритмПриОбработке КАК ПриОбработке,
	|			ВЫБОР
	|				КОГДА ТабПравил.Ссылка.ИспользоватьДляОтправки
	|					ТОГДА ТабПравил.Ссылка.АлгоритмВыборкаДанных
	|				ИНАЧЕ """"
	|			КОНЕЦ КАК ВыборкаДанных,
	|			ВЫБОР
	|				КОГДА ТабПравил.Ссылка.ИспользоватьДляОтправки
	|					ТОГДА ВЫРАЗИТЬ(ТабПравил.Ссылка.ОбъектВыборки КАК Справочник.Объекты).Тип
	|				ИНАЧЕ """"
	|			КОНЕЦ КАК ТипОбъектаВыборки,
	|			ВЫРАЗИТЬ(ТабПравил.Ссылка.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
	|			ТабПравил.Ссылка.ОчисткаДанных КАК ОчисткаДанных
	|		ИЗ
	|			ТабПравил КАК ТабПравил
	|) КАК Свод
	|УПОРЯДОЧИТЬ ПО
	|	Свод.ГруппаПравил,
	|	Свод.Наименование
	|ИТОГИ ПО
	|	Свод.ГруппаПравил
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабПКО.ПравилоКонвертацииОбъекта КАК ПКО,
	|	ТабПравил.Ссылка КАК ПОД
	|ИЗ
	|	ТабПравил КАК ТабПравил
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов КАК ТабПКО
	|	ПО ТабПКО.Ссылка = ТабПравил.Ссылка
	|	УПОРЯДОЧИТЬ ПО ПКО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабПравил
	|";
	ЗапросПОД.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросПОД.УстановитьПараметр("Конфигурация", ПараметрыМодуля.Релиз);
	
	ТелоПроцедуры = Новый ТекстовыйДокумент;
	РезультатЗапроса = ЗапросПОД.ВыполнитьПакет();
	ВыборкаПоНаправлению = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СоответствиеТеги = Новый Соответствие();
	ЕслиОткрыто = Ложь;
	Пока ВыборкаПоНаправлению.Следующий() Цикл
		
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			ТелоПроцедуры = ПараметрыМодуля.ПОД_Отправка;
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			ТелоПроцедуры = ПараметрыМодуля.ПОД_Получение;
		КонецЕсли;
	
		ВыборкаДетальная = ВыборкаПоНаправлению.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ТегиДляПравила = ПолучитьТегиДляПравила(ВыборкаДетальная.Правило, ПараметрыМодуля);
			СоответствиеТеги.Вставить(ВыборкаДетальная.Правило, ТегиДляПравила);
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегОткрытие) Тогда
				ТелоПроцедуры.ДобавитьСтроку(ТегиДляПравила.ТегОткрытие);
			КонецЕсли;
			Строка = ПараметрыМодуля.ПрефиксВызоваОбработчика + "ДобавитьПОД_" + ВыборкаДетальная.Наименование + "(ПравилаОбработкиДанных);";
			ТелоПроцедуры.ДобавитьСтроку(Строка);
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегЗакрытие) Тогда
				ТелоПроцедуры.ДобавитьСтроку(ТегиДляПравила.ТегЗакрытие);
			КонецЕсли;
		КонецЦикла;
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			ПараметрыМодуля.ПОД_Отправка = ТелоПроцедуры;
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			ПараметрыМодуля.ПОД_Получение = ТелоПроцедуры;
		КонецЕсли;
	КонецЦикла;

	ТабПКО = РезультатЗапроса[3].Выгрузить();
	ТабПКО.Индексы.Добавить("ПОД");
	ВыборкаПоГруппе = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоГруппе.Следующий() Цикл
		ОбластьГруппаТекст = "";
		ТекГруппаПравил = ВыборкаПоГруппе.ГруппаПравил;
		ПривестиИмяГруппыПравил(ТекГруппаПравил);
		ВыборкаДетальная = ВыборкаПоГруппе.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ТегиДляПравила = СоответствиеТеги.Получить(ВыборкаДетальная.Ссылка);
			КоллекцияПКО = ТабПКО.НайтиСтроки(Новый Структура("ПОД", ВыборкаДетальная.Ссылка));
			ОбластьПОДТекст = ПолучитьОбластьСТекстомПОД(ПараметрыМодуля, ВыборкаДетальная, КоллекцияПКО, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила);
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегОткрытие) Тогда
				ОбластьПОДТекст = ТегиДляПравила.ТегОткрытие + Символы.ПС + ОбластьПОДТекст;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегЗакрытие) Тогда
				ОбластьПОДТекст = ОбластьПОДТекст + Символы.ПС + ТегиДляПравила.ТегЗакрытие;
			КонецЕсли;
			Если ОбластьГруппаТекст = "" Тогда
				ОбластьГруппаТекст = ОбластьПОДТекст;
			Иначе
				ОбластьГруппаТекст = ОбластьГруппаТекст + Символы.ПС + ОбластьПОДТекст;
			КонецЕсли;
		КонецЦикла;

		Если НЕ ПустаяСтрока(ТекГруппаПравил)
			И НЕ ПредопределеннаяГруппаПравил(ТекГруппаПравил) Тогда
			Если ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПОД.Свойство(ТекГруппаПравил) Тогда
				ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПОД[ТекГруппаПравил].ДобавитьСтроку(ОбластьГруппаТекст);
			Иначе
				РазделПравил = Новый ТекстовыйДокумент;
				РазделПравил.ДобавитьСтроку(ОбластьГруппаТекст);
				ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПОД.Вставить(ТекГруппаПравил, РазделПравил);
			КонецЕсли;
		Иначе
			ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПОД.ДобавитьСтроку(ОбластьГруппаТекст);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

Функция ПолучитьОбластьСТекстомПОД(ПараметрыМодуля, ВыборкаДетальная, КоллекцияПКО, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила)
	ПостфиксЗаголовкаОбработчика = "";
	Если ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		ПостфиксЗаголовкаОбработчика = " Экспорт";
	КонецЕсли;

	ОбластьПОДТекст = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("ПОД").ПолучитьТекст();
	ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "#Область ПОД" + Символы.ПС, "");
	
	ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ИмяПОДДляТаблицы", СокрЛП(ВыборкаДетальная.Наименование));
	ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ИмяПОД", "ДобавитьПОД_" + СокрЛП(ВыборкаДетальная.Наименование));
	ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&Постфикс", ПостфиксЗаголовкаОбработчика);
	
	Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
		ОбъектВыборкиМетаданные = ПолучитьТипМетаданные(ВыборкаДетальная.ТипОбъектаВыборки, ВыборкаДетальная.ОбъектВыборки);
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиМетаданные", ОбъектВыборкиМетаданные);
	Иначе
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиМетаданные", "---");
	КонецЕсли;
	
	Если ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиФормат", СокрЛП(ВыборкаДетальная.ОбъектВыборки));
		Если ПараметрыМодуля.ЗапретитьПереводИменОбъектовФормата Тогда
			ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ТегЗапретПеревода", " //@NON-NLS-1");
		Иначе
			ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ТегЗапретПеревода", "");
		КонецЕсли;
	Иначе
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОбъектВыборкиФормат", "---");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаДетальная.ПриОбработке) Тогда
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ПриОбработке",
			"ПОД_" + СокрЛП(ВыборкаДетальная.Наименование) + "_ПриОбработке");
	Иначе
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ПриОбработке", "---");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаДетальная.ВыборкаДанных)
		И ВыборкаДетальная.ИспользоватьДляОтправки Тогда
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ВыборкаДанных",
			"ПОД_" + СокрЛП(ВыборкаДетальная.Наименование) + "_ВыборкаДанных");
	Иначе
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ВыборкаДанных", "---");
	КонецЕсли;
	Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОчисткаДанных", ?(ВыборкаДетальная.ОчисткаДанных, "Истина", "Ложь"));
	Иначе
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ОчисткаДанных", "---");
	КонецЕсли;
	ЗаполнениеМассиваПравил = Новый ТекстовыйДокумент;
	Если КоллекцияПКО.Количество() > 0
		Или ЗначениеЗаполнено(ВыборкаДетальная.ПравилоКонвертацииОбъекта) Тогда
		Для Каждого Строка Из КоллекцияПКО Цикл
			ЗаполнениеМассиваПравил.ДобавитьСтроку("ПравилоОбработки.ИспользуемыеПКО.Добавить(""" + Строка.ПКО + """);");
		КонецЦикла;
		Если ЗначениеЗаполнено(ВыборкаДетальная.ПравилоКонвертацииОбъекта) Тогда
			ЗаполнениеМассиваПравил.ДобавитьСтроку("ПравилоОбработки.ИспользуемыеПКО.Добавить(""" + ВыборкаДетальная.ПравилоКонвертацииОбъекта + """);");
		КонецЕсли;
		ЗаполнениеМассиваПравилТекст = ДобавитьОтступыВСтроку(ЗаполнениеМассиваПравил.ПолучитьТекст());
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ЗаполнениеМассиваПравил", ЗаполнениеМассиваПравилТекст);
	Иначе
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&ЗаполнениеМассиваПравил", "---");
	КонецЕсли;
	Если ПараметрыМодуля.ИспользоватьТипизациюПеременных Тогда
		ОбластьПОДКомментарий = ПараметрыМодуля.МакетТекстовМодулейДетализацияКомментариев.ПолучитьОбласть("Комментарий_ДобавитьПОД").ПолучитьТекст(); 
		ОбластьПОДКомментарий = СтрЗаменить(ОбластьПОДКомментарий, "#Область Комментарий_ДобавитьПОД", "---");
		ОбластьПОДТекст = ОбластьПОДКомментарий + ОбластьПОДТекст;
	КонецЕсли; 
	ТекстОбработчики = "";
	ДобавитьОбработчикиВТекстМодуля("ПОД", "ПриОбработке", 
		ВыборкаДетальная, ПараметрыМодуля, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила, ТекстОбработчики);
	Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
		ДобавитьОбработчикиВТекстМодуля("ПОД", "ВыборкаДанных", 
			ВыборкаДетальная, ПараметрыМодуля, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила, ТекстОбработчики);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстОбработчики) Тогда
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&Обработчики", ТекстОбработчики);
	Иначе
		ОбластьПОДТекст = СтрЗаменить(ОбластьПОДТекст, "&Обработчики", "---");
	КонецЕсли;
	Возврат ОбластьПОДТекст;
КонецФункции

// Процедура ЗаполнитьПравилаКонвертацииОбъектов
Процедура ЗаполнитьТекстПроцедурыПКО(ТекстыПоГруппам, ПараметрыМодуля)
	
	ВсяПроцедура = Новый ТекстовыйДокумент;
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("ПравилаКонвертацииОбъектов");
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов");
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("ПравилаКонвертацииОбъектов");
	КонецЕсли;
	ЗапросОбъекты = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросОбъекты.МенеджерВременныхТаблиц = МенеджерВТ;
	ПрефиксВызоваОбработчика = "";

	Если ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		// Отбор по модулю либо по массиву правил.
		Если ПараметрыМодуля.ТекущийМодуль.ЭтоМодульМенеджера Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод
			|ГДЕ Свод.Ссылка В (&МассивПКО) 
			|; ";
			ЗапросОбъекты.УстановитьПараметр("МассивПКО", ПараметрыМодуля.МассивПКО);
		ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод
			|ГДЕ Свод.Ссылка.ДополнительныйМодуль = &ДополнительныйМодуль И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|; ";
			ЗапросОбъекты.УстановитьПараметр("ДополнительныйМодуль", ПараметрыМодуля.ТекущийМодуль.Ссылка);
		ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляОтправки = ИСТИНА И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|	И (ЕстьNULL(Свод.Ссылка.ОбъектКонфигурации.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
			|		ИЛИ (Свод.Ссылка.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
			|			И Свод.Ссылка.ОбъектФормата ПОДОБНО ""Документ.%"" )
			|	)
			|; ";
        ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляОтправки = ИСТИНА И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|	И НЕ (ЕстьNULL(Свод.Ссылка.ОбъектКонфигурации.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
			|		ИЛИ (Свод.Ссылка.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
			|		И Свод.Ссылка.ОбъектФормата ПОДОБНО ""Документ.%"" ))
			|; ";

		ИначеЕсли ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение Тогда
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляОтправки = ЛОЖЬ И Свод.Ссылка.ИспользоватьДляПолучения = ИСТИНА 
			|	И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|	И (ЕстьNULL(Свод.Ссылка.ОбъектКонфигурации.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
			|		ИЛИ (Свод.Ссылка.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
			|			И Свод.Ссылка.ОбъектФормата ПОДОБНО ""Документ.%"" ))
			|; ";

		Иначе
			// Прочее получение
			ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод 
			|ГДЕ Свод.Ссылка.ИспользоватьДляОтправки = ЛОЖЬ И Свод.Ссылка.ИспользоватьДляПолучения = ИСТИНА
			|	И Свод.Ссылка.ВыгружатьВМодульМенеджера = ЛОЖЬ
			|	И Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|	И НЕ (ЕстьNULL(Свод.Ссылка.ОбъектКонфигурации.Тип, ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.Документ)
			|		ИЛИ (Свод.Ссылка.ОбъектКонфигурации = ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
			|			И Свод.Ссылка.ОбъектФормата ПОДОБНО ""Документ.%"" ))
			|; ";
		КонецЕсли; 
		ПрефиксВызоваОбработчика = СокрЛП(ПараметрыМодуля.ТекущийМодуль.Наименование) + ".";
	Иначе
		ЗапросОбъекты.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|; ";  
	КонецЕсли;
	ПараметрыМодуля.Вставить("ПрефиксВызоваОбработчика", ПрефиксВызоваОбработчика);
	ЗапросОбъекты.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросОбъекты.УстановитьПараметр("Конфигурация", ПараметрыМодуля.Релиз);
	ЗапросОбъекты.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	ЗапросОбъекты.Выполнить();
	// Заполняем версии формата с их расширениями.
	ЗапросВерсииФормата = Новый Запрос;
	ЗапросВерсииФормата.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|  Расширения.Расширение КАК ВерсияРасширение
	|ИЗ Справочник.ВерсииФормата КАК ВерсииФормата
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВзаимосвязиВерсийФорматовИРасширений КАК Расширения
	|ПО ВерсииФормата.Ссылка = Расширения.ВерсияФорматаОбмена
	|ГДЕ ВерсииФормата.Ссылка В (&ВерсииФормата)";
	ЗапросВерсииФормата.УстановитьПараметр("ВерсииФормата", Конвертация.ВерсииФормата.ВыгрузитьКолонку("ВерсияФормата"));
	
	ЗапросПКО = Новый Запрос;
	ЗапросПКО.УстановитьПараметр("ВерсииФормата", ЗапросВерсииФормата.Выполнить().Выгрузить().ВыгрузитьКолонку("ВерсияРасширение"));
	ЗапросПКО.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросПКО.Текст = "ВЫБРАТЬ
	|	ПКО.Ссылка,
	|	0 КАК Направление
	|ПОМЕСТИТЬ ТабПравил
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|ГДЕ
	|	ПКО.ИспользоватьДляОтправки = ИСТИНА
	|	И ПКО.ИспользоватьДляПолучения = ЛОЖЬ
	|	И НЕ ПКО.Отключить
	|	И ПКО.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПКО.Ссылка,
	|	1
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|ГДЕ
	|	ПКО.ИспользоватьДляОтправки = ЛОЖЬ
	|	И ПКО.ИспользоватьДляПолучения = ИСТИНА
	|	И НЕ ПКО.Отключить
	|	И ПКО.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПКО.Ссылка,
	|	2
	|ИЗ
	|	Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|ГДЕ
	|	ПКО.ИспользоватьДляОтправки = ИСТИНА
	|	И ПКО.ИспользоватьДляПолучения = ИСТИНА
	|	И НЕ ПКО.Отключить
	|	И ПКО.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Владелец.Наименование КАК НаименованиеОбъекта,
	|	Наименование КАК НаименованиеСвойства,
	|	ЕстьNULL(Родитель.Наименование, """") КАК НаименованиеРодителя,
	|	Родитель.ТипОбщегоСвойства КАК ТипОбщегоСвойства,
	|	ЕстьNULL(Владелец.Владелец.ПространствоИмен, """") КАК ПространствоИмен
	|ПОМЕСТИТЬ СвойстваФорматаИзРасширения
	|ИЗ Справочник.СвойстваФормата 
	|ГДЕ 
	|	Владелец.Владелец В (&ВерсииФормата)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ссылка.Код КАК Код,
	|	Направление КАК Направление,
	|	Ссылка КАК Правило
	|	ИЗ
	|		ТабПравил КАК ТабПравил
	|УПОРЯДОЧИТЬ ПО
	|	Направление,
	|	Код
	|ИТОГИ ПО
	|	Направление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ссылка,
	|	Код КАК Код,
	|	ВариантИдентификации КАК ВариантИдентификации,
	|	ОбъектКонфигурации КАК ОбъектКонфигурации,
	|	ОбъектФормата КАК ОбъектФормата,
	|	ПравилоДляГруппыСправочника КАК ПравилоДляГруппыСправочника,
	|	АлгоритмПриОтправкеДанных КАК ПриОтправкеДанных,
	|	АлгоритмПередПолучениемДанных КАК ПриКонвертацииДанныхXDTO,
	|	АлгоритмПриПолученииДанных КАК ПередЗаписьюПолученныхДанных,
	|	АлгоритмПослеЗагрузкиВсехДанных КАК ПослеЗагрузкиВсехДанных_Код,
	|	ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
	|	ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
	|	Тип КАК ТипДанных,
	|	Свод.ГруппаПравил КАК ГруппаПравил,
	|	Направление КАК Направление
	|ИЗ (
	|	ВЫБРАТЬ
	|		ТабПравил.Ссылка,
	|		ВЫРАЗИТЬ(ПравилоСсылка.ГруппаПравил КАК Строка(100)) КАК ГруппаПравил,
	|		ПравилоСсылка.Код КАК Код,
	|		ПравилоСсылка.ВариантИдентификации КАК ВариантИдентификации,
	|		ПравилоСсылка.ОбъектКонфигурации КАК ОбъектКонфигурации,
	|		ПравилоСсылка.ОбъектФормата КАК ОбъектФормата,
	|		ПравилоСсылка.ПравилоДляГруппыСправочника КАК ПравилоДляГруппыСправочника,
	|		ПравилоСсылка.АлгоритмПриОтправкеДанных КАК АлгоритмПриОтправкеДанных,
	|		ПравилоСсылка.АлгоритмПередПолучениемДанных КАК АлгоритмПередПолучениемДанных,
	|		ПравилоСсылка.АлгоритмПриПолученииДанных КАК АлгоритмПриПолученииДанных,
	|		ПравилоСсылка.АлгоритмПослеЗагрузкиВсехДанных КАК АлгоритмПослеЗагрузкиВсехДанных,
	|		ПравилоСсылка.ИспользоватьДляОтправки КАК ИспользоватьДляОтправки,
	|		ПравилоСсылка.ИспользоватьДляПолучения КАК ИспользоватьДляПолучения,
	|		ОК.Тип КАК Тип,
	|		ТабПравил.Направление КАК Направление
	|	ИЗ
	|		ТабПравил КАК ТабПравил
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииОбъектов КАК ПравилоСсылка
	|		ПО ПравилоСсылка.Ссылка = ТабПравил.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОК
	|			ПО ПравилоСсылка.ОбъектКонфигурации = ОК.Наименование
	|				И ОК.Владелец = &Конфигурация
	|) КАК Свод
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаПравил,
	|	Код
	|ИТОГИ ПО
	|	ГруппаПравил
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвойствоКонфигурации,
	|	СвойствоКонфигурацииСтрокой,
	|	СвойствоФормата,
	|	ИспользуетсяАлгоритмКонвертации,
	|	ПространствоИмен КАК ПространствоИмен,
	|	Сортировка,
	|	ПравилоКонвертацииСвойства,
	|	ПравилоКонвертацииОбъекта,
	|	Код,
	|	Ссылка
	|ИЗ (
	|	ВЫБРАТЬ
	|		ПравилаКонвертацииСвойств.СвойствоКонфигурации КАК СвойствоКонфигурации,
	|		ПравилаКонвертацииСвойств.СвойствоКонфигурацииСтрокой КАК СвойствоКонфигурацииСтрокой,
	|		ПравилаКонвертацииСвойств.СвойствоФормата КАК СвойствоФормата,
	|		ПравилаКонвертацииСвойств.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
	|		СвойстваФорматаИзРасширения.ПространствоИмен КАК ПространствоИмен,
	|		ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства,
	|		ПравилаКонвертацииСвойств.Владелец КАК ПравилоКонвертацииОбъекта,
	|		ПравилаКонвертацииСвойств.Код КАК Код,
	|		ВЫБОР КОГДА ЕстьNULL(СвойствоКонфигурации.Наименование, """") = """" 
	|			И СвойствоКонфигурацииСтрокой = """" ТОГДА
	|			СвойствоФормата
	|		КОГДА СвойствоКонфигурацииСтрокой <> """" ТОГДА СвойствоКонфигурацииСтрокой
	|		ИНАЧЕ СвойствоКонфигурации.Наименование КОНЕЦ КАК Сортировка,
	|		ТабПравил.Ссылка КАК Ссылка
	|	ИЗ
	|		ТабПравил КАК ТабПравил
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|			ПО ТабПравил.Ссылка = ПравилаКонвертацииСвойств.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвойстваФорматаИзРасширения КАК СвойстваФорматаИзРасширения
	|		ПО ПравилаКонвертацииСвойств.СвойствоФормата = СвойстваФорматаИзРасширения.НаименованиеСвойства
	|			И (СвойстваФорматаИзРасширения.НаименованиеРодителя = """"  
	|				ИЛИ СвойстваФорматаИзРасширения.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ГруппаОбщихСвойств)
	|				ИЛИ СвойстваФорматаИзРасширения.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.КлючевыеСвойства))
	|			И ПравилаКонвертацииСвойств.Владелец.ОбъектФормата = СвойстваФорматаИзРасширения.НаименованиеОбъекта
	|	ГДЕ
	|		ПравилаКонвертацииСвойств.Отключить = ЛОЖЬ И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ
	|		И ПравилаКонвертацииСвойств.Родитель = ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
	|		И НЕ ПравилаКонвертацииСвойств.ПометкаУдаления
	|) КАК Свод
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка,
	|	ИспользуетсяАлгоритмКонвертации,
	|	Код
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ГруппаСвойствФормата,
	|	ГруппаСвойствКонфигурации,
	|	ГруппаСвойствКонфигурацииСтрокой,
	|	СвойствоКонфигурации,
	|	СвойствоКонфигурацииСтрокой,
	|	СвойствоФормата,
	|	ИспользуетсяАлгоритмКонвертации,
	|	ПространствоИмен КАК ПространствоИмен,  
	|	ПравилоКонвертацииСвойства,
	|	ПравилоКонвертацииОбъекта,
	|	Код,
	|	Ссылка
	|ПОМЕСТИТЬ ТабПКС_ТЧ
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		ПравилаКонвертацииСвойств.Родитель.СвойствоФормата КАК ГруппаСвойствФормата,
	|		ПравилаКонвертацииСвойств.Родитель.СвойствоКонфигурации КАК ГруппаСвойствКонфигурации,
	|		ПравилаКонвертацииСвойств.Родитель.СвойствоКонфигурацииСтрокой КАК ГруппаСвойствКонфигурацииСтрокой,
	|		ПравилаКонвертацииСвойств.СвойствоКонфигурации КАК СвойствоКонфигурации,
	|		ПравилаКонвертацииСвойств.СвойствоКонфигурацииСтрокой КАК СвойствоКонфигурацииСтрокой,
	|		ПравилаКонвертацииСвойств.СвойствоФормата КАК СвойствоФормата,
	|		ПравилаКонвертацииСвойств.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
	|		СвойстваФорматаИзРасширения.ПространствоИмен КАК ПространствоИмен,
	|		ПравилаКонвертацииСвойств.ПравилоКонвертацииСвойства,
	|		ПравилаКонвертацииСвойств.Владелец КАК ПравилоКонвертацииОбъекта,
	|		ПравилаКонвертацииСвойств.Код КАК Код,
	|		ТабПравил.Ссылка КАК Ссылка
	|	ИЗ
	|		ТабПравил КАК ТабПравил
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|			ПО ТабПравил.Ссылка = ПравилаКонвертацииСвойств.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвойстваФорматаИзРасширения КАК СвойстваФорматаИзРасширения
	|		ПО ПравилаКонвертацииСвойств.СвойствоФормата = СвойстваФорматаИзРасширения.НаименованиеСвойства
	|			И СвойстваФорматаИзРасширения.НаименованиеРодителя = ПравилаКонвертацииСвойств.Родитель.СвойствоФормата
	|			И ПравилаКонвертацииСвойств.Владелец.ОбъектФормата = СвойстваФорматаИзРасширения.НаименованиеОбъекта
	|			
	|	ГДЕ 
	|		ПравилаКонвертацииСвойств.Отключить = ЛОЖЬ И ПравилаКонвертацииСвойств.Родитель.Отключить = ЛОЖЬ
	|		И ПравилаКонвертацииСвойств.ЭтоГруппа = ЛОЖЬ
	|		И ПравилаКонвертацииСвойств.Родитель <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииСвойств.ПустаяСсылка)
	|) КАК Свод
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабПКС_ТЧ.ГруппаСвойствФормата КАК ГруппаСвойствФормата,
	|	ТабПКС_ТЧ.ГруппаСвойствКонфигурации КАК ГруппаСвойствКонфигурации,
	|	ТабПКС_ТЧ.ГруппаСвойствКонфигурацииСтрокой КАК ГруппаСвойствКонфигурацииСтрокой,
	|	ТабПКС_ТЧ.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
	|	ВЫБОР КОГДА ТабПКС_ТЧ.ГруппаСвойствФормата <> """"
	|		И ТабПКС_ТЧ.ГруппаСвойствКонфигурации <> """" ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПрямаяКонвертация
	|ИЗ ТабПКС_ТЧ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабПКС_ТЧ.ГруппаСвойствФормата КАК ГруппаСвойствФормата,
	|	ТабПКС_ТЧ.ГруппаСвойствКонфигурации КАК ГруппаСвойствКонфигурации,
	|	ТабПКС_ТЧ.ГруппаСвойствКонфигурацииСтрокой КАК ГруппаСвойствКонфигурацииСтрокой,
	|	ТабПКС_ТЧ.ПравилоКонвертацииОбъекта КАК ПравилоКонвертацииОбъекта,
	|	ТабПКС_ТЧ.СвойствоКонфигурации КАК СвойствоКонфигурации,
	|	ТабПКС_ТЧ.СвойствоКонфигурацииСтрокой КАК СвойствоКонфигурацииСтрокой,
	|	ТабПКС_ТЧ.СвойствоФормата КАК СвойствоФормата,
	|	ТабПКС_ТЧ.ИспользуетсяАлгоритмКонвертации КАК ИспользуетсяАлгоритмКонвертации,
	|	ТабПКС_ТЧ.ПространствоИмен КАК ПространствоИмен,
	|	ТабПКС_ТЧ.ПравилоКонвертацииСвойства КАК ПравилоКонвертацииСвойства,
	|	ТабПКС_ТЧ.Код КАК Код
	|ИЗ ТабПКС_ТЧ
	|УПОРЯДОЧИТЬ ПО
	|	ТабПКС_ТЧ.СвойствоКонфигурации.Наименование,
	|	ТабПКС_ТЧ.СвойствоФормата,
	|	ТабПКС_ТЧ.Код
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыПоиска,
	|	ПравилоКонвертацииОбъекта
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		ПоляПоиска.РеквизитыПоиска КАК РеквизитыПоиска,
	|		ПоляПоиска.НомерСтроки КАК НомерСтроки,
	|		ПоляПоиска.Ссылка КАК ПравилоКонвертацииОбъекта
	|	ИЗ
	|		ТабПравил КАК ТабПравил
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииОбъектов.ИдентификацияПоПолямПоиска КАК ПоляПоиска
	|			ПО ТабПравил.Ссылка = ПоляПоиска.Ссылка
	|) КАК Свод
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабПравил
	|;
	|УНИЧТОЖИТЬ СвойстваФорматаИзРасширения
	|;
	|УНИЧТОЖИТЬ ТабПКС_ТЧ";
	
	ЗапросПКО.УстановитьПараметр("Конвертация", Конвертация);
	ЗапросПКО.УстановитьПараметр("Конфигурация", ПараметрыМодуля.Релиз);

	РезультатЗапроса = ЗапросПКО.ВыполнитьПакет();
	ТабСвойстваИзРасширений = РезультатЗапроса[1].Выгрузить();
	ВыборкаПоНаправлению = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеТеги = Новый Соответствие;
	
	Пока ВыборкаПоНаправлению.Следующий() Цикл 
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			ТелоПроцедуры = ПараметрыМодуля.ПКО_Отправка;
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			ТелоПроцедуры = ПараметрыМодуля.ПКО_Получение;
		Иначе
			ТелоПроцедуры = ПараметрыМодуля.ПКО_ОтправкаИПолучение;
		КонецЕсли;
	
		ВыборкаДетальная = ВыборкаПоНаправлению.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ТегиДляПравила = ПолучитьТегиДляПравила(ВыборкаДетальная.Правило, ПараметрыМодуля);
			СоответствиеТеги.Вставить(ВыборкаДетальная.Правило, ТегиДляПравила);
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегОткрытие) Тогда
				ТелоПроцедуры.ДобавитьСтроку(ТегиДляПравила.ТегОткрытие);
			КонецЕсли;

			Строка = ПараметрыМодуля.ПрефиксВызоваОбработчика + "ДобавитьПКО_" + ВыборкаДетальная.Код + "(ПравилаКонвертации);";
			ТелоПроцедуры.ДобавитьСтроку(Строка);
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегЗакрытие) Тогда
				ТелоПроцедуры.ДобавитьСтроку(ТегиДляПравила.ТегЗакрытие);
			КонецЕсли;
		КонецЦикла;
		Если ВыборкаПоНаправлению.Направление = 0 Тогда
			ПараметрыМодуля.ПКО_Отправка = ТелоПроцедуры;
		ИначеЕсли ВыборкаПоНаправлению.Направление = 1 Тогда
			ПараметрыМодуля.ПКО_Получение = ТелоПроцедуры;
		Иначе
			ПараметрыМодуля.ПКО_ОтправкаИПолучение = ТелоПроцедуры;
		КонецЕсли;
	КонецЦикла;
	
	ТабПКС = РезультатЗапроса[4].Выгрузить();
	ТабПКС.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	
	ТабПКС_ТЧСвод = РезультатЗапроса[6].Выгрузить();
	ТабПКС_ТЧСвод.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	
	ТабПКС_ТЧ = РезультатЗапроса[7].Выгрузить();
	ТабПКС_ТЧ.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	ТабПКС_ТЧ.Индексы.Добавить("ГруппаСвойствФормата");
	ТабПКС_ТЧ.Индексы.Добавить("ГруппаСвойствКонфигурации");
	ТабПКС_ТЧ.Индексы.Добавить("ГруппаСвойствКонфигурацииСтрокой");

	
	ТабПолейПоиска = РезультатЗапроса[8].Выгрузить();
	ТабПолейПоиска.Индексы.Добавить("ПравилоКонвертацииОбъекта");
	
	ВыборкаПоГруппе = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоГруппе.Следующий() Цикл
		ОбластьГруппаТекст = "";
		ТекГруппаПравил = ВыборкаПоГруппе.ГруппаПравил;
		ПривестиИмяГруппыПравил(ТекГруппаПравил);

		ВыборкаДетальная = ВыборкаПоГруппе.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			ТегиДляПравила = СоответствиеТеги.Получить(ВыборкаДетальная.Ссылка);
			КоллекцияПКС = ТабПКС.НайтиСтроки(Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка));
			КоллекцияПКС_ТЧ = ТабПКС_ТЧСвод.НайтиСтроки(Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка));
			КоллекцияПолейПоиска = ТабПолейПоиска.НайтиСтроки(Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка));

			ОбластьПКОТекст = ПолучитьОбластьСТекстомПКО(ПараметрыМодуля, ВыборкаДетальная, ВыборкаПоГруппе.Направление, КоллекцияПКС, КоллекцияПКС_ТЧ, ТабПКС_ТЧ, КоллекцияПолейПоиска, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила);
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегОткрытие) Тогда
				ОбластьПКОТекст = ТегиДляПравила.ТегОткрытие + Символы.ПС + ОбластьПКОТекст;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегЗакрытие) Тогда
				ОбластьПКОТекст = ОбластьПКОТекст + Символы.ПС + ТегиДляПравила.ТегЗакрытие;
			КонецЕсли;
			Если ОбластьГруппаТекст = "" Тогда
				ОбластьГруппаТекст = ОбластьПКОТекст;
			Иначе
				ОбластьГруппаТекст = ОбластьГруппаТекст + Символы.ПС + ОбластьПКОТекст;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ПустаяСтрока(ТекГруппаПравил)
			И НЕ ПредопределеннаяГруппаПравил(ТекГруппаПравил) Тогда
			Если ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПКО.Свойство(ТекГруппаПравил) Тогда
				ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПКО[ТекГруппаПравил].ДобавитьСтроку(ОбластьГруппаТекст);
			Иначе
				РазделПравил = Новый ТекстовыйДокумент;
				РазделПравил.ДобавитьСтроку(ОбластьГруппаТекст);
				ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПКО.Вставить(ТекГруппаПравил, РазделПравил);
			КонецЕсли;
		Иначе
			ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПКО.ДобавитьСтроку(ОбластьГруппаТекст);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьОбластьСТекстомПКО(ПараметрыМодуля, ВыборкаДетальная, Направление, КоллекцияПКС_Шапка, КоллекцияПКС_ТЧ, ТабПКС_ТЧ, КоллекцияПолейПоиска, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила)
	ИспользоватьТэг = Ложь; 
	ТекущийТэг = "";
	ПостфиксЗаголовкаОбработчика = "";
	Если ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		ПостфиксЗаголовкаОбработчика = " Экспорт"; 
	КонецЕсли;
	ИмяОбластиПКО = "";
	// Для корректного выравнивания в процедурах заполнения ПКО используются разные области.
	Если ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		ИмяОбластиПКО = "ПКО_ЕстьПолучение";
	Иначе
		ИмяОбластиПКО = "ПКО_ТолькоОтправка";
	КонецЕсли;
	ОбластьПКОТекст = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть(ИмяОбластиПКО).ПолучитьТекст();
	ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "#Область " + ИмяОбластиПКО + Символы.ПС, "");
	ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&КонецОбласти" + Символы.ПС, "#КонецОбласти");
	
	ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбъявлениеОбласти", "#Область " + СокрЛП(ВыборкаДетальная.Код));
	ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ИмяПКО", СокрЛП(ВыборкаДетальная.Код));
	ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&Постфикс", ПостфиксЗаголовкаОбработчика);
	
	ОбъектДанных = ПолучитьТипМетаданные(ВыборкаДетальная.ТипДанных, ВыборкаДетальная.ОбъектКонфигурации);
	ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбъектДанных", ОбъектДанных);
	
	ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ОбъектФормата", СокрЛП(ВыборкаДетальная.ОбъектФормата));
	Если ПараметрыМодуля.ЗапретитьПереводИменОбъектовФормата Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ТегЗапретПеревода", " //@NON-NLS-1");
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ТегЗапретПеревода", "");
	КонецЕсли;
	Если ВыборкаДетальная.ПравилоДляГруппыСправочника Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПравилоДляГруппыСправочника","Истина");
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПравилоДляГруппыСправочника", "---");
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаДетальная.ПриОтправкеДанных)
		И ВыборкаДетальная.ИспользоватьДляОтправки	Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриОтправкеДанных",
			"ПКО_" + СокрЛП(ВыборкаДетальная.Код) + "_ПриОтправкеДанных");
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриОтправкеДанных", "---");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаДетальная.ПриКонвертацииДанныхXDTO)
		И ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриКонвертацииДанныхXDTO",
			"ПКО_" + СокрЛП(ВыборкаДетальная.Код) + "_ПриКонвертацииДанныхXDTO");
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПриКонвертацииДанныхXDTO", "---");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаДетальная.ПередЗаписьюПолученныхДанных)
		И ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПередЗаписьюПолученныхДанных",
			"ПКО_" + СокрЛП(ВыборкаДетальная.Код) + "_ПередЗаписьюПолученныхДанных");
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПередЗаписьюПолученныхДанных", "---");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаДетальная.ПослеЗагрузкиВсехДанных_Код)
		И ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПослеЗагрузкиВсехДанных", СокрЛП(ВыборкаДетальная.ПослеЗагрузкиВсехДанных_Код));
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ПослеЗагрузкиВсехДанных", "---");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаДетальная.ВариантИдентификации)
		И ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		ВариантИдентификацииСтрокой = Метаданные.Перечисления.ВариантыИдентификацииОбъектов.ЗначенияПеречисления.Получить(
			Перечисления.ВариантыИдентификацииОбъектов.Индекс(ВыборкаДетальная.ВариантИдентификации)).Имя;
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ВариантИдентификации", ВариантИдентификацииСтрокой);
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ВариантИдентификации", "---");
	КонецЕсли;
	
	МассивПространстваИмен = Новый Массив;
	
	ЗаполнениеПКС = Новый ТекстовыйДокумент;
	Если КоллекцияПКС_Шапка.Количество() > 0 Тогда
		ЗаполнениеПКС.ДобавитьСтроку("СвойстваШапки = ПравилоКонвертации.Свойства;");
		МаксДлинаСвойствоКонфигурации = 0;
		// Вычисление максимальной длины свойств для выравнивания.
		Для Каждого Строка Из КоллекцияПКС_Шапка Цикл
			ИмяСвойстваКонфигурации = СокрЛП(Строка.СвойствоКонфигурации);
			Если СтрДлина(ИмяСвойстваКонфигурации) > МаксДлинаСвойствоКонфигурации Тогда
				МаксДлинаСвойствоКонфигурации = СтрДлина(ИмяСвойстваКонфигурации);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка Из КоллекцияПКС_Шапка Цикл
			ИмяСвойстваКонфигурации = СокрЛП(Строка.СвойствоКонфигурации);
			Если ПустаяСтрока(ИмяСвойстваКонфигурации) И ПустаяСтрока(СокрЛП(Строка.СвойствоФормата)) Тогда
				Продолжить;
			КонецЕсли;
			ОтступСвойствоФормата = "";
			Для СчетчикПробелов = 1 По МаксДлинаСвойствоКонфигурации - СтрДлина(СокрЛП(Строка.СвойствоКонфигурации)) Цикл
				ОтступСвойствоФормата = ОтступСвойствоФормата + " ";
			КонецЦикла;
			ПараметрИспользуетсяАлгоритм = ?(Строка.ИспользуетсяАлгоритмКонвертации,"1","");
			СтрокаДобавлениеПКС = "ДобавитьПКС(СвойстваШапки, "  
							+ """" + ИмяСвойстваКонфигурации + """, " + ОтступСвойствоФормата
							+ """" + СокрЛП(Строка.СвойствоФормата) + """";
			Если НЕ ПустаяСтрока(ПараметрИспользуетсяАлгоритм) Или НЕ ПустаяСтрока(Строка.ПравилоКонвертацииСвойства)
					Или НЕ ПустаяСтрока(Строка.ПространствоИмен) Тогда
				СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ", " + ?(ПустаяСтрока(ПараметрИспользуетсяАлгоритм),"",ПараметрИспользуетсяАлгоритм);
				СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ", " + ?(ПустаяСтрока(Строка.ПравилоКонвертацииСвойства),"",
								"""" + СокрЛП(Строка.ПравилоКонвертацииСвойства) + """");
				СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ?(ПустаяСтрока(Строка.ПространствоИмен),"",
								", """ + СокрЛП(Строка.ПространствоИмен) + """");
				Если НЕ ПустаяСтрока(Строка.ПространствоИмен) И МассивПространстваИмен.Найти(СокрЛП(Строка.ПространствоИмен)) = Неопределено Тогда
					МассивПространстваИмен.Добавить(СокрЛП(Строка.ПространствоИмен));
				КонецЕсли;
				// Убрать возможные лишние запятые
				ЛишнихЗнаков = 0;
				Если Прав(СтрокаДобавлениеПКС, 6) = ", , , " Тогда
					ЛишнихЗнаков = 6;
				ИначеЕсли Прав(СтрокаДобавлениеПКС, 4) = ", , " Тогда
					ЛишнихЗнаков = 4;
				ИначеЕсли Прав(СтрокаДобавлениеПКС, 2) = ", " Тогда
					ЛишнихЗнаков = 2;
				КонецЕсли;
				Если ЛишнихЗнаков > 0 Тогда
					СтрокаДобавлениеПКС = Лев(СтрокаДобавлениеПКС, СтрДлина(СтрокаДобавлениеПКС) - ЛишнихЗнаков);
				КонецЕсли;
			КонецЕсли;
			СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ");";
			ЗаполнениеПКС.ДобавитьСтроку(СтрокаДобавлениеПКС);
		КонецЦикла;
		ЗаполнениеПКСТекст = ДобавитьОтступыВСтроку(ЗаполнениеПКС.ПолучитьТекст());
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПКС", ЗаполнениеПКСТекст);
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПКС", "---");
	КонецЕсли;
	
	ЗаполнениеПКС = Новый ТекстовыйДокумент;
	Если КоллекцияПКС_ТЧ.Количество() > 0 Тогда

		ТаблицаГруппировок = Новый ТаблицаЗначений;
		ТаблицаГруппировок.Колонки.Добавить("ГруппаСвойствФормата");
		ТаблицаГруппировок.Колонки.Добавить("ГруппаСвойствКонфигурации");
		ТаблицаГруппировок.Колонки.Добавить("ГруппаСвойствКонфигурацииСтрокой");
		ТаблицаГруппировок.Колонки.Добавить("ПрямаяКонвертация");
		ТаблицаГруппировок.Колонки.Добавить("ПространствоИмен");
		МаксДлинаИмяТЧКонфигурации = 0;
		Для Каждого Строка_ТЧ Из КоллекцияПКС_ТЧ Цикл
			СтрокаГруппировки = ТаблицаГруппировок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаГруппировки, Строка_ТЧ);
			ИмяГруппы = ?(ЗначениеЗаполнено(СтрокаГруппировки.ГруппаСвойствКонфигурации), СокрЛП(СтрокаГруппировки.ГруппаСвойствКонфигурации), СокрЛП(СтрокаГруппировки.ГруппаСвойствКонфигурацииСтрокой));
			Если СтрДлина(ИмяГруппы) > МаксДлинаИмяТЧКонфигурации Тогда
				МаксДлинаИмяТЧКонфигурации = СтрДлина(ИмяГруппы);
			КонецЕсли;
		КонецЦикла;
		ИмяКлючевойГруппы = "";
		ИмяКлючевогоСвойства = "";
		Если Направление = 0 Тогда
			ИмяКлючевойГруппы = "ГруппаСвойствФормата";
			ИмяКлючевогоСвойства = "СвойствоФормата";
			ТаблицаГруппировок.Сортировать("ГруппаСвойствФормата, ПрямаяКонвертация убыв");
		ИначеЕсли Направление = 1 Тогда
			ИмяКлючевойГруппы = "ГруппаСвойствКонфигурации";
			ИмяКлючевогоСвойства = "СвойствоКонфигурации";
			ТаблицаГруппировок.Сортировать("ГруппаСвойствКонфигурации, ГруппаСвойствКонфигурацииСтрокой, ПрямаяКонвертация убыв");
		Иначе
			ТаблицаГруппировок.Сортировать("ПрямаяКонвертация убыв, ГруппаСвойствКонфигурации, ГруппаСвойствКонфигурацииСтрокой, ГруппаСвойствФормата");
		КонецЕсли;
		ТекКлючеваяГруппа = "";
		ПерваяТЧ = Истина;
		Для Каждого Строка_ТЧ Из ТаблицаГруппировок Цикл
			Если ИмяКлючевойГруппы <> "" Тогда
				КлючеваяГруппа = Строка_ТЧ[ИмяКлючевойГруппы];
				// При необходимости переопределим имя ключевой группы в зависимости от данных строки
				Если ИмяКлючевойГруппы = "ГруппаСвойствКонфигурации" И НЕ ЗначениеЗаполнено(КлючеваяГруппа) Тогда
					КлючеваяГруппа = Строка_ТЧ.ГруппаСвойствКонфигурацииСтрокой;
					ИмяКлючевойГруппы = "ГруппаСвойствКонфигурацииСтрокой";
				ИначеЕсли ИмяКлючевойГруппы = "ГруппаСвойствКонфигурацииСтрокой" И НЕ ЗначениеЗаполнено(КлючеваяГруппа) Тогда
					КлючеваяГруппа = Строка_ТЧ.ГруппаСвойствКонфигурации;
					ИмяКлючевойГруппы = "ГруппаСвойствКонфигурации";
				КонецЕсли;
			Иначе
				КлючеваяГруппа = "" + Строка_ТЧ.ГруппаСвойствФормата  + "_" + Строка_ТЧ.ГруппаСвойствКонфигурации;
			КонецЕсли;
			Если ТекКлючеваяГруппа <> КлючеваяГруппа Тогда
				ТекКлючеваяГруппа = КлючеваяГруппа;
				ОтступТЧФормата = "";
				ИмяГруппы = ?(ЗначениеЗаполнено(Строка_ТЧ.ГруппаСвойствКонфигурацииСтрокой),Строка_ТЧ.ГруппаСвойствКонфигурацииСтрокой,Строка_ТЧ.ГруппаСвойствКонфигурации);
				Для СчетчикПробелов = 1 По МаксДлинаИмяТЧКонфигурации - СтрДлина(ИмяГруппы) Цикл
					ОтступТЧФормата = ОтступТЧФормата + " ";
				КонецЦикла;
				Если ПерваяТЧ Тогда
					ПерваяТЧ = Ложь;
				Иначе
					ЗаполнениеПКС.ДобавитьСтроку("");
				КонецЕсли;
				СтрокаЗаполнениеПКС = "СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "
							+ """" + ИмяГруппы + """, " + ОтступТЧФормата
							+ """" + СокрЛП(Строка_ТЧ.ГруппаСвойствФормата) + """);";
				Если ЗначениеЗаполнено(Строка_ТЧ.ПространствоИмен) Тогда
					СтрокаЗаполнениеПКС = СтрЗаменить(СтрокаЗаполнениеПКС, ");", ", """ + Строка_ТЧ.ПространствоИмен + """);");			
					Если МассивПространстваИмен.Найти(СокрЛП(Строка_ТЧ.ПространствоИмен)) = Неопределено Тогда
						МассивПространстваИмен.Добавить(СокрЛП(Строка_ТЧ.ПространствоИмен));
					КонецЕсли;
				КонецЕсли;
				
				ЗаполнениеПКС.ДобавитьСтроку(СтрокаЗаполнениеПКС);
				
				СтруктураПоискаПКС = Новый Структура("ПравилоКонвертацииОбъекта", ВыборкаДетальная.Ссылка);
				Если ИмяКлючевойГруппы = "" Тогда
					СтруктураПоискаПКС.Вставить("ГруппаСвойствФормата", Строка_ТЧ.ГруппаСвойствФормата);
					СтруктураПоискаПКС.Вставить("ГруппаСвойствКонфигурации", Строка_ТЧ.ГруппаСвойствКонфигурации);
				Иначе
					СтруктураПоискаПКС.Вставить(ИмяКлючевойГруппы, КлючеваяГруппа);
				КонецЕсли;
				КоллекцияПКС = ТабПКС_ТЧ.НайтиСтроки(СтруктураПоискаПКС);
				ТаблицаПКС = Новый ТаблицаЗначений;
				ТаблицаПКС.Колонки.Добавить("СвойствоКонфигурации");
				ТаблицаПКС.Колонки.Добавить("СвойствоФормата");
				ТаблицаПКС.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации");
				ТаблицаПКС.Колонки.Добавить("ПравилоКонвертацииСвойства");
				ТаблицаПКС.Колонки.Добавить("ПространствоИмен");
				ТаблицаПКС.Колонки.Добавить("НомерСтроки");
				МаксДлинаСвойствоКонфигурации = 0;
				Для Каждого Строка Из КоллекцияПКС Цикл
					СтрокаПКС = ТаблицаПКС.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПКС, Строка);
					ИмяСвойствоКонфигурации = СокрЛП(Строка.СвойствоКонфигурации);
					Если СтрДлина(ИмяСвойствоКонфигурации) > МаксДлинаСвойствоКонфигурации Тогда
						МаксДлинаСвойствоКонфигурации = СтрДлина(ИмяСвойствоКонфигурации);
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеЗаполнено(ИмяКлючевогоСвойства) Тогда
					ТаблицаПКС.Сортировать(ИмяКлючевогоСвойства + ",НомерСтроки");
				Иначе
					ТаблицаПКС.Сортировать("НомерСтроки");
				КонецЕсли;
				Для Каждого Строка Из ТаблицаПКС Цикл
					ОтступСвойствоФормата = "";
					ИмяСвойствоКонфигурации = СокрЛП(Строка.СвойствоКонфигурации);
					Для СчетчикПробелов = 1 По МаксДлинаСвойствоКонфигурации - СтрДлина(ИмяСвойствоКонфигурации) Цикл
						ОтступСвойствоФормата = ОтступСвойствоФормата + " ";
					КонецЦикла;
					ПараметрИспользуетсяАлгоритм = ?(Строка.ИспользуетсяАлгоритмКонвертации,"1","");
					СтрокаДобавлениеПКС = "ДобавитьПКС(СвойстваТЧ, "  
					+ """" + ИмяСвойствоКонфигурации + """, " + ОтступСвойствоФормата
					+ """" + СокрЛП(Строка.СвойствоФормата) + """";
					Если НЕ ПустаяСтрока(ПараметрИспользуетсяАлгоритм) Или НЕ ПустаяСтрока(Строка.ПравилоКонвертацииСвойства)
						Или ПустаяСтрока(Строка.ПространствоИмен) Тогда
						СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ", " + ?(ПустаяСтрока(ПараметрИспользуетсяАлгоритм),"",ПараметрИспользуетсяАлгоритм);
						СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ", " + ?(ПустаяСтрока(Строка.ПравилоКонвертацииСвойства),"",
						"""" + СокрЛП(Строка.ПравилоКонвертацииСвойства) + """");
						СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ?(ПустаяСтрока(Строка.ПространствоИмен),"",
						",""" + СокрЛП(Строка.ПространствоИмен) + """");
						// Убрать возможные лишние запятые
						ЛишнихЗнаков = 0;
						Если Прав(СтрокаДобавлениеПКС, 6) = ", , , " Тогда
							ЛишнихЗнаков = 6;
						ИначеЕсли Прав(СтрокаДобавлениеПКС, 4) = ", , " Тогда
							ЛишнихЗнаков = 4;
						ИначеЕсли Прав(СтрокаДобавлениеПКС, 2) = ", " Тогда
							ЛишнихЗнаков = 2;
						КонецЕсли;
						Если ЛишнихЗнаков > 0 Тогда
							СтрокаДобавлениеПКС = Лев(СтрокаДобавлениеПКС, СтрДлина(СтрокаДобавлениеПКС) - ЛишнихЗнаков);
						КонецЕсли;
						Если НЕ ПустаяСтрока(Строка.ПространствоИмен) И МассивПространстваИмен.Найти(СокрЛП(Строка.ПространствоИмен)) = Неопределено Тогда
							МассивПространстваИмен.Добавить(СокрЛП(Строка.ПространствоИмен));
						КонецЕсли;
					КонецЕсли;
					СтрокаДобавлениеПКС = СтрокаДобавлениеПКС + ");";
					ЗаполнениеПКС.ДобавитьСтроку(СтрокаДобавлениеПКС);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ЗаполнениеПКСТекст = ДобавитьОтступыВТекстовыйДокумент(ЗаполнениеПКС);
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеТЧПКС", ЗаполнениеПКСТекст);
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеТЧПКС", "---");
	КонецЕсли;
	ИнициализироватьРасширение = "";
	Для Каждого ИмяРасш Из МассивПространстваИмен Цикл
		ИнициализироватьРасширение = ИнициализироватьРасширение + ?(ИнициализироватьРасширение = "", "", Символы.ПС) + Символы.Таб +
			"ОбменДаннымиXDTOСервер.ИнициализироватьРасширениеПравилаКонвертацииОбъекта(ПравилоКонвертации, " + """" + ИмяРасш + """);";
	КонецЦикла; 
	Если ИнициализироватьРасширение = "" Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ИнициализироватьРасширение", "---");
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ИнициализироватьРасширение", ИнициализироватьРасширение);
	КонецЕсли;
	ЗаполнениеПолейПоиска = Новый ТекстовыйДокумент;
	Если ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		Для Каждого Строка Из КоллекцияПолейПоиска Цикл
			СтрокаПолейПоиска = """" + СокрЛП(Строка.РеквизитыПоиска) + """";
			ЗаполнениеПолейПоиска.ДобавитьСтроку("ПравилоКонвертации.ПоляПоиска.Добавить(""" + Строка.РеквизитыПоиска+""");");
		КонецЦикла;
	КонецЕсли;
	Если ЗаполнениеПолейПоиска.КоличествоСтрок() > 0 Тогда
		ЗаполнениеПолейПоискаТекст = ДобавитьОтступыВСтроку(ЗаполнениеПолейПоиска.ПолучитьТекст());
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПолейПоиска", ЗаполнениеПолейПоискаТекст);
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&ЗаполнениеПолейПоиска", "---");
	КонецЕсли;
	Если ПараметрыМодуля.ИспользоватьТипизациюПеременных Тогда
		ОбластьПКОКомментарий = ПараметрыМодуля.МакетТекстовМодулейДетализацияКомментариев.ПолучитьОбласть("Комментарий_ДобавитьПКО").ПолучитьТекст();
		ОбластьПКОКомментарий = СтрЗаменить(ОбластьПКОКомментарий, "#Область Комментарий_ДобавитьПКО", "---");
		ОбластьПКОТекст = ОбластьПКОКомментарий + ОбластьПКОТекст;
	КонецЕсли;
	ТекстОбработчики = "";
	Если ВыборкаДетальная.ИспользоватьДляОтправки Тогда
		ДобавитьОбработчикиВТекстМодуля("ПКО", "ПриОтправкеДанных", 
			ВыборкаДетальная,ПараметрыМодуля, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила, ТекстОбработчики);
	КонецЕсли;
	Если ВыборкаДетальная.ИспользоватьДляПолучения Тогда
		ДобавитьОбработчикиВТекстМодуля("ПКО", "ПриКонвертацииДанныхXDTO", 
			ВыборкаДетальная, ПараметрыМодуля, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила, ТекстОбработчики);
		ДобавитьОбработчикиВТекстМодуля("ПКО", "ПередЗаписьюПолученныхДанных", 
			ВыборкаДетальная, ПараметрыМодуля, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила, ТекстОбработчики);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстОбработчики) Тогда
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&Обработчики", ТекстОбработчики);
	Иначе
		ОбластьПКОТекст = СтрЗаменить(ОбластьПКОТекст, "&Обработчики", "---");
	КонецЕсли;
	
	Возврат ОбластьПКОТекст;
КонецФункции

Процедура ДобавитьПроцедурыПОДиПКОВМодуль(ПараметрыМодуля)
	Если ПараметрыМодуля.ИспользоватьТипизациюПеременных Тогда
		ИспользуемыйМакет = ПараметрыМодуля.МакетТекстовМодулейДетализацияКомментариев;
	Иначе
		ИспользуемыйМакет = ПараметрыМодуля.МакетТекстовМодулей;
	КонецЕсли;
	ЗаполнитьПравилаОбработкиДанныхТекст = ИспользуемыйМакет.ПолучитьОбласть("ЗаполнитьПравилаОбработкиДанных").ПолучитьТекст();
	ЗаполнитьПравилаОбработкиДанныхТекст = СтрЗаменить(ЗаполнитьПравилаОбработкиДанныхТекст,
		"#Область ЗаполнитьПравилаОбработкиДанных" + Символы.ПС, "");
	УдалитьПоследнийПереводСтроки(ЗаполнитьПравилаОбработкиДанныхТекст);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ЗаполнитьПравилаОбработкиДанныхТекст); 
	ТелоПроцедуры = Новый ТекстовыйДокумент;

	ТекстМодуляПОД = ПараметрыМодуля.ПОД_Отправка;
	ЕслиОткрыто = Ложь;
	Если ТекстМодуляПОД.КоличествоСтрок() > 0 Тогда
		ЕслиОткрыто = Истина;
		ТелоПроцедуры.ДобавитьСтроку("Если НаправлениеОбмена = ""Отправка"" Тогда");
		ТелоПроцедуры.ДобавитьСтроку(Символы.Таб + "Если ПравилаОбработкиДанных.Колонки.Найти(""ОчисткаДанных"") = Неопределено Тогда");
		ТелоПроцедуры.ДобавитьСтроку(Символы.Таб + Символы.Таб + "ПравилаОбработкиДанных.Колонки.Добавить(""ОчисткаДанных"");");
		ТелоПроцедуры.ДобавитьСтроку(Символы.Таб + "КонецЕсли;");
		Для НомерСтроки = 1 По ТекстМодуляПОД.КоличествоСтрок() Цикл
			СтрокаМодуля = Символы.Таб + ТекстМодуляПОД.ПолучитьСтроку(НомерСтроки);
			ТелоПроцедуры.ДобавитьСтроку(СтрокаМодуля);
		КонецЦикла;
	КонецЕсли;
	ТекстМодуляПОД = ПараметрыМодуля.ПОД_Получение; 
	Если ТекстМодуляПОД.КоличествоСтрок() > 0 Тогда
		Если Не ЕслиОткрыто Тогда
			Строка = "Если";
		Иначе
			Строка = "ИначеЕсли";
		КонецЕсли;
		ТелоПроцедуры.ДобавитьСтроку(Строка + " НаправлениеОбмена = ""Получение"" Тогда");
		ЕслиОткрыто = Истина;
		Для НомерСтроки = 1 По ТекстМодуляПОД.КоличествоСтрок() Цикл
			СтрокаМодуля = Символы.Таб + ТекстМодуляПОД.ПолучитьСтроку(НомерСтроки);
			ТелоПроцедуры.ДобавитьСтроку(СтрокаМодуля);
		КонецЦикла;
	КонецЕсли;
	Если ЕслиОткрыто Тогда
		ТелоПроцедуры.ДобавитьСтроку("КонецЕсли;");
		ЕслиОткрыто = Ложь;
	КонецЕсли;
	ТекстТелаПроцедуры = ДобавитьОтступыВСтроку(ТелоПроцедуры.ПолучитьТекст());
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ТекстТелаПроцедуры); 
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("КонецПроцедуры"); 
	
	ЗаполнитьПравилаКонвертацииОбъектовТекст = ИспользуемыйМакет.ПолучитьОбласть("ЗаполнитьПравилаКонвертацииОбъектов").ПолучитьТекст();
	ЗаполнитьПравилаКонвертацииОбъектовТекст = СтрЗаменить(ЗаполнитьПравилаКонвертацииОбъектовТекст,
		"#Область ЗаполнитьПравилаКонвертацииОбъектов", "---");
	УдалитьПоследнийПереводСтроки(ЗаполнитьПравилаКонвертацииОбъектовТекст);
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ЗаполнитьПравилаКонвертацииОбъектовТекст);
	
	ЕслиОткрыто = Ложь;
	ТелоПроцедуры = Новый ТекстовыйДокумент;

	ТекстМодуляПКО = ПараметрыМодуля.ПКО_Отправка;
	Если ТекстМодуляПКО.КоличествоСтрок() > 0 Тогда
		ТелоПроцедуры.ДобавитьСтроку("Если НаправлениеОбмена = ""Отправка"" Тогда");
		ЕслиОткрыто = Истина;
		Для НомерСтроки = 1 По ТекстМодуляПКО.КоличествоСтрок() Цикл
			СтрокаМодуля = Символы.Таб + ТекстМодуляПКО.ПолучитьСтроку(НомерСтроки);
			ТелоПроцедуры.ДобавитьСтроку(СтрокаМодуля);
		КонецЦикла;
	КонецЕсли;
	ТекстМодуляПКО = ПараметрыМодуля.ПКО_Получение;
	Если ТекстМодуляПКО.КоличествоСтрок() > 0 Тогда
		Если Не ЕслиОткрыто Тогда
			Строка = "Если";
		Иначе
			Строка = "ИначеЕсли";
		КонецЕсли;
		ТелоПроцедуры.ДобавитьСтроку(Строка + " НаправлениеОбмена = ""Получение"" Тогда");
		ЕслиОткрыто = Истина;
		Для НомерСтроки = 1 По ТекстМодуляПКО.КоличествоСтрок() Цикл
			СтрокаМодуля = Символы.Таб + ТекстМодуляПКО.ПолучитьСтроку(НомерСтроки);
			ТелоПроцедуры.ДобавитьСтроку(СтрокаМодуля);
		КонецЦикла;
	КонецЕсли;
	Если ЕслиОткрыто Тогда
		ТелоПроцедуры.ДобавитьСтроку("КонецЕсли;");
		ЕслиОткрыто = Ложь;
	КонецЕсли; 
	ТекстМодуляПКО = ПараметрыМодуля.ПКО_ОтправкаИПолучение;
	Для НомерСтроки = 1 По ТекстМодуляПКО.КоличествоСтрок() Цикл
		СтрокаМодуля = ТекстМодуляПКО.ПолучитьСтроку(НомерСтроки);
		ТелоПроцедуры.ДобавитьСтроку(СтрокаМодуля);
	КонецЦикла;
	ТекстТелаПроцедуры = ДобавитьОтступыВСтроку(ТелоПроцедуры.ПолучитьТекст());	
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ТекстТелаПроцедуры); 

    ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку("КонецПроцедуры");
КонецПроцедуры

// Компоновка результирующего модуля: Программный интерфейс, служебные процедуры, обработчики и т.д.
Процедура ДобавитьПроцедурыВТекстМодуля(ОбщийТекстМодуля, ТекстыПоГруппам, ПараметрыМодуля, ЭтоМодульМенеджера = Ложь)
	Если НЕ ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныйПрограммныйИнтерфейс");
		ОбщийТекстМодуля.ДобавитьСтроку(ПараметрыМодуля.ПрограммныйИнтерфейс.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЕсли;
	Если НЕ ЭтоМодульМенеджера Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область СлужебныеПроцедурыИФункции"); 
	КонецЕсли;
	Если НЕ (ПараметрыМодуля.ИспользоватьРазделениеМодуля И ПараметрыМодуля.ТекущийМодуль.ЭтоМодульМенеджера) Тогда
		ДобавитьУИДМодуля(ОбщийТекстМодуля);
	КонецЕсли;
	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПОД");
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПОД Цикл
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПОД.ПолучитьТекст());
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	ОбщийТекстМодуля.ДобавитьСтроку("#Область ПКО");
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам_ПКО Цикл
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции_ПКО.ПолучитьТекст());
	ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	Для Каждого ГруппаПравил Из ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам Цикл
		// Алгоритмы принудительно добавляем в конец позднее.
		Если  ГруппаПравил.Ключ = "Алгоритмы" Тогда
			Продолжить;
		КонецЕсли;
		ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
		ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЦикла;
	ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункции.ПолучитьТекст());
	СлужебныеПроцедурыДополнение = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Служебные_ЗаполнениеПКС").ПолучитьТекст();
	СлужебныеПроцедурыДополнение = СтрЗаменить(СлужебныеПроцедурыДополнение,"#Область Служебные_ЗаполнениеПКС", "");
	ОбщийТекстМодуля.ДобавитьСтроку(СлужебныеПроцедурыДополнение);
	Если ПараметрыМодуля.ГруппироватьПоОбъектамВыгрузки = Ложь Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область ОбработчикиКонвертации");
		Для Каждого ГруппаПравил Из ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам Цикл
			ОбщийТекстМодуля.ДобавитьСтроку("#Область " + ГруппаПравил.Ключ);
			ОбщийТекстМодуля.ДобавитьСтроку(ГруппаПравил.Значение.ПолучитьТекст());
			ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
		КонецЦикла; 
		ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.ОбработчикиКонвертации.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЕсли;
	// Алгоритмы принудительно добавляем в конец.
	Если (НЕ ПараметрыМодуля.ИспользоватьРазделениеМодуля Или ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский)
		И ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Свойство("Алгоритмы") Тогда
		ОбщийТекстМодуля.ДобавитьСтроку("#Область Алгоритмы");
		ОбщийТекстМодуля.ДобавитьСтроку(ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Алгоритмы.ПолучитьТекст());
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти"); 
	КонецЕсли; 
	Если НЕ ЭтоМодульМенеджера Тогда
		// Нет области Служебные процедуры и функции.
		ОбщийТекстМодуля.ДобавитьСтроку("#КонецОбласти");
	КонецЕсли;
	УдалитьЛишниеСтрокиИзМодуля(ОбщийТекстМодуля);

КонецПроцедуры

Процедура УдалитьЛишниеСтрокиИзМодуля(ОбщийТекстМодуля)
	КоличествоСтрок = ОбщийТекстМодуля.КоличествоСтрок();
	ТекстДляПлатформы82 = Конвертация.Версия82;
	
	Для ОбратныйСчетчик = 0 По КоличествоСтрок - 1 Цикл
		
		НомерСтроки = КоличествоСтрок - ОбратныйСчетчик;
		
		Строка = ОбщийТекстМодуля.ПолучитьСтроку(НомерСтроки);
		Если Найти(Строка, "---") > 0 Тогда
			ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки);
		ИначеЕсли ТекстДляПлатформы82 Тогда
			Если Найти(Строка, "#Область") > 0 Тогда
				ОбщийТекстМодуля.ЗаменитьСтроку(НомерСтроки, СтрЗаменить(Строка, "#Область", "// "));
			ИначеЕсли Найти(Строка, "#КонецОбласти") > 0 Тогда
				ОбщийТекстМодуля.УдалитьСтроку(НомерСтроки);
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Добавление обработчиков конвертации.
Функция ЗаполнитьТекстПроцедурыКонвертации(МакетТекстовМодулей)
	
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Конвертации.АлгоритмПередКонвертацией КАК АлгоритмПередКонвертацией,
	|	Конвертации.АлгоритмПослеКонвертации КАК АлгоритмПослеКонвертации,
	|	Конвертации.АлгоритмПередОбработкойУдаления КАК АлгоритмПередОбработкойУдаления,
	|	Конвертации.АлгоритмПередОтложеннымЗаполнением КАК АлгоритмПередОтложеннымЗаполнением
	|ИЗ
	|	Справочник.Конвертации КАК Конвертации
	|ГДЕ
	|	Конвертации.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Конвертация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ПередКонвертациейЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередКонвертацией_Заголовок").ПолучитьТекст();
	ПередКонвертациейЗаголовок = СтрЗаменить(ПередКонвертациейЗаголовок,"#Область Конвертация_ПередКонвертацией_Заголовок", "---"); 
	УдалитьПоследнийПереводСтроки(ПередКонвертациейЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередКонвертациейЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередКонвертацией) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередКонвертацией));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");
	
	ПослеКонвертацииЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПослеКонвертации_Заголовок").ПолучитьТекст();
	ПослеКонвертацииЗаголовок = СтрЗаменить(ПослеКонвертацииЗаголовок,"#Область Конвертация_ПослеКонвертации_Заголовок", "---");
	УдалитьПоследнийПереводСтроки(ПослеКонвертацииЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПослеКонвертацииЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПослеКонвертации) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПослеКонвертации));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	ТекстПроцедуры.ДобавитьСтроку("");

	ПередОтложеннымЗаполнениемЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередОтложеннымЗаполнением_Заголовок").ПолучитьТекст();
	ПередОтложеннымЗаполнениемЗаголовок = СтрЗаменить(ПередОтложеннымЗаполнениемЗаголовок,"#Область Конвертация_ПередОтложеннымЗаполнением_Заголовок", "---");
	УдалитьПоследнийПереводСтроки(ПередОтложеннымЗаполнениемЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередОтложеннымЗаполнениемЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередОтложеннымЗаполнением) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередОтложеннымЗаполнением));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");

	ПередУдалениемЗаголовок = МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПередОбработкойУдаления_Заголовок").ПолучитьТекст();
	ПередУдалениемЗаголовок = СтрЗаменить(ПередУдалениемЗаголовок,"#Область Конвертация_ПередОбработкойУдаления_Заголовок", "");
	УдалитьПоследнийПереводСтроки(ПередУдалениемЗаголовок);
	ТекстПроцедуры.ДобавитьСтроку(ПередУдалениемЗаголовок);
	Если ЗначениеЗаполнено(Выборка.АлгоритмПередОбработкойУдаления) Тогда
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.АлгоритмПередОбработкойУдаления));
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");
	
	Возврат ТекстПроцедуры.ПолучитьТекст();
	
КонецФункции

// Добавление алгоритмов.
Процедура ЗаполнитьТекстПроцедурыАлгоритмы(ТекстыПоГруппам, ПараметрыМодуля)
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	ОбластьКомментарий = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Алгоритмы_Комментарий");
	ТекстКомментария = СтрЗаменить(ОбластьКомментарий.ПолучитьТекст(), "#Область Конвертация_Алгоритмы_Комментарий","---");
	ТекстПроцедуры.ДобавитьСтроку(ТекстКомментария);
	
	Если Константы.СовместнаяРабота.Получить() Тогда
		Если ПоСостояниюХранилища Тогда
			КОбработке = ТекстЗапросаВсеИзХранилища("Алгоритмы");
			КОбработкеПКО = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов");
		Иначе
			КОбработке = ТекстЗапросаСвоиДоработки("Алгоритмы");
			КОбработкеПКО = ТекстЗапросаСвоиДоработки("ПравилаКонвертацииОбъектов");
		КонецЕсли;
	Иначе
		КОбработке = ТекстЗапросаБезСовместнойРаботы("Алгоритмы");
		КОбработкеПКО = ТекстЗапросаБезСовместнойРаботы("ПравилаКонвертацииОбъектов");
	КонецЕсли;
	КОбработкеПКО = СтрЗаменить(КОбработкеПКО, "ГДЕ", "ГДЕ Правила.АлгоритмПослеЗагрузкиВсехДанных <> """" И ");
	Запрос = Новый Запрос; 
	ВсеАлгоритмыЭкспортные = Ложь;
	Если ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		// Отбор по модулю.
		ВсеАлгоритмыЭкспортные = Истина;
		Если ПараметрыМодуля.ТекущийМодуль.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод
			|ГДЕ Свод.Ссылка.ДополнительныйМодуль = &ДополнительныйМодуль
			|; ";
			Запрос.УстановитьПараметр("ДополнительныйМодуль", ПараметрыМодуля.ТекущийМодуль.Ссылка);
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Свод.Ссылка 
			|ПОМЕСТИТЬ КОбработке
			|ИЗ (" + КОбработке + ") КАК Свод
			|ГДЕ Свод.Ссылка.ДополнительныйМодуль = ЗНАЧЕНИЕ(Справочник.ДополнительныеМодули.ПустаяСсылка)
			|; ";
		КонецЕсли;
		ВызовыАлгоритмов = Неопределено;
		ПараметрыМодуля.Свойство("ВызовыАлгоритмов", ВызовыАлгоритмов);
		Если ВызовыАлгоритмов = Неопределено Тогда
			ПараметрыМодуля.Вставить("ВызовыАлгоритмов", Новый Соответствие());
		КонецЕсли;
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ссылка 
		|ПОМЕСТИТЬ КОбработке
		|ИЗ (" + КОбработке + ") КАК Свод
		|;"
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка.АлгоритмПослеЗагрузкиВсехДанных КАК Код
	|ПОМЕСТИТЬ АлгоритмыОтложеннойОбработки
	|ИЗ ("
	+ КОбработкеПКО + "
	|) КАК Свод
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Алгоритмы.Код КАК Код,
	|	Алгоритмы.Ссылка КАК Ссылка,
	|	Алгоритмы.Параметры КАК Параметры,
	|	Алгоритмы.Алгоритм КАК Алгоритм,
	|	Алгоритмы.ЭтоФункция КАК ЭтоФункция,
	|	Алгоритмы.Экспортный КАК Экспортный, 
	|	Алгоритмы.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА АлгоритмыОтложеннойОбработки.Код ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоАлгоритмПослеЗагрузкиВсехДанных
	|ИЗ
	|	Справочник.Алгоритмы КАК Алгоритмы
	|ЛЕВОЕ СОЕДИНЕНИЕ АлгоритмыОтложеннойОбработки КАК АлгоритмыОтложеннойОбработки
	|ПО Алгоритмы.Код = АлгоритмыОтложеннойОбработки.Код
	|ГДЕ Алгоритмы.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Алгоритмы.Код
	|;
	|ВЫБРАТЬ
	|	Код,
	|	Количество(Ссылка) КАК Количество
	|ИЗ
	|	Справочник.Алгоритмы КАК Алгоритмы
	|ГДЕ Алгоритмы.Ссылка В (ВЫБРАТЬ Ссылка ИЗ КОбработке)
	|СГРУППИРОВАТЬ ПО Код
	|ИМЕЮЩИЕ Количество(Ссылка) > 1
	|";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Результат = Запрос.ВыполнитьПакет();
	КоличествоТаблиц = Результат.Количество();
	ВыборкаДубли = Результат[КоличествоТаблиц - 1].Выбрать();
	Пока ВыборкаДубли.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю("Обнаружены алгоритмы с одинаковыми именами: " + ВыборкаДубли.Код);
	КонецЦикла;
	Выборка = Результат[КоличествоТаблиц - 2].Выбрать();
	ТекстПроцедурыВызоваОбработчика = ПараметрыМодуля.ТекстПроцедурыВызоваОбработчика;
	СтрокойВышеЕстьТег = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
			ПараметрыМодуля.ВызовыАлгоритмов.Вставить(НРег(СокрЛП(Выборка.Код)) + "(", СокрЛП(ПараметрыМодуля.ТекущийМодуль.Наименование) + "." + СокрЛП(Выборка.Код) + "(");
		КонецЕсли;
		ТегиПравила = ПолучитьТегиДляПравила(Выборка.Ссылка, ПараметрыМодуля);
		Если ЗначениеЗаполнено(ТегиПравила.ТегОткрытие) Тогда
			СтрокойВышеЕстьТег = Истина;
			ТекстПроцедуры.ДобавитьСтроку(ТегиПравила.ТегОткрытие);
		КонецЕсли;
		ДобавитьТекстАлгоритма(ТекстПроцедуры, Выборка, ВсеАлгоритмыЭкспортные, СтрокойВышеЕстьТег); 
		Если ЗначениеЗаполнено(ТегиПравила.ТегЗакрытие) Тогда
			ТекстПроцедуры.ДобавитьСтроку(ТегиПравила.ТегЗакрытие);
			СтрокойВышеЕстьТег = Истина;
		Иначе
			СтрокойВышеЕстьТег = Ложь;
		КонецЕсли;
		Если Выборка.ЭтоАлгоритмПослеЗагрузкиВсехДанных Тогда
			
			ТекстПараметрыВызова = Выборка.Параметры;
			НовыйМассивПараметров = Новый Массив;
			МассивПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПараметрыВызова, ",");
			Для Каждого ПараметрСтрокой Из МассивПараметров Цикл
				Если НРЕГ(СокрЛП(ПараметрСтрокой)) = НРег("ПараметрыКонвертации") Тогда
					ПараметрСтрокойПолный = "Параметры.КомпонентыОбмена." + СокрЛП(ПараметрСтрокой);
				Иначе
					ПараметрСтрокойПолный = "Параметры." + СокрЛП(ПараметрСтрокой);
				КонецЕсли;
				НовыйМассивПараметров.Добавить(ПараметрСтрокойПолный);
			КонецЦикла;
			ТекстПараметрыВызова = СтрСоединить(НовыйМассивПараметров, ", "); 
			Если ЗначениеЗаполнено(ТегиПравила.ТегОткрытие) Тогда
				ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика + Символы.ПС + ТегиПравила.ТегОткрытие;
			КонецЕсли;
			ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика 
				+ ?(ТекстПроцедурыВызоваОбработчика = "", "Если ", Символы.ПС + "ИначеЕсли ")
				+ "ИмяПроцедуры = """ + СокрЛП(Выборка.Код) + """ Тогда " + Символы.ПС + Символы.Таб
				+ СокрЛП(Выборка.Код) + "(" + Символы.ПС + Символы.Таб + Символы.Таб + ТекстПараметрыВызова + ");";
			Если ЗначениеЗаполнено(ТегиПравила.ТегЗакрытие) Тогда
				ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика + Символы.ПС + ТегиПравила.ТегЗакрытие;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;   
	Если ПараметрыМодуля.ИспользоватьРазделениеМодуля И ЗначениеЗаполнено(ТекстПроцедурыВызоваОбработчика) Тогда
		ПараметрыМодуля.ТекущийМодуль.ЕстьПроцедурыВызоваОбработчика = Истина;
	КонецЕсли;
	ПараметрыМодуля.ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика;
	ТекстыПоГруппам.СлужебныеПроцедурыИФункцииПоГруппам.Вставить("Алгоритмы",ТекстПроцедуры);

КонецПроцедуры

Процедура ДобавитьТекстАлгоритма(ТекстПроцедуры, Выборка, ВсеАлгоритмыЭкспортные, СтрокойВышеЗакрытТег)
	Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
		Если СтрокойВышеЗакрытТег Тогда
			ТекстПроцедуры.ДобавитьСтроку(Символы.ПС + Выборка.Комментарий);
		Иначе
			ТекстПроцедуры.ДобавитьСтроку(Выборка.Комментарий);
		КонецЕсли;
	КонецЕсли;

	ТекстПроцедуры.ДобавитьСтроку(?(Выборка.ЭтоФункция, "Функция ", "Процедура ") + СокрЛП(Выборка.Код) + "("
		+ СокрЛП(Выборка.Параметры)+")" + ?(ВсеАлгоритмыЭкспортные Или Выборка.Экспортный," Экспорт",""));
	ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(Выборка.Алгоритм));
	ТекстПроцедуры.ДобавитьСтроку(?(Выборка.ЭтоФункция, "КонецФункции", "КонецПроцедуры"));
КонецПроцедуры

// Добавление процедуры вызова обработчиков.
Процедура ЗаполнитьТекстПроцедурыВызоваОбработчиков(ПараметрыМодуля)
	ТекстПроцедуры = Новый ТекстовыйДокумент;
	ОбластьКомментарий = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Общие_Комментарий");
	ТекстПроцедуры.Вывести(ОбластьКомментарий);
	
	ЗаголовокПроцедуры = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ПроцедураВызоваОбработчика_Заголовок");
	ТекстПроцедуры.Вывести(ЗаголовокПроцедуры);
	Если ЗначениеЗаполнено(ПараметрыМодуля.ТекстПроцедурыВызоваОбработчика) Тогда 
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(ПараметрыМодуля.ТекстПроцедурыВызоваОбработчика));
		ТекстПроцедуры.ДобавитьСтроку(Символы.Таб + "КонецЕсли;");
	КонецЕсли;
	ТекстПроцедуры.ДобавитьСтроку("КонецПроцедуры");

	Если ПараметрыМодуля.ТекстФункцииВызоваОбработчика <> "" Тогда
		ЗаголовокПроцедуры = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_ФункцияВызоваОбработчика_Заголовок");
		ТекстПроцедуры.Вывести(ЗаголовокПроцедуры); 
		ТекстПроцедуры.ДобавитьСтроку(ДобавитьОтступыВСтроку(ПараметрыМодуля.ТекстФункцииВызоваОбработчика));
		ТекстПроцедуры.ДобавитьСтроку(Символы.Таб + "КонецЕсли;"+ Символы.ПС+"КонецФункции");
	КонецЕсли;
	ПараметрыМодуля.ПрограммныйИнтерфейс.ДобавитьСтроку(ТекстПроцедуры.ПолучитьТекст());
КонецПроцедуры

// Добавление процедур-обработчиков в текст модуля.
Процедура ДобавитьОбработчикиВТекстМодуля(ВидПравил, ИмяОбработчика, Выборка, ПараметрыМодуля, ТекстыПоГруппам, ТекГруппаПравил, ТегиДляПравила, ТекстОбработчики)
	ИмяПроцедуры = "";
	ТекстФункцииВызоваОбработчика = ПараметрыМодуля.ТекстФункцииВызоваОбработчика;
	ТекстПроцедурыВызоваОбработчика = ПараметрыМодуля.ТекстПроцедурыВызоваОбработчика;
	ТекстОбработчикиЛокально = ""; 
	ПостфиксЗаголовкаОбработчика = "";
	Если ПараметрыМодуля.ИспользоватьРазделениеМодуля Тогда
		ПостфиксЗаголовкаОбработчика = " Экспорт";
	КонецЕсли;
	Если СокрЛП(Выборка[ИмяОбработчика]) <> "" Тогда
		ИмяПроцедуры = ВидПравил+"_"+СокрЛП(Выборка.Код)+"_"+ИмяОбработчика;
		
		ОбластьПараметры = ПараметрыМодуля.МакетТекстовМодулей.ПолучитьОбласть("Конвертация_Параметры_"+ВидПравил+"_"+ИмяОбработчика);
		ТекстПараметры = СтрПолучитьСтроку(ОбластьПараметры.ПолучитьТекст(),2);
		// Параметры в месте объявления процедуры (общие).
		ТекстПараметрыПроцедуры = СтрЗаменить(ТекстПараметры, "_", "");
		
		Если ВидПравил = "ПОД" Тогда
			ИмяПараметра = ?(Выборка.ИспользоватьДляОтправки, "ДанныеИБ", "ДанныеXDTO");
			ТекстПараметрыПроцедуры = СтрЗаменить(ТекстПараметрыПроцедуры, "ОбъектОбработки", ИмяПараметра);
		КонецЕсли;
		
		// Параметры в месте вызова процедуры.
		ТекстПараметрыВызова = СтрЗаменить(ТекстПараметры, "_", "Параметры.");
		ТекстПараметрыВызова = СтрЗаменить(ТекстПараметрыВызова, "(", "(" + Символы.ПС + Символы.Таб + Символы.Таб);
		
		Если ИмяОбработчика = "ВыборкаДанных" Тогда
			
			ТекстОбработчикиЛокально = "Функция " + ИмяПроцедуры + ТекстПараметрыПроцедуры + ПостфиксЗаголовкаОбработчика 
				+ Символы.ПС + ДобавитьОтступыВСтроку(Выборка[ИмяОбработчика])
				+ Символы.ПС + "КонецФункции";
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегОткрытие) Тогда
				// Если есть тег тогда надо заполнить фиктивную ветку Если
				Если ТекстФункцииВызоваОбработчика = "" Тогда
					ТекстФункцииВызоваОбработчика = "Если ЛОЖЬ Тогда"; 
				КонецЕсли;
				ТекстФункцииВызоваОбработчика = ТекстФункцииВызоваОбработчика + Символы.ПС + ТегиДляПравила.ТегОткрытие + Символы.ПС + "ИначеЕсли "
					+ "ИмяФункции = """ + ИмяПроцедуры + """ Тогда " + Символы.ПС + Символы.Таб
					+ "Возврат " + ПараметрыМодуля.ПрефиксВызоваОбработчика + ИмяПроцедуры + ТекстПараметрыВызова + ";"
					+ ТегиДляПравила.ТегЗакрытие;
			Иначе
				ТекстФункцииВызоваОбработчика = ТекстФункцииВызоваОбработчика 
					+ ?(ТекстФункцииВызоваОбработчика = "", "Если ", Символы.ПС + "ИначеЕсли ")
					+ "ИмяФункции = """ + ИмяПроцедуры + """ Тогда " + Символы.ПС + Символы.Таб
					+ "Возврат " + ПараметрыМодуля.ПрефиксВызоваОбработчика + ИмяПроцедуры + ТекстПараметрыВызова + ";";
			КонецЕсли;
		Иначе
			
			ТекстОбработчика = Выборка[ИмяОбработчика];
			ПриВыгрузкеОбработчика(ИмяОбработчика, ТекстОбработчика, Выборка.ОбъектКонфигурации);
			ТекстОбработчикиЛокально = "Процедура " + ИмяПроцедуры + ТекстПараметрыПроцедуры + ПостфиксЗаголовкаОбработчика 
				+ Символы.ПС + ДобавитьОтступыВСтроку(ТекстОбработчика)
				+ Символы.ПС + "КонецПроцедуры";
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегОткрытие) Тогда
				Если ТекстПроцедурыВызоваОбработчика = "" Тогда
					ТекстПроцедурыВызоваОбработчика = "Если ЛОЖЬ Тогда";
				КонецЕсли;
				ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика + Символы.ПС + ТегиДляПравила.ТегОткрытие + Символы.ПС
					+  "ИначеЕсли " + "ИмяПроцедуры = """ + ИмяПроцедуры + """ Тогда " + Символы.ПС + Символы.Таб
					+ ПараметрыМодуля.ПрефиксВызоваОбработчика + ИмяПроцедуры + ТекстПараметрыВызова + ";"
					+ Символы.ПС + ТегиДляПравила.ТегЗакрытие;
			Иначе
				ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика 
					+ ?(ТекстПроцедурыВызоваОбработчика = "", "Если ", Символы.ПС + "ИначеЕсли ")
					+ "ИмяПроцедуры = """ + ИмяПроцедуры + """ Тогда " + Символы.ПС + Символы.Таб
					+ ПараметрыМодуля.ПрефиксВызоваОбработчика + ИмяПроцедуры + ТекстПараметрыВызова + ";";
			КонецЕсли;
		КонецЕсли;
			
		// Возможно, есть произвольные комментарии либо включен режим типизации переменных.
		Комментарий = РегистрыСведений.КомментарииКОбработчикам.ПрочитатьКомментарийКОбработчику(Выборка.Ссылка, ИмяОбработчика);
		Если НЕ ЗначениеЗаполнено(Комментарий) И ПараметрыМодуля.ИспользоватьТипизациюПеременных Тогда
			ИмяОбластиКомментарий = "Комментарий_"+ВидПравил+"_"+ИмяОбработчика; 
			ОбластьКомментарий = ПараметрыМодуля.МакетТекстовМодулейДетализацияКомментариев.ПолучитьОбласть(ИмяОбластиКомментарий);
			Комментарий = ОбластьКомментарий.ПолучитьТекст(); 
			Комментарий = СтрЗаменить(Комментарий, "#Область " + ИмяОбластиКомментарий, "");
			Если ИмяОбработчика = "ПриОбработке" Или ИмяОбработчика = "ПриКонвертацииДанныхXDTO"
				Или ИмяОбработчика = "ПередЗаписьюПолученныхДанных" Или ИмяОбработчика = "ПриОтправкеДанных" Тогда
				// Определить тип данных по правилу.
				Если ВидПравил = "ПКО" Тогда
					ОбъектКонфигурации = СокрЛП(Выборка.ОбъектКонфигурации);
				Иначе
					ОбъектКонфигурации = СокрЛП(Выборка.ОбъектВыборки);
				КонецЕсли;
				Комментарий = СтрЗаменить(Комментарий, "%ТипДанныеИБ%", ПолучитьТипОбъекта(ОбъектКонфигурации));
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Комментарий) Тогда
			ТекстОбработчикиЛокально = Комментарий + ТекстОбработчикиЛокально;
		КонецЕсли;
	КонецЕсли;
	ПараметрыМодуля.ТекстФункцииВызоваОбработчика = ТекстФункцииВызоваОбработчика;
	ПараметрыМодуля.ТекстПроцедурыВызоваОбработчика = ТекстПроцедурыВызоваОбработчика;
	Если ТекстОбработчикиЛокально <> "" Тогда
		Если ПараметрыМодуля.ГруппироватьПоОбъектамВыгрузки Тогда
			ТекстОбработчики = ТекстОбработчики + ?(ТекстОбработчики = "", "", Символы.ПС) + ТекстОбработчикиЛокально;
		Иначе
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегОткрытие) Тогда
				ТекстОбработчикиЛокально = ТегиДляПравила.ТегОткрытие + Символы.ПС + ТекстОбработчикиЛокально;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТегиДляПравила.ТегЗакрытие) Тогда
				ТекстОбработчикиЛокально = ТекстОбработчикиЛокально + Символы.ПС + ТегиДляПравила.ТегЗакрытие;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ТекГруппаПравил)
				И НЕ ПредопределеннаяГруппаПравил(ТекГруппаПравил) Тогда
				Если ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам.Свойство(ТекГруппаПравил) Тогда
					ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам[ТекГруппаПравил].ДобавитьСтроку(ТекстОбработчикиЛокально);
				Иначе
					РазделПравил = Новый ТекстовыйДокумент;
					РазделПравил.ДобавитьСтроку(ТекстОбработчикиЛокально);
					ТекстыПоГруппам.ОбработчикиКонвертацииПоГруппам.Вставить(ТекГруппаПравил, РазделПравил);
				КонецЕсли;
			Иначе
				ТекстыПоГруппам.ОбработчикиКонвертации.ДобавитьСтроку(ТекстОбработчикиЛокально);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ВспомогательныеПроцедурыИФункции
// Дополнение для расширенного синтаксического контроля.
Процедура ПриВыгрузкеОбработчика(ИмяОбработчика, ТекстОбработчика, ОбъектКонфигурацииСтрокой)
	Если Не ВыгрузкаДляРасширенногоСинтаксическогоКонтроля Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектКонфигурацииСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяОбработчика = "ПриОтправкеДанных"
		Или ИмяОбработчика = "ПередЗаписьюПолученныхДанных"
		Или ИмяОбработчика = "ПриОбработке" Тогда
		
			Если Найти(ОбъектКонфигурацииСтрокой, "ДокументСсылка.") > 0 Тогда
				ТекстОбработчика = "ДанныеИБ = Документы." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "ДокументСсылка.", "")
					+ ".СоздатьДокумент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			ИначеЕсли Найти(ОбъектКонфигурацииСтрокой, "СправочникСсылка.") > 0 Тогда
				ТекстОбработчика = "ДанныеИБ = Справочники." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "СправочникСсылка.", "")
					+ ".СоздатьЭлемент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			КонецЕсли;
	КонецЕсли;
		
	Если ИмяОбработчика = "ПриКонвертацииДанныхXDTO"
		Или ИмяОбработчика = "ПередЗаписьюПолученныхДанных" Тогда
		
		Если Найти(ОбъектКонфигурацииСтрокой, "ДокументСсылка.") > 0 Тогда
				ТекстОбработчика = "ПолученныеДанные = Документы." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "ДокументСсылка.", "")
					+ ".СоздатьДокумент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			ИначеЕсли Найти(ОбъектКонфигурацииСтрокой, "СправочникСсылка.") > 0 Тогда
				ТекстОбработчика = "ПолученныеДанные = Справочники." 
					+ СтрЗаменить(ОбъектКонфигурацииСтрокой, "СправочникСсылка.", "")
					+ ".СоздатьЭлемент();"
					+ Символы.ПС
					+ ТекстОбработчика;
			КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Вычисление тип объекта выборки для добавления в таблицу правил.
Функция ПолучитьТипМетаданные(ТипОбъектаВыборки, ОбъектВыборки, БезМетаданных = Ложь)
	Если СокрЛП(ОбъектВыборки) = "" Тогда
		Возврат "Неопределено";
	КонецЕсли;
	
	Если БезМетаданных Тогда
		ТипМетаданные = "";
	Иначе
		ТипМетаданные = "Метаданные.";
	КонецЕсли;
	
	ИмяОбъекта = СокрЛП(ОбъектВыборки);
	ИмяОбъекта = Прав(ИмяОбъекта, СтрДлина(ИмяОбъекта) - Найти(ИмяОбъекта,"."));
	Если ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Справочник
		Или Найти(НРег(ОбъектВыборки), НРег("СправочникСсылка.")) > 0 Тогда
		ТипОбъекта = "Справочники";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Документ
		Или Найти(НРег(ОбъектВыборки), НРег("ДокументСсылка.")) > 0 Тогда
		ТипОбъекта = "Документы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.БизнесПроцесс
		Или Найти(НРег(ОбъектВыборки), НРег("БизнесПроцессСсылка.")) > 0 Тогда
		ТипОбъекта = "БизнесПроцессы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Задача
		Или Найти(НРег(ОбъектВыборки), НРег("ЗадачаСсылка.")) > 0 Тогда
		ТипОбъекта = "Задачи";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.НаборКонстант
		Или Найти(НРег(ОбъектВыборки), НРег("КонстантыНабор")) > 0 Тогда
		ТипОбъекта = "Константы";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
		Или Найти(НРег(ОбъектВыборки), НРег("ПланВидовХарактеристикСсылка.")) > 0 Тогда
		ТипОбъекта = "ПланыВидовХарактеристик";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.Перечисление
		Или Найти(НРег(ОбъектВыборки), НРег("ПеречислениеСсылка.")) > 0 Тогда
		ТипОбъекта = "Перечисления";
	ИначеЕсли ТипОбъектаВыборки = Перечисления.ТипыОбъектов.РегистрСведений
		Или Найти(НРег(ОбъектВыборки), НРег("РегистрСведенийЗапись.")) > 0 Тогда
		ТипОбъекта = "РегистрыСведений";
	Иначе
		ТипОбъекта = "";
	КонецЕсли;
	Возврат ТипМетаданные+ТипОбъекта+"."+ИмяОбъекта;
КонецФункции

// Вычисление типа объекта для добавления в комментарий к обработчику.
Функция ПолучитьТипОбъекта(ТипСсылки)
	ПозицияТочки = СтрНайти(ТипСсылки, ".");
	Если ПозицияТочки = 0 Тогда
		Возврат "Произвольный";
	КонецЕсли;
	ТипСсылкиаДляПоиска = НРег(ТипСсылки);
	Если Найти(ТипСсылкиаДляПоиска, НРег("СправочникСсылка.")) > 0
		Или Найти(ТипСсылкиаДляПоиска, НРег("Справочник.")) > 0 Тогда
		ТипОбъекта = "СправочникОбъект";
	ИначеЕсли Найти(ТипСсылкиаДляПоиска, НРег("ДокументСсылка.")) > 0 
		Или Найти(ТипСсылкиаДляПоиска, НРег("Документ.")) > 0  Тогда
		ТипОбъекта = "ДокументОбъект";
	ИначеЕсли Найти(ТипСсылкиаДляПоиска, НРег("БизнесПроцессСсылка.")) > 0 Тогда
		ТипОбъекта = "БизнесПроцессОбъект";
	ИначеЕсли Найти(ТипСсылкиаДляПоиска, НРег("ЗадачаСсылка.")) > 0 Тогда
		ТипОбъекта = "ЗадачаОбъект";
	ИначеЕсли Найти(ТипСсылкиаДляПоиска, НРег("ПланВидовХарактеристикСсылка.")) > 0 Тогда
		ТипОбъекта = "ПланыВидовХарактеристикОбъект";
	ИначеЕсли Найти(ТипСсылкиаДляПоиска, НРег("ПеречислениеСсылка.")) > 0 Тогда
		ТипОбъекта = "ПеречислениеСсылка";
	ИначеЕсли Найти(ТипСсылкиаДляПоиска, НРег("РегистрСведенийЗапись.")) > 0 Тогда
		ТипОбъекта = "РегистрСведенийЗапись";
	Иначе
		Возврат "Произвольный";
	КонецЕсли;
	Возврат ТипОбъекта + Сред(ТипСсылки, ПозицияТочки);
КонецФункции

// Добавление отступа для помещения текста обработчика в процедуру обработчика.
Функция ДобавитьОтступыВСтроку(СтрокаАлгоритма, СжиматьПробелы = Истина)
	Если СжиматьПробелы Тогда
		ТекСтрокаАлгоритма = СокрЛП(СтрокаАлгоритма);
	Иначе
		ТекСтрокаАлгоритма = СтрокаАлгоритма;
	КонецЕсли;
	Возврат Символы.Таб + СтрЗаменить(ТекСтрокаАлгоритма, Символы.ПС, Символы.ПС + Символы.Таб);
КонецФункции

// Добавление отступа в тестовый документ.
Функция ДобавитьОтступыВТекстовыйДокумент(ИсходныйДокумент)
	ПреобразованныйДокумент = Новый ТекстовыйДокумент;
	Для Стр = 0 По ИсходныйДокумент.КоличествоСтрок() Цикл
		ТекСтрока = ИсходныйДокумент.ПолучитьСтроку(Стр);
		СтрокаСОтступом = Символы.Таб + СокрЛП(ТекСтрока);
		ПреобразованныйДокумент.ДобавитьСтроку(СтрокаСОтступом);
	КонецЦикла;
	Возврат ПреобразованныйДокумент.ПолучитьТекст();
КонецФункции

// Объединение текстов для отправки, для получения и общего в один текст с обрамлением условиями по направлению обмена.
Процедура ДополнитьТекстПроцедурыСУсловиями(ТекстПроцедуры, ТекстДляОтправки, ТекстДляПолучения, ТекстОбщий)
	СтрокаТекстДляОтправки = ТекстДляОтправки.ПолучитьТекст();
	Если СокрЛП(СтрокаТекстДляОтправки) <> "" Тогда
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"Если НаправлениеОбмена = ""Отправка"" Тогда");
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+ДобавитьОтступыВСтроку(СтрокаТекстДляОтправки));
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"КонецЕсли;");
	КонецЕсли;
	СтрокаТекстДляПолучения = ТекстДляПолучения.ПолучитьТекст();
	Если СокрЛП(СтрокаТекстДляПолучения) <> "" Тогда
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"Если НаправлениеОбмена = ""Получение"" Тогда");
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+ДобавитьОтступыВСтроку(СтрокаТекстДляПолучения));
		ТекстПроцедуры.ДобавитьСтроку(""+Символы.Таб+"КонецЕсли;");
	КонецЕсли;
	СтрокаТекстОбщий = ТекстОбщий.ПолучитьТекст();
	Если СокрЛП(СтрокаТекстОбщий) <> "" Тогда
		ТекстПроцедуры.ДобавитьСтроку(СтрокаТекстОбщий);
	КонецЕсли;
КонецПроцедуры

// Формирование текста запроса к правилам при выключенной совместной работе.
Функция ТекстЗапросаБезСовместнойРаботы(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ 
	|	И Правила.ВременнаяКопия = ЛОЖЬ";	
КонецФункции

// Формирование текста запроса к правилам при формировании модуля на основании хранилища.
Функция ТекстЗапросаВсеИзХранилища(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.ВременнаяКопия = ЛОЖЬ
	|	И (Правила.Захвачен = ЛОЖЬ
	|	ИЛИ Правила.Копия = ИСТИНА)";
КонецФункции

// Формирование текста запроса к правилам при формировании модуля по текущему состоянию.
Функция ТекстЗапросаСвоиДоработки(ИмяСправочника)
	Возврат "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Захвачен = ЛОЖЬ
	|	И Правила.ВременнаяКопия = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник." + ИмяСправочника +"
	|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
	|ПО ДанныеЗахвата.РабочаяКопия = Правила.Ссылка
	|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Копия = ИСТИНА   
	|	И Правила.ВременнаяКопия = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ПО СоставыКонвертаций.ЭлементКонвертации = Правила.Ссылка
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И СоставыКонвертаций.Отключить = ЛОЖЬ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник." + ИмяСправочника +"
	|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
	|ПО ДанныеЗахвата.Объект = Правила.Ссылка
	|	И ДанныеЗахвата.Пользователь = &ТекущийПользователь
	|ГДЕ Правила.ПометкаУдаления = ЛОЖЬ
	|	И Правила.Копия = ЛОЖЬ И Правила.Захвачен = ИСТИНА
	|	И Правила.ВременнаяКопия = ЛОЖЬ
	|";
	
КонецФункции

// Проверка является ли группа правил предопределенной.
Функция ПредопределеннаяГруппаПравил(ТекГруппаПравил)
	Если ТекГруппаПравил = "_Все_правила_" Или ТекГруппаПравил = "_Без_группы_" Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

// Приведение имени группы правил к виду пригодному для модуля.
Процедура ПривестиИмяГруппыПравил(ТекГруппаПравил)
	ТекГруппаПравил = СокрЛП(ТекГруппаПравил);
	ТекГруппаПравил = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" /\,.-()<>", ТекГруппаПравил, "__________"); 
КонецПроцедуры

#КонецОбласти
#Область ПроцедурыВычисленияТегов
Функция ПолучитьТегиДляПравила(ПравилоСсылка, ПараметрыМодуля)
	Если ПараметрыМодуля.ДобавлятьТеги = Ложь Тогда
		Возврат Новый Структура("ТегОткрытие, ТегЗакрытие", "", "");
	КонецЕсли;
	СтрокиТЧ = ПравилоСсылка.Теги.Выгрузить();
	Если СтрокиТЧ.Количество() = 0 Тогда
		Возврат Новый Структура("ТегОткрытие, ТегЗакрытие", "", "");
	КонецЕсли;
	ТегОткрытие = "";
	ТегЗакрытие = "";
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		ТегОткрытие = ТегОткрытие + ?(ТегОткрытие = "", "", Символы.ПС + Символы.ПС) + "//++ " + СокрЛП(СтрокаТЧ.Тег.Наименование);
		ТегЗакрытие = "//-- " + СокрЛП(СтрокаТЧ.Тег.Наименование) + ?(ТегЗакрытие = "", "", Символы.ПС + Символы.ПС + ТегЗакрытие);
	КонецЦикла;
	ТекСхлопывание = ТегЗакрытие + Символы.ПС + ТегОткрытие;
	Если ПараметрыМодуля.СхлопываниеТегов.Найти(ТекСхлопывание) = Неопределено Тогда
		ПараметрыМодуля.СхлопываниеТегов.Добавить(ТекСхлопывание);
		Схлопывание1Отступ = ДобавитьОтступыВСтроку(ТекСхлопывание, Ложь);
		ПараметрыМодуля.СхлопываниеТегов.Добавить(Схлопывание1Отступ);
		Схлопывание2Отступ = ДобавитьОтступыВСтроку(Схлопывание1Отступ, Ложь);
		ПараметрыМодуля.СхлопываниеТегов.Добавить(Схлопывание2Отступ);
		ДлинаТега = СтрЧислоСтрок(ТекСхлопывание);
		Если ДлинаТега > ПараметрыМодуля.МаксимальнаяДлинаТега Тогда
			ПараметрыМодуля.МаксимальнаяДлинаТега = ДлинаТега;
		КонецЕсли;
	КонецЕсли;
	Возврат Новый Структура("ТегОткрытие, ТегЗакрытие", ТегОткрытие, ТегЗакрытие)
КонецФункции

Процедура ВыполнитьСхлопываниеТеговВМодуле(ПараметрыМодуля, ОбщийТекстМодуля)
	ТекДлинаТега = ПараметрыМодуля.МаксимальнаяДлинаТега;
	Пока ТекДлинаТега > 0 Цикл
		Для Каждого СхлТег Из ПараметрыМодуля.СхлопываниеТегов Цикл
			Если СтрЧислоСтрок(СхлТег) = ТекДлинаТега Тогда
				ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, Символы.ПС + СхлТег + Символы.ПС, Символы.ПС);
			КонецЕсли;
		КонецЦикла;
		ТекДлинаТега = ТекДлинаТега - 2;
	КонецЦикла;
	
	// После схлопывания тегов может остаться склеенная строка.
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, "КонецПроцедурыПроцедура", "КонецПроцедуры" + Символы.ПС + "Процедура");
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, "КонецФункцииПроцедура", "КонецФункции" + Символы.ПС + "Процедура");
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, "КонецФункцииФункция", "КонецФункции" + Символы.ПС + "Функция");
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, "КонецПроцедурыФункция", "КонецПроцедуры" + Символы.ПС + "Функция");
	
	Для Каждого ТекТегЗакрытие Из ПараметрыМодуля.ВсеТеги Цикл
		Для Каждого ТекТегОткрытие Из ПараметрыМодуля.ВсеТеги Цикл
			Если ТекТегЗакрытие = ТекТегОткрытие Тогда
				Продолжить;
			КонецЕсли;
			НайтиИЗаменитьСклеенныйТег(ОбщийТекстМодуля, ТекТегОткрытие, ТекТегЗакрытие);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура НайтиИЗаменитьСклеенныйТег(ОбщийТекстМодуля, ТекТегОткрытие, ТекТегЗакрытие)
	ПодстрокаПоиска = "//-- " + ТекТегЗакрытие + Символы.ПС + "//++ " + ТекТегОткрытие;
	ПодстрокаЗамены = "//-- " + ТекТегЗакрытие + Символы.ПС + Символы.ПС + "//++ " + ТекТегОткрытие;
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, ПодстрокаПоиска, ПодстрокаЗамены);
	ПодстрокаПоискаОтступ1 = ДобавитьОтступыВСтроку(ПодстрокаПоиска);
	ПодстрокаЗаменыОтступ1 = ДобавитьОтступыВСтроку(ПодстрокаЗамены); 
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, ПодстрокаПоискаОтступ1, ПодстрокаЗаменыОтступ1);
	ПодстрокаПоискаОтступ2 = ДобавитьОтступыВСтроку(ПодстрокаПоискаОтступ1);
	ПодстрокаЗаменыОтступ2 = ДобавитьОтступыВСтроку(ПодстрокаЗаменыОтступ1);
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, ПодстрокаПоискаОтступ2, ПодстрокаЗаменыОтступ2);
	ПодстрокаПоискаОтступ3 = ДобавитьОтступыВСтроку(ПодстрокаПоискаОтступ3);
	ПодстрокаЗаменыОтступ3 = ДобавитьОтступыВСтроку(ПодстрокаЗаменыОтступ3);
	ОбщийТекстМодуля = СтрЗаменить(ОбщийТекстМодуля, ПодстрокаПоискаОтступ3, ПодстрокаЗаменыОтступ3);
КонецПроцедуры

Процедура УдалитьПоследнийПереводСтроки(СтрокаДляДобавления) 
	Если Прав(СтрокаДляДобавления, 1) = Символы.ПС Тогда
		СтрокаДляДобавления = Сред(СтрокаДляДобавления,1, СтрДлина(СтрокаДляДобавления)-1);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецОбласти
#КонецЕсли