#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
Функция ПолучитьМножественноеПредставлениеТипаОбъекта(ТипОбъекта) Экспорт
	
	СтрокаТипОбъекта = "";
	
	Если      ТипОбъекта = Перечисления.ТипыОбъектов.Документ               Тогда СтрокаТипОбъекта = НСтр("ru='Документы'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Справочник             Тогда СтрокаТипОбъекта = НСтр("ru='Справочники'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрСведений        Тогда СтрокаТипОбъекта = НСтр("ru='Регистры сведений'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик Тогда СтрокаТипОбъекта = НСтр("ru='Планы видов характеристик'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.НаборКонстант          Тогда СтрокаТипОбъекта = НСтр("ru='Набор констант'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета       Тогда СтрокаТипОбъекта = НСтр("ru='Планы видов расчета'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.БизнесПроцесс          Тогда СтрокаТипОбъекта = НСтр("ru='Бизнес процессы'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ВидРасчета             Тогда СтрокаТипОбъекта = НСтр("ru='Виды расчетов'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ВидСубконто            Тогда СтрокаТипОбъекта = НСтр("ru='Виды субконто'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Задача                 Тогда СтрокаТипОбъекта = НСтр("ru='Задачи'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Календарь              Тогда СтрокаТипОбъекта = НСтр("ru='Календари'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.Перечисление           Тогда СтрокаТипОбъекта = НСтр("ru='Перечисления'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланОбмена             Тогда СтрокаТипОбъекта = НСтр("ru='Планы обмена'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов             Тогда СтрокаТипОбъекта = НСтр("ru='Планы счетов'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрБухгалтерии     Тогда СтрокаТипОбъекта = НСтр("ru='Регистры бухгалтерии'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрНакопления      Тогда СтрокаТипОбъекта = НСтр("ru='Регистры накопления'");
	ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектов.РегистрРасчета         Тогда СтрокаТипОбъекта = НСтр("ru='Регистры расчета'");
	Иначе
		// если ничего не подошло возвращаем представление в ед. числе
		СтрокаТипОбъекта = Строка(ТипОбъекта);
	КонецЕсли;
	
	Возврат СтрокаТипОбъекта;
	
КонецФункции

#КонецОбласти

#КонецЕсли

