#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	Если ЗначениеЗаполнено(Ссылка) 
		И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		КонвертацияДанныхXDTOСервер.ПроверитьЗахватОбъектаПриПометкеНаУдаление(Ссылка.Захвачен, ПометкаУдаления, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ЭтоГруппа ИЛИ Не ЗначениеЗаполнено(ОбъектНастройки) Тогда
		Возврат;
	ИначеЕсли НЕ ПустаяСтрока(Наименование) И ЗначениеЗаполнено(Родитель) Тогда
		Возврат;
	КонецЕсли;
		
	// Данные объекта настройки.
	ДанныеОбъектаНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектНастройки, "Синоним, Тип");
	// Если наименование не заполнено, то получаем значение по умолчанию.
	Если ПустаяСтрока(Наименование) Тогда
		
		Наименование = ДанныеОбъектаНастройки.Синоним;
		
	КонецЕсли;
	
	// определяем группу элемента по умолчанию
	Если НЕ Родитель.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ТипДляГруппы = ДанныеОбъектаНастройки.Тип;
	Владелец  = Владелец;
	
	ГруппаПоУмолчанию = Справочники.ПравилаРегистрацииОбъектов.НайтиПоРеквизиту("ТипГруппы", ТипДляГруппы,, Владелец);
	Если ЗначениеЗаполнено(ГруппаПоУмолчанию) Тогда
		Родитель = ГруппаПоУмолчанию;
		Возврат;
	КонецЕсли;
	// Создаем новую группу.
	ГруппаПоУмолчаниюОбъект = Справочники.ПравилаРегистрацииОбъектов.СоздатьГруппу();
	
	ГруппаПоУмолчаниюОбъект.ТипГруппы    = ТипДляГруппы;
	ГруппаПоУмолчаниюОбъект.Владелец     = Владелец;
	
	ГруппаПоУмолчаниюОбъект.Наименование = Справочники.ПравилаРегистрацииОбъектов.ПолучитьМножественноеПредставлениеТипаОбъекта(ТипДляГруппы);
	
	Попытка
		ГруппаПоУмолчаниюОбъект.Записать();
		
		ГруппаПоУмолчанию = ГруппаПоУмолчаниюОбъект.Ссылка;
		
	Исключение
		ГруппаПоУмолчанию = Справочники.ПравилаРегистрацииОбъектов.ПустаяСсылка();
	КонецПопытки;
	Родитель = ГруппаПоУмолчанию;
КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// Запись нового объекта в режиме совместной работы: следует добавить запись в регистр захвата.
	Если ДополнительныеСвойства.Свойство("ЭтоНовый")
		И ДополнительныеСвойства.ЭтоНовый 
		И Захвачен И Константы.СовместнаяРабота.Получить()  Тогда
		КонвертацияДанныхXDTOСервер.ОтразитьЗахватНовогоОбъекта(Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
