#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	#Если Сервер Или ВнешнееСоединение Тогда
	Если НЕ ЭтоНовый() Тогда
		КонвертацияДанныхXDTOСервер.ПроверитьВозможностьИзмененияСтатуса(Ссылка, Статус, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	#Если Сервер Или ВнешнееСоединение Тогда
	КонвертацияДанныхXDTOСервер.ОтразитьИзмененияСтатуса(Ссылка, Статус);
	#КонецЕсли
КонецПроцедуры
#КонецОбласти
#КонецЕсли