#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Формирует текст обработчиков загрузки/выгрузки.
// Параметры:
//   Конвертация - СправочникСсылка.Конвертации - Конвертация, для которой формируется текст.
//   ЭтоВыгрузка - Булево - Признак формирования обработчиков выгрузки.
//   ТолькоИспользуемые - Булево - Включать в текст только используемые (не пустые) обработчики. 
Функция ПолучитьТекстОбработчиков(Конвертация, ЭтоВыгрузка, ТолькоИспользуемые) Экспорт
	ОбщиеПеременные = Новый Структура("Конвертация, ЭтоВыгрузка, ТолькоИспользуемые", Конвертация, ЭтоВыгрузка, ТолькоИспользуемые);
	МакетПараметров = ПолучитьМакет("ПараметрыОбработчиков");
	МакетОбщихПроцедур = ПолучитьМакет("ОбщиеПроцедурыИФункции");

	ОтладочныйМодуль = Новый ТекстовыйДокумент;
	ОтладочныйМодуль.ДобавитьСтроку("#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда");
	ОтладочныйМодуль.ДобавитьСтроку("");
	
	ОбластьШапки = МакетОбщихПроцедур.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.СтрокаИдентификатора = СтрокаИнформацииМодуля(ОбщиеПеременные);
	ОтладочныйМодуль.Вывести(ОбластьШапки);
	
	ВывестиОбластьМакета(МакетОбщихПроцедур, "Конвертация_Комментарий", ОтладочныйМодуль);
	ЗаписатьОбработчики(ПолучитьОбработчикиКонвертация(МакетПараметров, ОбщиеПеременные), ОтладочныйМодуль);
	
	ВывестиОбластьМакета(МакетОбщихПроцедур, "ПКО_Комментарий", ОтладочныйМодуль);
	ЗаписатьОбработчики(ПолучитьОбработчикиПКО(МакетПараметров, ОбщиеПеременные), ОтладочныйМодуль);
	ЗаписатьОбработчики(ПолучитьОбработчикиПКПД(МакетПараметров, ОбщиеПеременные), ОтладочныйМодуль);

	
	ВывестиОбластьМакета(МакетОбщихПроцедур, "ПКС_Комментарий", ОтладочныйМодуль);
	ЗаписатьОбработчики(ПолучитьОбработчикиПКС(МакетПараметров, ОбщиеПеременные), ОтладочныйМодуль);
	
	ВывестиОбластьМакета(МакетОбщихПроцедур, "ПКГС_Комментарий", ОтладочныйМодуль);
	ЗаписатьОбработчики(ПолучитьОбработчикиПКГС(МакетПараметров, ОбщиеПеременные), ОтладочныйМодуль);
	
	ВывестиОбластьМакета(МакетОбщихПроцедур, "ПВД_Комментарий", ОтладочныйМодуль);
	ЗаписатьОбработчики(ПолучитьОбработчикиПВД(МакетПараметров, ОбщиеПеременные), ОтладочныйМодуль);
	
	
	ВывестиОбластьМакета(МакетОбщихПроцедур, "Алгоритмы_Комментарий", ОтладочныйМодуль);
	ТаблицаАлгоритмов = ПолучитьОбработчикиАлгоритмы(ОбщиеПеременные);
	ЗаписатьОбработчики(ТаблицаАлгоритмов, ОтладочныйМодуль);
	
	ВывестиОбщиеПроцедурыИФункции(МакетОбщихПроцедур, ОтладочныйМодуль);
	
	ОтладочныйМодуль.ДобавитьСтроку("#КонецЕсли");
	
	ТекстМодуля = ИзмененныйВызовАлгоритмов(ТаблицаАлгоритмов, ОтладочныйМодуль);
	
	Возврат ТекстМодуля;
КонецФункции
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура ВывестиОбщиеПроцедурыИФункции(МакетОбщихПроцедур, ОтладочныйМодуль)
	
	ВывестиОбластьМакета(МакетОбщихПроцедур, "ОбщиеПроцедурыФункции_Комментарий", ОтладочныйМодуль);
	
	ТекстПоиска = ОтладочныйМодуль.ПолучитьТекст();
	
	СписокТиповыхПроцедур = Новый Массив;
	ПрочитатьОбработчики(МакетОбщихПроцедур, СписокТиповыхПроцедур, Истина);
	ПрочитатьОбработчики(МакетОбщихПроцедур, СписокТиповыхПроцедур, Ложь);
	Для Каждого ТиповаяПроцедура Из СписокТиповыхПроцедур Цикл
		
		НачалоПараметров = Найти(ТиповаяПроцедура, "(");
		ЗаголовокПроцедуры = СокрЛП(Лев(ТиповаяПроцедура, НачалоПараметров - 1));
		
		ВывестиОбластьМакета(МакетОбщихПроцедур, ЗаголовокПроцедуры, ОтладочныйМодуль);
		
	КонецЦикла;
КонецПроцедуры

// Получает глобальные обработчики конвертации из ИБ.
//
// Параметры:
//	МакетПараметров - ТекстовыйДокумент - Содержит параметры обработчиков.
//
Функция ПолучитьОбработчикиКонвертация(МакетПараметров, ОбщиеПеременные)
	
	Перем СтрокаВыборкаКолонок, СтрокаОграничений;
	
	МассивКолонок = МассивИменОбработчиков("Конвертация", ОбщиеПеременные);
	
	Если МассивКолонок.Количество() <> 0 Тогда
		
		СоздатьПараметрыТекстаДляЗапроса("Конвертации", МассивКолонок, СтрокаВыборкаКолонок, СтрокаОграничений, ОбщиеПеременные);
		
		НачатьТранзакцию();
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	Конвертации.Ссылка
		|	[СтрокаВыборкаКолонок]
		|ИЗ
		|	Справочник.Конвертации КАК Конвертации
		|ГДЕ
		|	Конвертации.Ссылка = &Конвертация
		|	[СтрокаОграничений]";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаВыборкаКолонок]", СтрокаВыборкаКолонок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаОграничений]", СтрокаОграничений);
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТаблицаКонвертации = ТаблицаОбработчиков();
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Колонка Из МассивКолонок Цикл
				Если ОбщиеПеременные.ТолькоИспользуемые И Не ЗначениеЗаполнено(Выборка[Колонка]) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ИмяСобытия = Сред(Колонка, 9);
				ИмяОбласти = "Конвертация_[ИмяСобытия]";
				ИмяОбласти = СтрЗаменить(ИмяОбласти, "[ИмяСобытия]", ИмяСобытия);
				ТекущаяОбласть = МакетПараметров.ПолучитьОбласть(ИмяОбласти);
				ПараметрыОбработчика = ТекстПоОбластиБезНазванияОбласти(ТекущаяОбласть);
				
				СтрокаПравила = ТаблицаКонвертации.Добавить();
				СтрокаПравила.ИмяОбработчика = ИмяОбласти;
				СтрокаПравила.ПараметрыОбработчика = ПараметрыОбработчика;
				СтрокаПравила.ТелоОбработчика = ТелоПроцедурыСТабуляцией(Выборка[Колонка]);
				
			КонецЦикла;
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		Возврат ТаблицаКонвертации;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает обработчики ПКО из ИБ.
//
// Параметры:
//	МакетПараметров - ТекстовыйДокумент - Содержит параметры обработчиков.
//
Функция ПолучитьОбработчикиПКО(МакетПараметров, ОбщиеПеременные, Отбор = Неопределено)
	
	Перем СтрокаВыборкаКолонок, СтрокаОграничений;
	
	МассивКолонок = МассивИменОбработчиков("ПравилаКонвертацииОбъектов", ОбщиеПеременные);
	
	Если МассивКолонок.Количество() <> 0 Тогда
		
		СоздатьПараметрыТекстаДляЗапроса("ПКО", МассивКолонок, СтрокаВыборкаКолонок, СтрокаОграничений, ОбщиеПеременные);
		
		НачатьТранзакцию();
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ПКО.Ссылка,
		|	ПКО.Код КАК Код
		|	[СтрокаВыборкаКолонок]
		|ИЗ
		|	Справочник.ПравилаКонвертацииОбъектов КАК ПКО
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = ПКО.Ссылка
		|ГДЕ
		|	Состав.Владелец = &Конвертация
		|	И НЕ ПКО.ПометкаУдаления
		|	И НЕ Состав.ПометкаУдаления
		|	И [УсловиеОтбора]
		|	[СтрокаОграничений]
		|УПОРЯДОЧИТЬ ПО Код"; 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаВыборкаКолонок]", СтрокаВыборкаКолонок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаОграничений]", СтрокаОграничений);
		
		Если Отбор = Неопределено Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "Истина");
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "ПКО.Ссылка = &Отбор");
			Запрос.УстановитьПараметр("Отбор", Отбор);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТаблицаПКО = ТаблицаОбработчиков();
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Колонка Из МассивКолонок Цикл
				
				Если ОбщиеПеременные.ТолькоИспользуемые И Не ЗначениеЗаполнено(Выборка[Колонка]) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ИмяСобытия = Сред(Колонка, 9);
				ИмяПКО = "ПКО_[ИмяПКО]_[ИмяСобытия]";
				ИмяПКО = СтрЗаменить(ИмяПКО, "[ИмяСобытия]", ИмяСобытия);
				ИмяПКО = СтрЗаменить(ИмяПКО, "[ИмяПКО]", СокрЛП(Выборка.Код));
				ИмяОбласти = "ПКО_[ИмяСобытия]";
				ИмяОбласти = СтрЗаменить(ИмяОбласти, "[ИмяСобытия]", ИмяСобытия);
				ТекущаяОбласть = МакетПараметров.ПолучитьОбласть(ИмяОбласти);
				ПараметрыОбработчика = ТекстПоОбластиБезНазванияОбласти(ТекущаяОбласть);
				
				СтрокаПравила = ТаблицаПКО.Добавить();
				СтрокаПравила.ИмяОбработчика = ИмяПКО;
				СтрокаПравила.ПараметрыОбработчика = ПараметрыОбработчика;
				СтрокаПравила.ТелоОбработчика = ТелоПроцедурыСТабуляцией(Выборка[Колонка]);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат ТаблицаПКО;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает обработчики ПКПД из ИБ.
//
// Параметры:
//	МакетПараметров - ТекстовыйДокумент - Содержит параметры обработчиков.
//
Функция ПолучитьОбработчикиПКПД(МакетПараметров, ОбщиеПеременные, Отбор = Неопределено)
	
	Перем СтрокаВыборкаКолонок, СтрокаОграничений;
	
	МассивКолонок = МассивИменОбработчиков("ПравилаКонвертацииПредопределенныхДанных", ОбщиеПеременные);
	
	Если МассивКолонок.Количество() <> 0 Тогда
		
		СоздатьПараметрыТекстаДляЗапроса("ПКПД", МассивКолонок, СтрокаВыборкаКолонок, СтрокаОграничений, ОбщиеПеременные);
		
		НачатьТранзакцию();
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ПКПД.Ссылка,
		|	ПКПД.Код КАК Код
		|	[СтрокаВыборкаКолонок]
		|ИЗ
		|	Справочник.ПравилаКонвертацииПредопределенныхДанных КАК ПКПД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = ПКПД.Ссылка
		|ГДЕ
		|	Состав.Владелец = &Конвертация
		|	И НЕ ПКПД.ПометкаУдаления
		|	И НЕ Состав.ПометкаУдаления
		|	И [УсловиеОтбора]
		|	[СтрокаОграничений]
		|УПОРЯДОЧИТЬ ПО Код"; 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаВыборкаКолонок]", СтрокаВыборкаКолонок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаОграничений]", СтрокаОграничений);
		
		Если Отбор = Неопределено Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "Истина");
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "ПКПД.Ссылка = &Отбор");
			Запрос.УстановитьПараметр("Отбор", Отбор);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТаблицаПКО = ТаблицаОбработчиков();
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Колонка Из МассивКолонок Цикл
				
				Если ОбщиеПеременные.ТолькоИспользуемые И Не ЗначениеЗаполнено(Выборка[Колонка]) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ИмяСобытия = Сред(Колонка, 9);
				ИмяПКО = "ПКПД_[ИмяПКО]_[ИмяСобытия]";
				ИмяПКО = СтрЗаменить(ИмяПКО, "[ИмяСобытия]", ИмяСобытия);
				ИмяПКО = СтрЗаменить(ИмяПКО, "[ИмяПКО]", СокрЛП(Выборка.Код));
				ИмяОбласти = "ПКО_[ИмяСобытия]";
				ИмяОбласти = СтрЗаменить(ИмяОбласти, "[ИмяСобытия]", ИмяСобытия);
				ТекущаяОбласть = МакетПараметров.ПолучитьОбласть(ИмяОбласти);
				ПараметрыОбработчика = ТекстПоОбластиБезНазванияОбласти(ТекущаяОбласть);
				
				СтрокаПравила = ТаблицаПКО.Добавить();
				СтрокаПравила.ИмяОбработчика = ИмяПКО;
				СтрокаПравила.ПараметрыОбработчика = ПараметрыОбработчика;
				СтрокаПравила.ТелоОбработчика = ТелоПроцедурыСТабуляцией(Выборка[Колонка]);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат ТаблицаПКО;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции



// Получает обработчики ПКС из ИБ.
//
// Параметры:
//	МакетПараметров - ТекстовыйДокумент - Содержит параметры обработчиков.
//
Функция ПолучитьОбработчикиПКС(МакетПараметров, ОбщиеПеременные, Отбор = Неопределено)
	
	Перем СтрокаВыборкаКолонок, СтрокаОграничений;
	
	МассивКолонок = МассивИменОбработчиков("ПравилаКонвертацииСвойств", ОбщиеПеременные);
	
	Если МассивКолонок.Количество() <> 0 Тогда
		
		СоздатьПараметрыТекстаДляЗапроса("ПКС", МассивКолонок, СтрокаВыборкаКолонок, СтрокаОграничений, ОбщиеПеременные);
		
		НачатьТранзакцию();
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ПКС.Ссылка,
		|	ПКС.Владелец.Код КАК ПКО,
		|	ПКС.Родитель КАК Родитель,
		|	ПКС.Родитель.СвойствоКонфигурации.Наименование КАК ИмяИсточникаРодителя,
		|	ПКС.Родитель.СвойствоКонфигурацииКорреспондента.Наименование КАК ИмяПриемникаРодителя,
		|	ПКС.СвойствоКонфигурации КАК Источник,
		|	ПКС.СвойствоКонфигурации.Наименование КАК ИмяИсточника,
		|	ПКС.СвойствоКонфигурацииКорреспондента КАК Приемник,
		|	ПКС.СвойствоКонфигурацииКорреспондента.Наименование КАК ИмяПриемника,
		|	ПКС.ИмяПараметраДляПередачи КАК ИмяПараметраДляПередачи,
		|	ПКС.Код КАК Код
		|	[СтрокаВыборкаКолонок]
		|ИЗ
		|	Справочник.ПравилаКонвертацииСвойств КАК ПКС
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = ПКС.Владелец

		|ГДЕ
		|	Состав.Владелец = &Конвертация
		|	И НЕ ПКС.ПометкаУдаления
		|	И НЕ Состав.ПометкаУдаления
		|	И НЕ ПКС.Отключить
		|	И НЕ ПКС.ЭтоГруппа
		|	И [УсловиеОтбора]
		|	[СтрокаОграничений]
		|УПОРЯДОЧИТЬ ПО ПКО";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаВыборкаКолонок]", СтрокаВыборкаКолонок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаОграничений]", СтрокаОграничений);
		
		Если Отбор = Неопределено Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "Истина");
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "ПКС.Ссылка = &Отбор");
			Запрос.УстановитьПараметр("Отбор", Отбор);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТаблицаПКС = ТаблицаОбработчиков();
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Колонка Из МассивКолонок Цикл
				
				Если ОбщиеПеременные.ТолькоИспользуемые И Не ЗначениеЗаполнено(Выборка[Колонка]) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
					
					Если ЗначениеЗаполнено(Выборка.ИмяИсточникаРодителя) Тогда
						
						Родитель = "_" + СокрЛП(Выборка.ИмяИсточникаРодителя);
						
					Иначе
						
						Родитель = "_" + СокрЛП(Выборка.ИмяПриемникаРодителя);
						
					КонецЕсли;
					
				Иначе
					
					Родитель = "";
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.Источник) Тогда
					
					Свойство = "_" + СокрЛП(Выборка.ИмяИсточника);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.Приемник) Тогда
					
					Свойство = "_" + СокрЛП(Выборка.ИмяПриемника);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.ИмяПараметраДляПередачи) Тогда
					
					Свойство = "_" + СокрЛП(Выборка.ИмяПараметраДляПередачи);
					
				КонецЕсли;
				
				ИмяСобытия = Сред(Колонка, 9);
				ПКО = СокрЛП(Выборка.ПКО);
				ИмяПКС = "ПКС_[ИмяПКО]_[ИмяТЧ]_[Свойство]_[ИмяСобытия]_[КодПКС]_[ДлинаИмениПКО]";
				ИмяПКС = СтрЗаменить(ИмяПКС, "[ИмяПКО]", ПКО);
				ИмяПКС = СтрЗаменить(ИмяПКС, "_[ИмяТЧ]", Родитель);
				ИмяПКС = СтрЗаменить(ИмяПКС, "_[Свойство]", Свойство);
				ИмяПКС = СтрЗаменить(ИмяПКС, "[ИмяСобытия]", ИмяСобытия);
				ИмяПКС = СтрЗаменить(ИмяПКС, "[КодПКС]", Формат(Выборка.Код, "ЧГ=0"));
				ИмяПКС = СтрЗаменить(ИмяПКС, "[ДлинаИмениПКО]", СтрДлина(ПКО));
				
				ИмяОбласти = "ПКС_[ИмяСобытия]";
				ИмяОбласти = СтрЗаменить(ИмяОбласти, "[ИмяСобытия]", ИмяСобытия);
				ТекущаяОбласть = МакетПараметров.ПолучитьОбласть(ИмяОбласти);
				ПараметрыОбработчика = ТекстПоОбластиБезНазванияОбласти(ТекущаяОбласть);
				
				СтрокаПравила = ТаблицаПКС.Добавить();
				СтрокаПравила.ИмяОбработчика = ИмяПКС;
				СтрокаПравила.ПараметрыОбработчика = ПараметрыОбработчика;
				СтрокаПравила.ТелоОбработчика = ТелоПроцедурыСТабуляцией(Выборка[Колонка]);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат ТаблицаПКС;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает обработчики ПКГС из ИБ.
//
// Параметры:
//	МакетПараметров - ТекстовыйДокумент - Содержит параметры обработчиков.
//
Функция ПолучитьОбработчикиПКГС(МакетПараметров, ОбщиеПеременные, Отбор = Неопределено)
	
	Перем СтрокаВыборкаКолонок, СтрокаОграничений;
	
	МассивКолонок = МассивИменОбработчиков("ПравилаКонвертацииГруппыСвойств", ОбщиеПеременные);
	
	Если МассивКолонок.Количество() <> 0 Тогда
		
		СоздатьПараметрыТекстаДляЗапроса("ПКГС", МассивКолонок, СтрокаВыборкаКолонок, СтрокаОграничений, ОбщиеПеременные);
		
		НачатьТранзакцию();
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ПКГС.Ссылка,
		|	ПКГС.Владелец.Код КАК ПКО,
		|	ПКГС.Код КАК Код,
		|	ПКГС.СвойствоКонфигурации КАК Источник,
		|	ПКГС.СвойствоКонфигурации.Наименование КАК ИмяИсточника,
		|	ПКГС.СвойствоКонфигурацииКорреспондента КАК Приемник,
		|	ПКГС.СвойствоКонфигурацииКорреспондента.Наименование КАК ИмяПриемника
		|	[СтрокаВыборкаКолонок]
		|ИЗ
		|	Справочник.ПравилаКонвертацииСвойств КАК ПКГС
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = ПКГС.Владелец
		|ГДЕ
		|	Состав.Владелец = &Конвертация
		|	И НЕ ПКГС.ПометкаУдаления
		|	И НЕ ПКГС.Отключить
		|	И ПКГС.ЭтоГруппа
		|	И НЕ Состав.ПометкаУдаления
		|	И [УсловиеОтбора]
		|	[СтрокаОграничений]
		|УПОРЯДОЧИТЬ ПО ПКО";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаВыборкаКолонок]", СтрокаВыборкаКолонок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаОграничений]", СтрокаОграничений);
		
		Если Отбор = Неопределено Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "Истина");
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "ПКГС.Ссылка = &Отбор");
			Запрос.УстановитьПараметр("Отбор", Отбор);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТаблицаПКГС = ТаблицаОбработчиков();
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Колонка Из МассивКолонок Цикл
				Если ОбщиеПеременные.ТолькоИспользуемые И Не ЗначениеЗаполнено(Выборка[Колонка]) Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.Источник) Тогда
					
					Свойство = "_" + СокрЛП(Выборка.ИмяИсточника);
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.Приемник) Тогда
					
					Свойство = "_" + СокрЛП(Выборка.ИмяПриемника);
					
				КонецЕсли;
				
				ИмяСобытия = Сред(Колонка, 9);
				ПКО = СокрЛП(Выборка.ПКО);
				ИмяПКГС = "ПКГС_[ИмяПКО]_[ИмяТЧ]_[ИмяСобытия]_[КодПКГС]_[ДлинаИмениПКО]";
				ИмяПКГС = СтрЗаменить(ИмяПКГС, "[ИмяПКО]", ПКО);
				ИмяПКГС = СтрЗаменить(ИмяПКГС, "_[ИмяТЧ]", Свойство);
				ИмяПКГС = СтрЗаменить(ИмяПКГС, "[ИмяСобытия]", ИмяСобытия);
				ИмяПКГС = СтрЗаменить(ИмяПКГС, "[КодПКГС]", Выборка.Код);
				ИмяПКГС = СтрЗаменить(ИмяПКГС, "[ДлинаИмениПКО]", СтрДлина(ПКО));
				
				ИмяОбласти = "ПКГС_[ИмяСобытия]";
				ИмяОбласти = СтрЗаменить(ИмяОбласти, "[ИмяСобытия]", ИмяСобытия);
				ТекущаяОбласть = МакетПараметров.ПолучитьОбласть(ИмяОбласти);
				ПараметрыОбработчика = ТекстПоОбластиБезНазванияОбласти(ТекущаяОбласть);
				
				СтрокаПравила = ТаблицаПКГС.Добавить();
				СтрокаПравила.ИмяОбработчика = ИмяПКГС;
				СтрокаПравила.ПараметрыОбработчика = ПараметрыОбработчика;
				СтрокаПравила.ТелоОбработчика = ТелоПроцедурыСТабуляцией(Выборка[Колонка]);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат ТаблицаПКГС;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает обработчики ПВД из ИБ.
//
// Параметры:
//	МакетПараметров - ТекстовыйДокумент - Содержит параметры обработчиков.
//
Функция ПолучитьОбработчикиПВД(МакетПараметров, ОбщиеПеременные, Отбор = Неопределено)
	
	Перем СтрокаВыборкаКолонок, СтрокаОграничений;
	
	МассивКолонок = МассивИменОбработчиков("ПравилаВыгрузкиДанных", ОбщиеПеременные);
	
	Если МассивКолонок.Количество() <> 0 Тогда
		
		СоздатьПараметрыТекстаДляЗапроса("ПВД", МассивКолонок, СтрокаВыборкаКолонок, СтрокаОграничений, ОбщиеПеременные);
		
		НачатьТранзакцию();
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	ПВД.Наименование КАК Код
		|	[СтрокаВыборкаКолонок]
		|ИЗ
		|	Справочник.ПравилаОбработкиДанных КАК ПВД
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = ПВД.Ссылка
		|ГДЕ
		|	Состав.Владелец = &Конвертация
		|	И НЕ ПВД.ПометкаУдаления
		|	И НЕ Состав.ПометкаУдаления
		|	И НЕ ПВД.Отключить
		|	И [УсловиеОтбора]
		|	[СтрокаОграничений]
		|УПОРЯДОЧИТЬ ПО Код";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаВыборкаКолонок]", СтрокаВыборкаКолонок);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "[СтрокаОграничений]", СтрокаОграничений);
		
		Если Отбор = Неопределено Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "Истина");
			
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбора]", "ПВД.Ссылка = &Отбор");
			Запрос.УстановитьПараметр("Отбор", Отбор);
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТаблицаПВД = ТаблицаОбработчиков();
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Колонка Из МассивКолонок Цикл
				
				Если ОбщиеПеременные.ТолькоИспользуемые И Не ЗначениеЗаполнено(Выборка[Колонка]) Тогда
					
					Продолжить;
					
				КонецЕсли;

				ИмяСобытия = Сред(Колонка, 9);
				ИмяПВД = "ПВД_[ИмяПВД]_[ИмяСобытия]";
				ИмяПВД = СтрЗаменить(ИмяПВД, "[ИмяСобытия]", ИмяСобытия);
				ИмяПВД = СтрЗаменить(ИмяПВД, "[ИмяПВД]", СокрЛП(Выборка.Код));
				ИмяОбласти = "ПВД_[ИмяСобытия]";
				ИмяОбласти = СтрЗаменить(ИмяОбласти, "[ИмяСобытия]", ИмяСобытия);
				ТекущаяОбласть = МакетПараметров.ПолучитьОбласть(ИмяОбласти);
				ПараметрыОбработчика = ТекстПоОбластиБезНазванияОбласти(ТекущаяОбласть);
				
				СтрокаПравила = ТаблицаПВД.Добавить();
				СтрокаПравила.ИмяОбработчика = ИмяПВД;
				СтрокаПравила.ПараметрыОбработчика = ПараметрыОбработчика;
				СтрокаПравила.ТелоОбработчика = ТелоПроцедурыСТабуляцией(Выборка[Колонка]);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат ТаблицаПВД;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает обработчики алгоритмов из ИБ.
//
Функция ПолучитьОбработчикиАлгоритмы(ОбщиеПеременные)
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Алгоритмы.Код, 
	|	Алгоритмы.Алгоритм, 
	|	Алгоритмы.Параметры
	|ИЗ
	|	Справочник.Алгоритмы КАК Алгоритмы
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.ЭлементКонвертации = Алгоритмы.Ссылка	
	|ГДЕ
	|	Состав.Владелец = &Конвертация
	|	И НЕ Состав.ПометкаУдаления
	|	И Алгоритмы.ИспользуетсяПриЗагрузке = &ИспользуетсяПриЗагрузке
	|	И НЕ Алгоритмы.ПометкаУдаления";
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Запрос.УстановитьПараметр("ИспользуетсяПриЗагрузке", НЕ ОбщиеПеременные.ЭтоВыгрузка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		ТаблицаПараметров = ТаблицаОбработчиков();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаПравила = ТаблицаПараметров.Добавить();
			СтрокаПравила.ИмяОбработчика = СокрЛП(Выборка.Код);
			СтрокаПравила.ПараметрыОбработчика = СокрЛП(Выборка.Параметры);
			СтрокаПравила.ТелоОбработчика = ТелоПроцедурыСТабуляцией(Выборка.Алгоритм);
			
		КонецЦикла;
		
		Возврат ТаблицаПараметров;
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Неопределено;
	
КонецФункции

// Выводит обработчики в текстовый документ.
// 
// Параметры:
//	Обработчики - ТаблицаЗначений - Содержит обработчики.
//	Отладочный модуль - ТекстовыйДокумент - Для вывода обработчиков.
//
Процедура ЗаписатьОбработчики(Обработчики, ОтладочныйМодуль)
	
	Если Обработчики = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПравила Из Обработчики Цикл
		
		ИнтерфейсПроцедуры = "Процедура [ИмяПроцедуры]([ПараметрыПроцедуры]) Экспорт";
		ИнтерфейсПроцедуры = СтрЗаменить(ИнтерфейсПроцедуры, "[ИмяПроцедуры]", СтрокаПравила.ИмяОбработчика);
		ИнтерфейсПроцедуры = СтрЗаменить(ИнтерфейсПроцедуры, "[ПараметрыПроцедуры]", СтрокаПравила.ПараметрыОбработчика);
		
		ОтладочныйМодуль.ДобавитьСтроку(ИнтерфейсПроцедуры + Символы.ПС);
		ОтладочныйМодуль.ДобавитьСтроку(СтрокаПравила.ТелоОбработчика);
		ОтладочныйМодуль.ДобавитьСтроку(Символы.ПС + "КонецПроцедуры" + Символы.ПС);

	КонецЦикла;
	
КонецПроцедуры

// Инициализирует таблицу для обработчиков.
//
Функция ТаблицаОбработчиков()
	
	ТаблицаПравил = Новый ТаблицаЗначений;
	ТаблицаПравил.Колонки.Добавить("ИмяОбработчика");
	ТаблицаПравил.Колонки.Добавить("ПараметрыОбработчика");
	ТаблицаПравил.Колонки.Добавить("ТелоОбработчика");
	
	Возврат ТаблицаПравил;
	
КонецФункции

// Формирует параметры для запроса.
//
Процедура СоздатьПараметрыТекстаДляЗапроса(ИмяТаблицыЗапроса, МассивКолонок, СтрокаВыборкаКолонок, СтрокаОграничений, ОбщиеПеременные)
	
	СтрокаВыборкаКолонок = "";
	СтрокаОграничений = "";
	
	Для Каждого Колонка Из МассивКолонок Цикл
		
		СтрокаВыборкаКолонок = СтрокаВыборкаКолонок + ", 
		|" + ИмяТаблицыЗапроса + "." + Колонка;
		
		Если ОбщиеПеременные.ТолькоИспользуемые Тогда
			
			Если ПустаяСтрока(СтрокаОграничений) Тогда
				
				СтрокаОграничений = СтрокаОграничений + "
				| И ( (ВЫРАЗИТЬ(" + ИмяТаблицыЗапроса + "." + Колонка + " КАК СТРОКА(500))) <> """" ";
				
			Иначе
				
				СтрокаОграничений = СтрокаОграничений + "
				|ИЛИ (ВЫРАЗИТЬ(" + ИмяТаблицыЗапроса + "." + Колонка + " КАК СТРОКА(500))) <> """" ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(СтрокаОграничений) Тогда
		
		СтрокаОграничений = СтрокаОграничений + ")";
		
	КонецЕсли;
	
КонецПроцедуры

// Получает текст области без ее названия.
//
// Параметры:
//	Область - ОбластьМакета
//
Функция ТекстПоОбластиБезНазванияОбласти(Область)
	
	ТекстОбласти = Область.ПолучитьТекст();
	
	Если Найти(ТекстОбласти, "#Область") > 0 Тогда
		
		ПервыйПереводСтроки = Найти(ТекстОбласти, Символы.ПС);
		
		ТекстОбласти = Сред(ТекстОбласти, ПервыйПереводСтроки + 1);
		
	КонецЕсли;
	
	Возврат СокрЛП(ТекстОбласти);
	
КонецФункции

// Возвращает список обработчиков по типу объекта.
//
// Параметры:
//	НазваниеОбъекта - Строка - Тип объекта.
//
Функция МассивИменОбработчиков(НазваниеОбъекта, ОбщиеПеременные)
	
	МассивОбработчиков = Новый Массив();
	
	Если НазваниеОбъекта = "Конвертация" Тогда
		
		Если ОбщиеПеременные.ЭтоВыгрузка Тогда
			
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиПравилОбмена");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойДанных");
			МассивОбработчиков.Добавить("АлгоритмПередПолучениемИзмененныхОбъектов");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиДанных");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПередКонвертациейОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПередОтправкойИнформацииОбУдалении");
			
		Иначе
			
			МассивОбработчиков.Добавить("АлгоритмПередЗагрузкойДанных");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиДанных");
			МассивОбработчиков.Добавить("АлгоритмПередЗагрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПриПолученииИнформацииОбУдалении");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиПараметров");
			МассивОбработчиков.Добавить("АлгоритмПослеПолученияИнформацииОбУзлахОбмена");
			
		КонецЕсли;
		
	ИначеЕсли НазваниеОбъекта = "ПравилаКонвертацииГруппыСвойств" Тогда
		
		Если ОбщиеПеременные.ЭтоВыгрузка Тогда
			
			МассивОбработчиков.Добавить("АлгоритмПередОбработкойВыгрузки");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойСвойства");
			МассивОбработчиков.Добавить("АлгоритмПриВыгрузкеСвойства");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиСвойства");
			МассивОбработчиков.Добавить("АлгоритмПослеОбработкиВыгрузки");
			
		КонецЕсли;
		
	ИначеЕсли НазваниеОбъекта = "ПравилаКонвертацииСвойств" Тогда
		
		Если ОбщиеПеременные.ЭтоВыгрузка Тогда
			
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойСвойства");
			МассивОбработчиков.Добавить("АлгоритмПриВыгрузкеСвойства");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиСвойства");
			
		КонецЕсли;
		
	ИначеЕсли НазваниеОбъекта = "ПравилаВыгрузкиДанных" Тогда
		
		Если ОбщиеПеременные.ЭтоВыгрузка Тогда
			
			МассивОбработчиков.Добавить("АлгоритмПередОбработкойПравила");
			МассивОбработчиков.Добавить("АлгоритмПослеОбработкиПравила");
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъекта");
			
		КонецЕсли
		
	ИначеЕсли НазваниеОбъекта = "ПравилаКонвертацииОбъектов"
		Или НазваниеОбъекта = "ПравилаКонвертацииПредопределенныхДанных" Тогда
		
		Если ОбщиеПеременные.ЭтоВыгрузка Тогда
			
			МассивОбработчиков.Добавить("АлгоритмПередВыгрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПриВыгрузкеОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеВыгрузкиОбъектаВФайлОбмена");
			
		Иначе
			
			МассивОбработчиков.Добавить("АлгоритмПередЗагрузкойОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПриЗагрузкеОбъекта");
			МассивОбработчиков.Добавить("АлгоритмПослеЗагрузкиОбъекта");
			Если НазваниеОбъекта = "ПравилаКонвертацииОбъектов" Тогда
				МассивОбработчиков.Добавить("АлгоритмПоследовательностьПолейПоиска");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивОбработчиков;
	
КонецФункции

// Формирует строку информации для шапки модуля.
//
Функция СтрокаИнформацииМодуля(ОбщиеПеременные)
	
	ТекстСобытия = "Обработчики [ТипСобытия] конвертации [Конвертация] {[УИД]}";	
	ТекстСобытия = СтрЗаменить(ТекстСобытия, "[ТипСобытия]", ?(ОбщиеПеременные.ЭтоВыгрузка, "выгрузки", "загрузки"));
	ТекстСобытия = СтрЗаменить(ТекстСобытия, "[Конвертация]", ОбщиеПеременные.Конвертация.Наименование);
	ТекстСобытия = СтрЗаменить(ТекстСобытия, "[УИД]", ОбщиеПеременные.Конвертация.УникальныйИдентификатор());
	
	Возврат ТекстСобытия;
	
КонецФункции

// Выводит область макета.
//
Процедура ВывестиОбластьМакета(Макет, ИмяОбласти, Документ)
	
	ТекущаяОбласть = Макет.ПолучитьОбласть(ИмяОбласти);
	ОбластьИзМакета = ТекстПоОбластиБезНазванияОбласти(ТекущаяОбласть);
	Документ.ДобавитьСтроку(ОбластьИзМакета + Символы.ПС);
	
КонецПроцедуры

// Добавляет символы табуляции в тело процедуры.
//
Функция ТелоПроцедурыСТабуляцией (ТекстПроцедуры)
	
	ТекстСТабуляцией = Символы.Таб + СтрЗаменить(ТекстПроцедуры, Символы.ПС, Символы.ПС + Символы.Таб);
	
	Возврат ТекстСТабуляцией;
	
КонецФункции

// Заменяет вызов алгоритмов из структуры вызовом процедуры.
//
Функция ИзмененныйВызовАлгоритмов(ТаблицаАлгоритмов, Документ)
	ТекстПоискаИЗамены = Документ.ПолучитьТекст();
	
	Если ТаблицаАлгоритмов <> Неопределено Тогда		
		
		Для Каждого Алгоритм Из ТаблицаАлгоритмов Цикл
			
			СтрокаПоиска = "Выполнить(Алгоритмы.[ИмяАлгоритма])";
			СтрокаПоиска = СтрЗаменить(СтрокаПоиска, "[ИмяАлгоритма]", Алгоритм.ИмяОбработчика);
			СтрокаЗамены = "[ИмяАлгоритма] ([ПараметрыАлгоритма])";
			СтрокаЗамены = СтрЗаменить(СтрокаЗамены, "[ИмяАлгоритма]", Алгоритм.ИмяОбработчика);
			СтрокаЗамены = СтрЗаменить(СтрокаЗамены, "[ПараметрыАлгоритма]", Алгоритм.ПараметрыОбработчика);
			
			ТекстПоискаИЗамены = СтрЗаменить(ТекстПоискаИЗамены, СтрокаПоиска, СтрокаЗамены);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТекстПоискаИЗамены;
	
КонецФункции


// Загружает интерфейсы обработчиков из текстового документа.
//
// Параметры:
//	ТекстМодуляДокумент - ТекстовыйДокумент - Текстовый документ содержащий модуль обработки
//	СписокТиповыхПроцедур - Массив - Результат загрузки обработчиков
//	АнализФункций - Булево - Признак необходимости анализа функция
//
Процедура ПрочитатьОбработчики(ТекстМодуляДокумент, СписокТиповыхПроцедур, АнализФункций = Истина)
	
	ТекстМодуля = ТекстМодуляДокумент.ПолучитьТекст();
	КоличествоСимволов = 0;
	Если АнализФункций Тогда
		НачалоПоиска = "ФУНКЦИЯ";
		КонецПоиска = "КОНЕЦФУНКЦИИ";
	Иначе
		НачалоПоиска = "ПРОЦЕДУРА";
		КонецПоиска = "КОНЕЦПРОЦЕДУРЫ";
	КонецЕсли;
	Для НомерСтроки = 1 По ТекстМодуляДокумент.КоличествоСтрок() Цикл
		
		СтрокаДляАнализа = ТекстМодуляДокумент.ПолучитьСтроку(НомерСтроки);
		ДлинаСтроки = СтрДлина(СтрокаДляАнализа) + 1;
		СтрокаДляАнализа = СокрЛП(СтрокаДляАнализа);
		
		Если Лев(СтрокаДляАнализа, 2) = "//" Тогда
			
			КоличествоСимволов = КоличествоСимволов + ДлинаСтроки;
			
			Продолжить;
			
		Иначе
			
			СимволНачалаПроцедуры = Найти(ВРег(СтрокаДляАнализа), НачалоПоиска);
			
			Если СимволНачалаПроцедуры = 1 Тогда
				
				ПроцедураНачало = СимволНачалаПроцедуры + КоличествоСимволов + СтрДлина(НачалоПоиска) + 1;
				
			КонецЕсли;
			
			СимволОкончанияПроцедуры = Найти(ВРег(СтрокаДляАнализа), КонецПоиска);
			
			Если СимволОкончанияПроцедуры <> 0 И ПроцедураНачало <> 0 Тогда
				
				ПроцедураОкончание = СимволОкончанияПроцедуры + КоличествоСимволов - 1;
				ТелоПроцедурыСПараметрами = Сред(ТекстМодуля, ПроцедураНачало, ПроцедураОкончание - ПроцедураНачало + 1);
				ЗагрузитьКодОбработчика(ТелоПроцедурыСПараметрами, СписокТиповыхПроцедур);
				
			КонецЕсли;
			
		КонецЕсли;
		
		КоличествоСимволов = КоличествоСимволов + ДлинаСтроки;
		
	КонецЦикла;
	
КонецПроцедуры
// Разбирает текст процедуры на заголовок, параметры и тело процедуры.
//
// Параметры:
//  ТекстПроцедуры - Строка - Полный текст процедуры
//
Процедура ЗагрузитьКодОбработчика(ТекстПроцедуры, СписокТиповыхПроцедур)
	
	ОкончаниеПараметров = Найти(ТекстПроцедуры, ")");
	ТелоПроцедуры = СокрЛП(Сред(ТекстПроцедуры, ОкончаниеПараметров + 1));
	
	НачалоПараметров = Найти(ТекстПроцедуры, "(");
	ЗаголовокПроцедуры = СокрЛП(Лев(ТекстПроцедуры, НачалоПараметров - 1));
	ПараметрыПроцедуры = СокрЛП(Сред(ТекстПроцедуры, НачалоПараметров + 1, ОкончаниеПараметров-НачалоПараметров - 1));
	
	Если Найти(ТелоПроцедуры, "Экспорт") = 1 Тогда
		
		ТелоПроцедуры = СокрЛП(Сред(ТелоПроцедуры, 8));
		
	КонецЕсли;
	
	МассивЗаголовка = МассивИмениОбработчика(ЗаголовокПроцедуры);
	
		
	ПараметрыТиповойПроцедуры = СтрЗаменить(ПараметрыПроцедуры, Символы.ПС, "");
	ПараметрыТиповойПроцедуры = СтрЗаменить(ПараметрыТиповойПроцедуры, Символы.Таб, "");
	СписокТиповыхПроцедур.Добавить(ЗаголовокПроцедуры + "(" + ПараметрыТиповойПроцедуры + ")");
		
	
КонецПроцедуры

// Разбирает строку в массив подстрок в зависимости от типа правила.
//
Функция МассивИмениОбработчика(Строка, Разделитель = "_")
	
	Стр = Строка;
	МассивСтрок = Новый Массив();
	ДлинаРазделителя = СтрДлина(Разделитель);
	
	Пока Истина Цикл
		
		Поз = Найти(Стр, Разделитель);
		
		Если Поз = 0 Тогда
			
			МассивСтрок.Добавить(Стр);
			Прервать;
			
		КонецЕсли;
		
		МассивСтрок.Добавить(Лев(Стр, Поз - 1));
		Стр = Сред(Стр, Поз + ДлинаРазделителя);
		
	КонецЦикла;
	
	РазмерМассива = МассивСтрок.Количество();
	
	Если МассивСтрок[0] = "ПКС" Тогда
		МассивСтрок[1] = Сред(Строка, 5, МассивСтрок[РазмерМассива - 1]);
		
		Для ИндексМассива = 2 По РазмерМассива - 4 Цикл
			МассивСтрок.Удалить(2);
		КонецЦикла;
		
		МассивСтрок.Удалить(МассивСтрок.Количество() - 1);
		
	ИначеЕсли МассивСтрок[0] = "ПВД" Или МассивСтрок[0] = "Параметры" Или МассивСтрок[0] = "ПКО" Или МассивСтрок[0] = "ПОД" Тогда
		
		ИмяПроцедуры = "";
		
		Для ИндексМассива = 1 По МассивСтрок.Количество() - 2 Цикл
			
			ИмяПроцедуры = ИмяПроцедуры + МассивСтрок[ИндексМассива] + "_";
			
		КонецЦикла;
		
		МассивСтрок[1] = Лев(ИмяПроцедуры, СтрДлина(ИмяПроцедуры)-1);
		
		Для ИндексМассива = 2 По МассивСтрок.Количество() - 2 Цикл
			
			МассивСтрок.Удалить(2);
			
		КонецЦикла;
		
	ИначеЕсли МассивСтрок[0] = "ПКГС" Тогда
		
		МассивСтрок[1] = Сред(Строка, 6, МассивСтрок[РазмерМассива - 1]);
		
		Для ИндексМассива = 2 По РазмерМассива-4 Цикл
			
			МассивСтрок.Удалить(2);
			
		КонецЦикла;
		
		МассивСтрок.Удалить(МассивСтрок.Количество() - 1);
		
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции
#КонецОбласти
#КонецЕсли