#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
// Формирует запись о результате загрузки метаданных
// В начале загрузки формируется запись с датой начала без заполнения результата и способа загрузки
// В конец загрузки запись изменяется - добавляется дата окончания загрузки, результат загрузки и способ загрузки метаданных.
// Параметры: 
//		СтруктураПараметров - Структура - переменные которые используются при добавлении записи.
Процедура СформироватьЗаписьРезультатЗагрузкиМетаданных(СтруктураПараметров) Экспорт
	Релиз = СтруктураПараметров.Релиз;
	СостояниеНаборЗаписей = РегистрыСведений.СостоянияЗагрузокМетаданных.СоздатьНаборЗаписей();
	СостояниеНаборЗаписей.Отбор.Релиз.Установить(Релиз);
	Если СтруктураПараметров.Свойство("НачалоЗагрузки") Тогда
		ЗаписьСостояние = СостояниеНаборЗаписей.Добавить();
		ЗаписьСостояние.Релиз = Релиз;
		ЗаписьСостояние.ДатаНачала = ТекущаяДатаСеанса();
		СостояниеНаборЗаписей.Записать();
	Иначе
		СостояниеНаборЗаписей.Прочитать();
		Если СостояниеНаборЗаписей.Количество() = 0 Тогда
			ЗаписьСостояние = СостояниеНаборЗаписей.Добавить();
			ЗаписьСостояние.Релиз = Релиз;
		Иначе
			ЗаписьСостояние = СостояниеНаборЗаписей[0];
		КонецЕсли;
		ЗаписьСостояние.ДатаОкончания = ТекущаяДатаСеанса();
		ЗаписьСостояние.Результат = ?(СтруктураПараметров.Отказ, Перечисления.РезультатыВыполненияОбмена.Ошибка, Перечисления.РезультатыВыполненияОбмена.Выполнено);
		ЗаписьСостояние.СпособЗагрузки = СтруктураПараметров.СпособЗагрузки;
		СостояниеНаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

// Анализирует записи о результате загрузки метаданных
// Возвращает предыдущий способ загрузки метаданных
// Возвращаемое значение: 
//		СпособЗагрузки - Перечисления.СпособыЗагрузкиМетаданных.
Функция ПрочитатьПредыдущийСпособЗагрузкиМетаданных(Релиз) Экспорт
	СостояниеНаборЗаписей = РегистрыСведений.СостоянияЗагрузокМетаданных.СоздатьНаборЗаписей();
	СостояниеНаборЗаписей.Отбор.Релиз.Установить(Релиз);
	СостояниеНаборЗаписей.Прочитать();
	Если СостояниеНаборЗаписей.Количество() > 0 Тогда
		ЗаписьСостояние = СостояниеНаборЗаписей[0];
		Если ЗаписьСостояние.Результат = Перечисления.РезультатыВыполненияОбмена.Выполнено Тогда
			Возврат ЗаписьСостояние.СпособЗагрузки;
		КонецЕсли;
	КонецЕсли;
	Возврат Перечисления.СпособыЗагрузкиМетаданных.ПустаяСсылка();
КонецФункции
#КонецОбласти
#КонецЕсли