#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен объект. Возможно, правило не записано.'"));
		Возврат;
	КонецЕсли;
	ДопустимыеВидыОбработчиков = РегистрыСведений.КомментарииКОбработчикам.ДоступныеВидыОбработчиков(ТипЗнч(СсылкаНаОбъект));
	Если ДопустимыеВидыОбработчиков.Количество() = 0 Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для объекта не предусмотрены комментарии к обработчикам.'"));
		Возврат;
	КонецЕсли;  
	Для Каждого Вид Из ДопустимыеВидыОбработчиков Цикл
		Элементы.ВидОбработчика.СписокВыбора.Добавить(Вид);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы


&НаКлиенте
Процедура ВидОбработчикаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ВидОбработчика) Тогда
		ВидОбработчикаПриИзмененииНаСервере();
	Иначе
		Комментарий = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СохранитьКомментарий(Команда)
	Если НЕ ЗначениеЗаполнено(ВидОбработчика) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен вид обработчика.'"));
		Возврат;
	КонецЕсли;
	СохранитьКомментарийНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидОбработчикаПриИзмененииНаСервере()
	Комментарий = РегистрыСведений.КомментарииКОбработчикам.ПрочитатьКомментарийКОбработчику(СсылкаНаОбъект, ВидОбработчика);
КонецПроцедуры

&НаСервере
Процедура СохранитьКомментарийНаСервере()
	РегистрыСведений.КомментарииКОбработчикам.УстановитьКомментарийКОбработчику(СсылкаНаОбъект, ВидОбработчика, Комментарий);
КонецПроцедуры
#КонецОбласти