#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
    Ошибки = ВладелецФормы.Ошибки;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сохранить(Команда)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Фильтр = НСтр("ru = 'Текстовый документ'") + " (*.txt)|*.txt";   
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьСохранениеВФайл", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОписаниеОповещения, ДиалогВыбора);	

КонецПроцедуры
#КонецОбласти 
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПродолжитьСохранениеВФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	ТХДок = Новый ТекстовыйДокумент;
	ТХДок.ДобавитьСтроку(Ошибки);
	ТХДок.Записать(ПолноеИмяФайла,"UTF-8");
КонецПроцедуры

#КонецОбласти