#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВерсияФорматаОбменаПриИзменении(Элемент)
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Запись.ВерсияФорматаОбмена) Тогда
		Возврат;
	КонецЕсли;
	Отказ = ПроверитьКорректностьРасширение(Запись.ВерсияФорматаОбмена, Ложь);
	Если Отказ Тогда
		Запись.ВерсияФорматаОбмена = Неопределено;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выбрана версия формата, которая является расширением. Должна указываться базовая версия формата.'"));
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура РасширениеПриИзменении(Элемент)
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Запись.Расширение) Тогда
		Возврат;
	КонецЕсли;
	Отказ = ПроверитьКорректностьРасширение(Запись.Расширение, Истина);
	Если Отказ Тогда
		Запись.Расширение = Неопределено;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='В качестве расширения выбрана версия формата, которая не является расширением.'"));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПроверитьКорректностьРасширение(ВерсияФорматаСсылка, ИскомоеЗначениеРасширения)
	РасширениеВерсии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВерсияФорматаСсылка, "Расширение");
	Возврат (ИскомоеЗначениеРасширения <> РасширениеВерсии);
КонецФункции 

#КонецОбласти
