#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораПланаОбмена();
	// По умолчанию версия регистрации старая.
	Если Объект.НомерВерсии = 0 Тогда
		Объект.НомерВерсии = 1;
	КонецЕсли;
	ЕстьПРО = Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.ПравилаРегистрацииОбъектов
		|ГДЕ Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		ЕстьПРО = НЕ Запрос.Выполнить().Пустой();
	КонецЕсли;
	Элементы.Конфигурация.Доступность = НЕ ЕстьПРО;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаСервере
Процедура КонфигурацияПриИзмененииНаСервере()
	ПланОбмена = Справочники.Объекты.ПустаяСсылка();
	ЗаполнитьСписокВыбораПланаОбмена();
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияПриИзменении(Элемент)
	КонфигурацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПланОбменаПриИзмененииНаСервере()
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НомерВерсииПриИзменении(Элемент)
	Элементы.ДочерниеКонфигурации.Видимость = (Объект.НомерВерсии > 1);
КонецПроцедуры
&НаКлиенте
Процедура ПланОбменаПриИзменении(Элемент)
	ПланОбменаПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьПРО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Сначала необходимо записать регистрацию'"));
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("парРегистрация", Объект.Ссылка);
	ОткрытьФорму("Обработка.ЗагрузкаРегистрации.Форма.ФормаПомощникЗагрузки", ПараметрыФормы);
КонецПроцедуры
&НаКлиенте
Процедура ВыгрузитьПРО(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Сначала необходимо записать регистрацию'"));
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("парРегистрация", Объект.Ссылка);
	ОткрытьФорму("Обработка.ВыгрузкаРегистрации.Форма.Форма", ПараметрыФормы);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьСписокВыбораПланаОбмена()
	Если НЕ ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		Объект.ИмяПланаОбмена = "";
		Возврат;
	КонецЕсли;
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СправочникОбъекты.Имя  КАК ПланОбменаНаименование,
	|	СправочникОбъекты.Синоним КАК ПланОбменаСиноним
	|ИЗ
	|	Справочник.Объекты КАК СправочникОбъекты
	|ГДЕ
	|	  СправочникОбъекты.Тип      = &Тип
	|	И СправочникОбъекты.Владелец = &Конфигурация
	|УПОРЯДОЧИТЬ ПО
	|	СправочникОбъекты.Синоним
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Тип",          Перечисления.ТипыОбъектов.ПланОбмена);
	Запрос.УстановитьПараметр("Конфигурация", Объект.Конфигурация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.ИмяПланаОбмена.СписокВыбора.Очистить();
	Пока Выборка.Следующий() Цикл
		
		Элементы.ИмяПланаОбмена.СписокВыбора.Добавить(Выборка.ПланОбменаНаименование, Выборка.ПланОбменаСиноним);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименование()
	НаименованиеКонфигурации = СокрЛП(Строка(Объект.Конфигурация));
	
	Объект.Наименование = НаименованиеКонфигурации + ?(ПустаяСтрока(НаименованиеКонфигурации), "", ": ") + Объект.ИмяПланаОбмена; 
КонецПроцедуры

#КонецОбласти
