
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	ДанныеФильтра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, "ИмяПланаОбмена, Конфигурация");
	ИмяПланаОбмена = ДанныеФильтра.ИмяПланаОбмена;
	Конфигурация = ДанныеФильтра.Конфигурация;
	ПеречитатьТипОбъектаКонфигурации();
	
	ЗаполнитьСписокВыбораРеквизитаРежимаВыгрузки();
	ЗаполнитьТабличныеПоляОтбора(); 
	
	// Работа с тегами.
	ЕстьТеги = Ложь;
	ВыборкаТеги = Справочники.Теги.Выбрать(,Объект.Владелец);
	Если ВыборкаТеги.Следующий() Тогда
		ЕстьТеги = Истина;
		МассивПараметров = Новый Массив;
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", Объект.Владелец); 
		МассивПараметров.Добавить(ПараметрВыбора);
		Элементы.ТегиТег.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	КонецЕсли;
    Элементы.ГруппаТеги.Видимость = ЕстьТеги;
	
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Объект.Захвачен = Истина;
		ИначеЕсли Объект.Захвачен Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормы();
	КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Объект.Захвачен, СовместнаяРабота);
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(Элементы.СтраницыТекстОбработчиков, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОтборПоСвойствамПланаОбмена = РеквизитФормыВЗначение("ДеревоОтборПоСвойствамПланаОбмена",Тип("ДеревоЗначений")); 
	ОтборПоСвойствамОбъекта = РеквизитФормыВЗначение("ДеревоОтборПоСвойствамОбъекта",Тип("ДеревоЗначений"));
	ПроверитьЗаполнениеДерева(ОтборПоСвойствамПланаОбмена, "ДеревоОтборПоСвойствамПланаОбмена", 0, Отказ);   
	ПроверитьЗаполнениеДерева(ОтборПоСвойствамОбъекта, "ДеревоОтборПоСвойствамОбъекта", 0, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ТекущийОбъект.ОтборПоСвойствамПланаОбмена = Новый ХранилищеЗначения(ОтборПоСвойствамПланаОбмена);
	ТекущийОбъект.ОтборПоСвойствамОбъекта = Новый ХранилищеЗначения(ОтборПоСвойствамОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СовместнаяРабота И ИмяСобытия = "ИзмененСтатусЗахвата" И Источник = Объект.Ссылка Тогда
		Прочитать();
		ОбработкаОповещенияНаСервере();
		КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Параметр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОбъектНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("ТекущаяСтрока, РежимРаботы", 
					Объект.ОбъектНастройки, "ОбъектКонфигурации");
	ПараметрыФормыВыбора.Вставить("ДляПРО", Истина);
	ПараметрыФормыВыбора.Вставить("ПланОбмена", НСтр("ru='ПланОбменаСсылка.'") + ИмяПланаОбмена);
	ПараметрыФормыВыбора.Вставить("Конфигурация", Конфигурация);


	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбранОбъектКонфигурации", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(Элементы.СтраницыТекстОбработчиков, Объект);
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПакетнаяОбработкаРегистрацииПриИзменении(Элемент)
	ОбновитьИндикациюСтраницыПакетныйОбработчик();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ДеревоОтборПоСвойствамПланаОбменаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СтрокаРедактируется = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборПоСвойствамОбъектаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СтрокаРедактируется = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборПоСвойствамПланаОбменаПередНачаломИзменения(Элемент, Отказ)
	СтрокаРедактируется = Истина;
	ПередНачаломИзменения(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборПоСвойствамПланаОбменаПередУдалением(Элемент, Отказ)
	ПередУдалением(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборПоСвойствамОбъектаПередНачаломИзменения(Элемент, Отказ)
	СтрокаРедактируется = Истина;
	ПередНачаломИзменения(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборПоСвойствамОбъектаПередУдалением(Элемент, Отказ)
	ПередУдалением(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборПоСвойствамПланаОбменаПриАктивизацииЯчейки(Элемент)
	Если НЕ СтрокаРедактируется Тогда
		Возврат;
	КонецЕсли;
	ПередНачаломИзменения(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборПоСвойствамОбъектаПриАктивизацииЯчейки(Элемент)
	Если НЕ СтрокаРедактируется Тогда
		Возврат;
	КонецЕсли;
	ПередНачаломИзменения(Элемент, Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтборПланаОбменаДобавитьГруппу(Команда)
	ДобавитьСтрокуВТаблицуОтбора("ДеревоОтборПоСвойствамПланаОбмена", ДеревоОтборПоСвойствамПланаОбмена, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПланаОбменаДобавитьЗначение(Команда)
	ДобавитьСтрокуВТаблицуОтбора("ДеревоОтборПоСвойствамПланаОбмена", ДеревоОтборПоСвойствамПланаОбмена, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПланаОбменаДобавитьСвойство(Команда)
	ДобавитьСтрокуВТаблицуОтбора("ДеревоОтборПоСвойствамПланаОбмена", ДеревоОтборПоСвойствамПланаОбмена, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСвойстваОбъектаДобавитьГруппу(Команда)
	ДобавитьСтрокуВТаблицуОтбора("ДеревоОтборПоСвойствамОбъекта", ДеревоОтборПоСвойствамОбъекта, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСвойстваОбъектаДобавитьСвойство(Команда)
	ДобавитьСтрокуВТаблицуОтбора("ДеревоОтборПоСвойствамОбъекта", ДеревоОтборПоСвойствамОбъекта, Ложь, Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	ДоступностьОтборов = ЗначениеЗаполнено(ИмяПланаОбмена) И ЗначениеЗаполнено(Объект.ОбъектНастройки);
	Элементы.ДеревоОтборПоСвойствамПланаОбмена.Доступность = ДоступностьОтборов;
	Элементы.ДеревоОтборПоСвойствамОбъекта.Доступность = ДоступностьОтборов;  
	Элементы.СтраницаПакетныйОбработчик.Видимость = ЭтоСсылочныйТип;
	Если ЭтоСсылочныйТип Тогда
		ОбновитьИндикациюСтраницыПакетныйОбработчик();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокВыбораРеквизитаРежимаВыгрузки()
	
	СписокВыбора = Элементы.РеквизитРежимаВыгрузкиОбъектовОбмена.СписокВыбора;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвойстваТипы.Ссылка.Наименование   КАК Свойство
	|ИЗ
	|	Справочник.Свойства.Типы КАК СвойстваТипы
	|ГДЕ
	|	  СвойстваТипы.Ссылка.Владелец.Наименование  ПОДОБНО &ВладелецНаименование
	|	И СвойстваТипы.Ссылка.Владелец.Владелец = &Конфигурация
	|	И СвойстваТипы.Тип.Наименование = ""ПеречислениеСсылка.РежимыВыгрузкиОбъектовОбмена""
	|	И СвойстваТипы.Ссылка.Вид       = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.Реквизит)
	|УПОРЯДОЧИТЬ ПО
	|	СвойстваТипы.Ссылка.Наименование
	|";

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецНаименование", "%"+ИмяПланаОбмена);
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);

	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокВыбора.Добавить(Выборка.Свойство);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранОбъектКонфигурации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	Объект.ОбъектНастройки = РезультатЗакрытия.Ссылка;
	Объект.Наименование = РезультатЗакрытия.Наименование; 
	ПеречитатьТипОбъектаКонфигурации();
	УстановитьДоступностьЭлементовФормы();
	ТаблицаСвойствОбъектаНастройки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеВТаблицеФормы(Значение, ДополнительныеПараметры) Экспорт
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	ТипСвойства = "";
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		// Передано имя и тип свойства.
		ЗначениеКолонки = Значение.Имя;
		ТипСвойства = Значение.Тип;
	ИначеЕсли  ТипЗнч(Значение) = Тип("ЭлементСпискаЗначений") Тогда
		ЗначениеКолонки = Значение.Значение;
		ТипСвойства = ТипЗнч(Значение.Значение);
	Иначе
		ЗначениеКолонки = Значение;
		ТипСвойства = ТипЗнч(Значение);
	КонецЕсли;

	ДанныеСтроки[ДополнительныеПараметры.ИмяКолонки] = ЗначениеКолонки;
	Если ДополнительныеПараметры.ИмяКолонки = "СвойствоОбъекта"
		Или ДополнительныеПараметры.ИмяКолонки = "СвойствоПланаОбмена" Тогда
		ДанныеСтроки["ТипСвойстваОбъекта"] = ТипСвойства;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеКонстанты(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если РезультатЗакрытия.Свойство("ВидЭлементаОтбора") Тогда
		Элементы.ДеревоОтборПоСвойствамОбъекта.ТекущиеДанные.ВидЭлементаОтбора = РезультатЗакрытия.ВидЭлементаОтбора;
	КонецЕсли;
	Если РезультатЗакрытия.Свойство("ЗначениеКонстанты") Тогда
		Элементы.ДеревоОтборПоСвойствамОбъекта.ТекущиеДанные.ЗначениеКонстанты = РезультатЗакрытия.ЗначениеКонстанты;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВТаблицуОтбора(ИмяТабличногоПоля, ДеревоЗначений, ЭтоГруппа, ЭтоСтрокаКонстанты)
	
	// определяем родительскую строку для добавления новой строки
	
	// по умолчанию используем корневые строки
	СтрокиРодителя = ДеревоЗначений.ПолучитьЭлементы();
	
	// определяем текущие строки
	ТекущиеДанные = Элементы[ИмяТабличногоПоля].ТекущиеДанные;
	ИДРодителя = Неопределено;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ТекущиеДанные.ЭтоГруппа Тогда
			
			СтрокиРодителя = ТекущиеДанные.ПолучитьЭлементы(); // используем строки группы
			ИДРодителя = ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			
			Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда // используем корневые строки (см. выше)
				
				СтрокиРодителя = ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// добавляем новый элемент в дерево
	НоваяСтрока = СтрокиРодителя.Добавить();
	НоваяСтрока.ЭтоГруппа          = ЭтоГруппа;
	Если ИмяТабличногоПоля = "ДеревоОтборПоСвойствамПланаОбмена" Тогда
		НоваяСтрока.ЭтоСтрокаКонстанты = ЭтоСтрокаКонстанты;
	КонецЕсли;
	Если ТекущиеДанные <> Неопределено И ИДРодителя <> Неопределено Тогда
		// Развернуть группу в которую добавляется строка.
		Элементы[ИмяТабличногоПоля].Развернуть(ИДРодителя, Ложь);
	КонецЕсли;
	Если ЭтоГруппа Тогда
		// для групп устанавливаем булево значение группы
		НоваяСтрока.БулевоЗначениеГруппы = ПредопределенноеЗначение("Перечисление.БулевыОперации.И");
	Иначе
		ТекущаяКолонкаСтр = ?(ЭтоСтрокаКонстанты, "СвойствоПланаОбмена", "СвойствоОбъекта");
		
		Элемент = Новый Структура;
		Элемент.Вставить("Имя",            ИмяТабличногоПоля);
		Элемент.Вставить("ТекущиеДанные",  НоваяСтрока);
		Элемент.Вставить("ТекущаяКолонка", ТекущаяКолонкаСтр);

		ПередНачаломИзменения(Элемент, Ложь);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки = Неопределено;
	ИмяТекущейКолонки = "";
	Если ТипЗнч(Элемент) = Тип("Структура") Тогда
		Элемент.Свойство("ТекущаяКолонка", ИмяТекущейКолонки);
		ДанныеСтроки = Элемент.ТекущиеДанные;
	Иначе
		ИДСтроки = Элемент.ТекущиеДанные.ПолучитьИдентификатор();
		ИмяТекущейКолонки = Элемент.ТекущийЭлемент.Имя;
		Если Элемент.Имя = "ДеревоОтборПоСвойствамПланаОбмена" Тогда
			ЭлементыДерева = ДеревоОтборПоСвойствамПланаОбмена;
		Иначе
			ЭлементыДерева = ДеревоОтборПоСвойствамОбъекта;
		КонецЕсли;
		ДанныеСтроки = ЭлементыДерева.НайтиПоИдентификатору(ИДСтроки);
	КонецЕсли;
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ТекущиеДанные.БулевоЗначениеГруппы = ИнвертироватьБулевоЗначениеГруппы(ТекущиеДанные.БулевоЗначениеГруппы); 
		Отказ = Истина;
	ИначеЕсли ЭтоТекущаяКолонка(Элемент, "СвойствоОбъекта", ИмяТекущейКолонки) Тогда // для колонки "СвойствоОбъекта"
		ДопПараметры = Новый Структура("ИмяКолонки, ДанныеСтроки", "СвойствоОбъекта", ДанныеСтроки);
		ОповещениеОВыборе = Новый ОписаниеОповещения("УстановитьЗначениеВТаблицеФормы", ЭтотОбъект, ДопПараметры);
		Если Элемент.Имя = "ДеревоОтборПоСвойствамПланаОбмена" И ТекущиеДанные.ЭтоСтрокаКонстанты Тогда
			
			// выбираем значение константы
			Тип = ТекущиеДанные.ТипСвойстваОбъекта;
			ОписаниеТипа = ОписаниеПримитивногоТипаПоСтроке(Тип);
			Если ОписаниеТипа = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ПоказатьВводЗначения(ОповещениеОВыборе, ТекущиеДанные.СвойствоОбъекта,
					НСтр("ru='Укажите значение'"), ОписаниеТипа);
		Иначе
			Если ТаблицаСвойствОбъектаНастройки.Количество() = 0 Тогда
				ЗаполнитьТаблицуСвойствОбъектаНастройки();
			КонецЕсли;
			ПараметрыФормыВыбора = Новый Структура("ТекущаяСтрока, РежимРаботы, Конфигурация", 
				ТекущиеДанные.СвойствоОбъекта, "СвойствоКонфигурации", Конфигурация);
			ПараметрыФормыВыбора.Вставить("ДляПРО", Истина);
			ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", ТаблицаСвойствОбъектаНастройки);
			
			ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		КонецЕсли;
	
	ИначеЕсли ЭтоТекущаяКолонка(Элемент, "СвойствоПланаОбмена", ИмяТекущейКолонки) Тогда // для колонки "СвойствоПланаОбмена"
		Если ТаблицаСвойствПланаОбмена.Количество() = 0 Тогда
			ЗаполнитьТаблицуСвойствПланаОбмена();
		КонецЕсли;
		// открываем форму выбора свойства для Плана обмена
		ПараметрыФормыВыбора = Новый Структура("ТекущаяСтрока, РежимРаботы", 
			ТекущиеДанные.СвойствоПланаОбмена, "СвойствоКонфигурации");
		ПараметрыФормыВыбора.Вставить("ДляПРО", Истина);
		ПараметрыФормыВыбора.Вставить("ТаблицаСвойствКонфигурации", ТаблицаСвойствПланаОбмена);
		Если ТекущиеДанные.ЭтоСтрокаКонстанты Тогда
			ПараметрыФормыВыбора.Вставить("ОтборПоТипу", "ПростойТип");
		Иначе
			ПараметрыФормыВыбора.Вставить("ОтборПоТипу", ТекущиеДанные.ТипСвойстваОбъекта);
		КонецЕсли;
		ДопПараметры = Новый Структура("ИмяКолонки, ДанныеСтроки", "СвойствоПланаОбмена", ДанныеСтроки);
		ОповещениеОВыборе = Новый ОписаниеОповещения("УстановитьЗначениеВТаблицеФормы", ЭтотОбъект, ДопПараметры);

		ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ЭтоТекущаяКолонка(Элемент, "ЗначениеКонстанты", ИмяТекущейКолонки) Тогда // для колонки "ЗначениеКонстанты"
		ОповещениеОВыборе = Новый ОписаниеОповещения("УстановитьЗначениеКонстанты", ЭтотОбъект);
		
		ПараметрыФормыВыбора = Новый Структура("ВидЭлементаОтбора, ЗначениеКонстанты, ТипСвойстваОбъекта", 
						ТекущиеДанные.ВидЭлементаОтбора, ТекущиеДанные.ЗначениеКонстанты, ТекущиеДанные.ТипСвойстваОбъекта);
		ОткрытьФорму("Справочник.ПравилаРегистрацииОбъектов.Форма.ФормаВводаЗначенияКонстанты",
				ПараметрыФормыВыбора,Элемент,,,,
				ОповещениеОВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ЭтоТекущаяКолонка(Элемент, "ВидСравнения", ИмяТекущейКолонки) Тогда // для колонки "ВидСравнения"
		ДопПараметры = Новый Структура("ИмяКолонки, ДанныеСтроки", "ВидСравнения", ДанныеСтроки);
		ОповещениеОВыборе = Новый ОписаниеОповещения("УстановитьЗначениеВТаблицеФормы", ЭтотОбъект, ДопПараметры);
		
		// открываем список значений для выбора вида сравнения
		СписокВыбораВидСравнения = ВидыСравненияПоТипуДанных(ТекущиеДанные.ТипСвойстваОбъекта);
		ПоказатьВыборИзМеню(ОповещениеОВыборе, СписокВыбораВидСравнения, Элемент); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьСтрокуОтбора", ЭтотОбъект, Новый Структура("ИмяТабличногоПоля", Элемент.Имя));
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru='Удалить элемент отбора?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да); 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуОтбора(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ИДСтроки = Элементы[ДополнительныеПараметры.ИмяТабличногоПоля].ТекущиеДанные.ПолучитьИдентификатор();
	Если Элементы[ДополнительныеПараметры.ИмяТабличногоПоля].ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ИДРодителя = Неопределено;
	Иначе
		ИДРодителя = Элементы[ДополнительныеПараметры.ИмяТабличногоПоля].ТекущиеДанные.ПолучитьРодителя().ПолучитьИдентификатор();
	КонецЕсли;
	Если ДополнительныеПараметры.ИмяТабличногоПоля = "ДеревоОтборПоСвойствамПланаОбмена" Тогда
		УдаляемаяСтрока = ДеревоОтборПоСвойствамПланаОбмена.НайтиПоИдентификатору(ИДСтроки);
		Если ИДРодителя = Неопределено Тогда
			КоллекцияСтрок = ДеревоОтборПоСвойствамПланаОбмена.ПолучитьЭлементы();
		Иначе
			КоллекцияСтрок = ДеревоОтборПоСвойствамПланаОбмена.НайтиПоИдентификатору(ИДРодителя).ПолучитьЭлементы();
		КонецЕсли;
	Иначе
		УдаляемаяСтрока = ДеревоОтборПоСвойствамОбъекта.НайтиПоИдентификатору(ИДСтроки);
		Если ИДРодителя = Неопределено Тогда
			КоллекцияСтрок = ДеревоОтборПоСвойствамОбъекта.ПолучитьЭлементы();
		Иначе
			КоллекцияСтрок = ДеревоОтборПоСвойствамОбъекта.НайтиПоИдентификатору(ИДРодителя).ПолучитьЭлементы();
		КонецЕсли;
	КонецЕсли;
	КоллекцияСтрок.Удалить(УдаляемаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикациюСтраницыПакетныйОбработчик()
	Если ЗначениеЗаполнено(Объект.АлгоритмПакетнаяОбработкаРегистрации) Тогда
		Элементы.СтраницаПакетныйОбработчик.Картинка = БиблиотекаКартинок.Успешно;
	Иначе
		Элементы.СтраницаПакетныйОбработчик.Картинка = Новый Картинка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЭтоТекущаяКолонка(Элемент, ИмяКолонки, ПараметрИмяКолонки)
	Возврат СтрНайти(ПараметрИмяКолонки, ИмяКолонки) > 0;
КонецФункции


&НаСервереБезКонтекста
Функция ИнвертироватьБулевоЗначениеГруппы(ТекущееЗначениеГруппы)
	
	Возврат ?(ТекущееЗначениеГруппы = Перечисления.БулевыОперации.И,
										 Перечисления.БулевыОперации.ИЛИ,
										 Перечисления.БулевыОперации.И);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОписаниеПримитивногоТипаПоСтроке(Тип)
	Если СтрНайти(Тип, "Булево") > 0 Тогда
		Возврат Новый ОписаниеТипов("Булево");
	ИначеЕсли СтрНайти(Тип, "Строка") > 0 Тогда
		Возврат Новый ОписаниеТипов("Строка");
	ИначеЕсли СтрНайти(Тип, "Число") > 0 Тогда
		Возврат Новый ОписаниеТипов("Число");
	ИначеЕсли СтрНайти(Тип, "Дата") > 0 Тогда
		Возврат Новый ОписаниеТипов("Дата");
	КонецЕсли;
	// Не примитивный тип.
	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция ВидыСравненияПоТипуДанных(Тип)
	// возвращаемое значение функции 
	СписокВыбора = Новый СписокЗначений;
	
	Если СтрНайти(Тип, "Булево") > 0 Тогда // Булево
		
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.Равно);
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.НеРавно);
		
	ИначеЕсли СтрНайти(Тип, "Строка") > 0
		Или СтрНайти(Тип, "Число") > 0
		Или СтрНайти(Тип, "Дата") > 0 Тогда // Строка, Число
		
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.Равно);
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.НеРавно);
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.Больше);
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.БольшеИлиРавно);
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.Меньше);
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.МеньшеИлиРавно);
		
	Иначе //Любая ссылка
		
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.Равно);
		СписокВыбора.Добавить(Перечисления.ВидыСравнения.НеРавно);
		
	КонецЕсли;
	
	Возврат СписокВыбора;

КонецФункции 

&НаСервере
Процедура ЗаполнитьТаблицуСвойствОбъектаНастройки()
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСвойстваОбъекта();
	Запрос.УстановитьПараметр("ОбъектКонфигурации", Объект.ОбъектНастройки);
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрНов = ТаблицаСвойствОбъектаНастройки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНов, Выборка); 
	КонецЦикла;
	// Для ссылочного типа принудительно добавить свойство Ссылка.
	ТипОбъектаНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектНастройки, "Тип");
	Если ТипОбъектаНастройки = Перечисления.ТипыОбъектов.Документ
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.Справочник 
		Или ТипОбъектаНастройки = Перечисления.ТипыОбъектов.ПланВидовХарактеристик Тогда
		СтрНов = ТаблицаСвойствОбъектаНастройки.Добавить();
		СтрНов.Имя = "Ссылка";
		СтрНов.Тип = СокрЛП(Объект.ОбъектНастройки);
		ТаблицаСвойствОбъектаНастройки.Сортировать("Имя");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСвойствПланаОбмена()
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСвойстваОбъекта();
	ОбъектКонфигурацииСсылка = Справочники.Объекты.НайтиПоНаименованию(НСтр("ru='ПланОбменаСсылка.'") + ИмяПланаОбмена, Истина,,Конфигурация);
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурацииСсылка);
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрНов = ТаблицаСвойствПланаОбмена.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНов, Выборка);
	КонецЦикла;
	
	// Принудительное добавление свойства Ссылка (для отбора по ссылке на узел в отборах плана обмена).
	СтрНов = ТаблицаСвойствПланаОбмена.Добавить();
	СтрНов.Имя = "Ссылка";
	СтрНов.Тип = "ПланОбменаСсылка." + ИмяПланаОбмена;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаСвойстваОбъекта()
	Возврат "ВЫБРАТЬ
	|	Свойства.Родитель КАК Родитель,
	|	Свойства.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Свойства.ТипыСтрокой КАК СТРОКА(1000)) КАК ТипСтрокой,
	|	Максимум(ТипыСвойства.Тип.Наименование) КАК Тип,
	|	Количество(ТипыСвойства.НомерСтроки) КАК КоличествоТипов,
	|	Свойства.Владелец.Владелец КАК Конвертация
	|ПОМЕСТИТЬ ТаблицаСвойствРасширеннаяРазвернутая
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства.Типы КАК ТипыСвойства
	|	ПО ТипыСвойства.Ссылка = Свойства.Ссылка И ТипыСвойства.НомерСтроки = 1
	|ГДЕ
	|	Свойства.Владелец = &ОбъектКонфигурации
	|	И Свойства.Владелец.Владелец = &Конфигурация
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|	И (Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|		ИЛИ ЕстьNULL(Свойства.Родитель.Вид, """") = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ТабличнаяЧасть))
	|СГРУППИРОВАТЬ ПО Свойства.Ссылка
	|;
	|ВЫБРАТЬ
	|	Родитель,
	|	Наименование,
	|	ВЫБОР КОГДА КоличествоТипов = 1 Тогда
	|		Тип
	|	ИНАЧЕ
	|		ТипСтрокой
	|	КОНЕЦ КАК Тип,
	|	Конвертация
	|ПОМЕСТИТЬ ТаблицаСвойствРасширенная
	|ИЗ ТаблицаСвойствРасширеннаяРазвернутая 
	|;
	|ВЫБРАТЬ 
	|	ВЫБОР
	|		КОГДА Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|			ТОГДА Наименование
	|		ИНАЧЕ Родитель.Наименование + ""."" + Наименование
	|	КОНЕЦ КАК Имя,
	|	Максимум(Тип) КАК Тип
	|ИЗ ТаблицаСвойствРасширенная
	|СГРУППИРОВАТЬ ПО 
	|	ВЫБОР
	|		КОГДА Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|			ТОГДА Наименование
	|		ИНАЧЕ Родитель.Наименование + ""."" + Наименование
	|	КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	Имя";
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличныеПоляОтбора()
	ОтборПоСвойствамПланаОбменаРеквизит = Неопределено;
	ОтборПоСвойствамОбъектаРеквизит = Неопределено;
	ДеревоОтборПоСвойствамОбъекта.ПолучитьЭлементы().Очистить();
	ДеревоОтборПоСвойствамПланаОбмена.ПолучитьЭлементы().Очистить();
	Если ЗначениеЗаполнено(Объект.Ссылка)
		Или ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ИсточникСведений = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, ЗначениеКопирования);
		ЗначенияСвойствХранилище = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникСведений, "ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта");
		ОтборПоСвойствамПланаОбменаРеквизит = ЗначенияСвойствХранилище.ОтборПоСвойствамПланаОбмена.Получить();
		ОтборПоСвойствамОбъектаРеквизит = ЗначенияСвойствХранилище.ОтборПоСвойствамОбъекта.Получить();
		Если ТипЗнч(ОтборПоСвойствамПланаОбменаРеквизит) = Тип("ДеревоЗначений") Тогда
			ЗначениеВРеквизитФормы(ОтборПоСвойствамПланаОбменаРеквизит,"ДеревоОтборПоСвойствамПланаОбмена");
		КонецЕсли;
		Если ТипЗнч(ОтборПоСвойствамОбъектаРеквизит) = Тип("ДеревоЗначений") Тогда
			ЗначениеВРеквизитФормы(ОтборПоСвойствамОбъектаРеквизит,"ДеревоОтборПоСвойствамОбъекта");
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
	ЗаполнитьТабличныеПоляОтбора();
КонецПроцедуры


&НаКлиенте
Процедура КопироватьПравило(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Сначала следует записать правило'"));
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Справочник.ПравилаРегистрацииОбъектов.Форма.ФормаКопированиеПравилаРегистрации", Новый Структура("ПравилоРегистрацииОбразец", Объект.Ссылка), ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПеречитатьТипОбъектаКонфигурации()
	ТипОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектНастройки, "Тип");
	ЭтоСсылочныйТип = Ложь;
	Если ЗначениеЗаполнено(ТипОбъекта) Тогда
		ЭтоСсылочныйТип = (ТипОбъекта = Перечисления.ТипыОбъектов.Документ
			Или ТипОбъекта = Перечисления.ТипыОбъектов.Справочник
			Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовХарактеристик
			Или ТипОбъекта = Перечисления.ТипыОбъектов.Задача
			Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланСчетов
			Или ТипОбъекта = Перечисления.ТипыОбъектов.ПланВидовРасчета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеДерева(ДеревоСОтбором, ИмяЭлементаФормы, НачальныйИндекс, Отказ)
	СтрокиДерева = ДеревоСОтбором.Строки;
	Для Каждого СтрокаДерево Из СтрокиДерева Цикл
		НомерСтроки = НачальныйИндекс + СтрокиДерева.Индекс(СтрокаДерево) + 1;
		Если СтрокаДерево.ЭтоГруппа Тогда 
			ПроверитьЗаполнениеДерева(СтрокаДерево, ИмяЭлементаФормы, НомерСтроки, Отказ);
			Продолжить;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(СтрокаДерево.ВидСравнения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен Вид сравнения, строка '") + НомерСтроки,,ИмяЭлементаФормы);
			Отказ = Истина;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(СтрокаДерево.СвойствоОбъекта) Тогда
			Если ИмяЭлементаФормы = "ДеревоОтборПоСвойствамОбъекта" Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено Свойство объекта, строка '") + НомерСтроки,,ИмяЭлементаФормы);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено Свойство плана обмена, строка '") + НомерСтроки,,ИмяЭлементаФормы);
			КонецЕсли; 
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
