#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьУдаление(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыполнитьНаСервере()  
	КоличествоОбъектов = 0;
	Ошибки = "";
	Обработки.УдалениеКонвертации.ВыполнитьУдалениеПравил(Объект.Конвертация, Объект.НепосредственноеУдаление, Ложь, КоличествоОбъектов, Ошибки);
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Удалено объектов'")+": " + КоличествоОбъектов);
	Если Ошибки <> "" Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='В процессе удаления возникали ошибки'"));
		ОбщегоНазначения.СообщитьПользователю(Ошибки);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

