#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрКоманды.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ПараметрКоманды.Количество() = 1 Тогда
		СтруктураПараметров = Новый Структура("СсылкаНаОбъект, Действие", ПараметрКоманды[0],2);
		ОткрытьФорму("ОбщаяФорма.ЗахватОбъекта", СтруктураПараметров,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		СтруктураПараметров = Новый Структура("ЗахваченныеОбъекты", ПараметрКоманды);
		ОткрытьФорму("Обработка.ГрупповаяОбработкаЗахваченныхОбъектов.Форма", СтруктураПараметров,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
