#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Конвертация") И ЗначениеЗаполнено(Параметры.Конвертация) Тогда
		Объект.Конвертация = Параметры.Конвертация;
		ОпределитьИмяФайлаВыгрузки();
	КонецЕсли;
	Если Константы.СовместнаяРабота.Получить() Тогда
		Элементы.ГруппаВыполнитьВыгрузку.Видимость = Истина;
		Элементы.ФормаВыполнитьВыгрузкуБезСовместнойРаботы.Видимость = Ложь;
	Иначе
		Элементы.ГруппаВыполнитьВыгрузку.Видимость = Ложь;
		Элементы.ФормаВыполнитьВыгрузкуБезСовместнойРаботы.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры 
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ИмяФайлаПравилНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Фильтр", НСтр("ru = 'Файл данных (*.xml)'") + "|*.xml" );
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Укажите файл для сохранения правил конвертации XML'"));
	НастройкиДиалога.Вставить("Режим", РежимДиалогаВыбораФайла.Сохранение);
	МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
	МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "ИмяФайлаПравил", СтандартнаяОбработка, НастройкиДиалога);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьВыгрузкуПоТекущемуСостоянию(Команда)
	Объект.ПоСостояниюХранилища = Ложь;
	ВыполнитьВыгрузкуКлиент();
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьВыгрузкуПоСостояниюХранилища(Команда)
	Объект.ПоСостояниюХранилища = Истина;
	ВыполнитьВыгрузкуКлиент();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапки
&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	ОпределитьИмяФайлаВыгрузки();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ЗапускОбработки()
	ВыполнитьВыгрузкуСервер();
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
КонецПроцедуры
&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если НЕ ДлительнаяОперация Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
		ИзменитьДоступностьЭлементовФормы(Истина);
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеВыгрузкиКонвертации", 5, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 120, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена() 
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеВыгрузкиКонвертации()
	РезультатВыгрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	ФлагОшибки = Истина;
	Если ТипЗнч(РезультатВыгрузки) = Тип("Структура") И РезультатВыгрузки.Свойство("ФлагОшибки") Тогда
		ФлагОшибки = РезультатВыгрузки.ФлагОшибки;
		Если НЕ ФлагОшибки Тогда
			ДвоичныеДанныеПравил = РезультатВыгрузки.ПравилаXML;
			ДвоичныеДанныеПравил.Записать(Объект.ИмяФайлаПравил); 
		КонецЕсли;
	КонецЕсли;
	Если НЕ ФлагОшибки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выгрузка правил конвертации XML выполнена успешно'"));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выгрузка правил конвертации XML не выполнена'"));
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементовФормы(ФлагДоступность)
	Элементы.ФормаВыполнитьВыгрузку.Доступность = ФлагДоступность;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВыгрузкуСервер()
	ИдентификаторЗадания = Неопределено;
	АдресХранилищаРезультата = "";
	ДлительнаяОперация = Ложь;
	СтруктураПараметров = Новый Структура("ИмяФайлаПравил", Объект.ИмяФайлаПравил);
	СтруктураПараметров.Вставить("Конвертация", Объект.Конвертация);
	СтруктураПараметров.Вставить("ПоСостояниюХранилища", Объект.ПоСостояниюХранилища);

	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Выгрузка правил конвертации XML'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ВыгрузкаКонвертацииXML.ВыполнитьВыгрузкуПравил",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При выгрузке правил конвертации XML произошла ошибка'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуКлиент()
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Ожидание;
	ИзменитьДоступностьЭлементовФормы(Ложь);
	ПодключитьОбработчикОжидания("ЗапускОбработки", 5, Истина);
КонецПроцедуры

&НаСервере
Процедура ОпределитьИмяФайлаВыгрузки()
	Объект.ИмяФайлаПравил = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация,"ИмяФайлаДляСохранения");
КонецПроцедуры
#КонецОбласти

