#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПроверитьВозможностьЗахвата(ПараметрКоманды) = Ложь Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Данный объект недоступен для изменения. Невозможно захватить объект.'"));
		Возврат;
	КонецЕсли;
	СтруктураПараметров = Новый Структура("КОбработке, Действие", ПараметрКоманды,1);
	ОткрытьФорму("ОбщаяФорма.ЗахватОбъекта", СтруктураПараметров,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьЗахвата(ПараметрКоманды)
	Если ПараметрыСеанса.ОграничениеДоступаНаУровнеЗаписейИспользуется <> Истина ИЛИ Пользователи.ЭтоПолноправныйПользователь( , , Ложь) Тогда
		Возврат Истина;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 1
	|ИЗ РегистрСведений.НастройкиОграниченияДоступаККонвертациям КАК Настройки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Настройки.Конвертация = Состав.Владелец
	|ГДЕ Настройки.Пользователь = &ТекущийПользователь И Состав.ЭлементКонвертации В (&ЭлементКонвертации)";
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ЭлементКонвертации", ПараметрКоманды);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции
#КонецОбласти