#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Извлекает данные о конвертации из файла правил конвертации XML.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при работе.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения процедуры.
Процедура ПолучитьДанныеКонвертацииИзФайла(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	ФлагОшибки = Ложь;
	РезультатЗагрузки = Новый Структура("ЗагрузкаШапки, Успешно", Истина, Истина);
	ФайлЗапакован = Ложь;
	ИмяФайлаДляЧтенияДанных = ПолучитьИмяФайлаДляЧтенияДанных(ОбщиеПеременные, ФайлЗапакован, ФлагОшибки);
	Если ФлагОшибки Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	ПравилаОбмена = Новый ЧтениеXML();
	ПравилаОбмена.ОткрытьФайл(ИмяФайлаДляЧтенияДанных,,,"UTF-8");
	ПравилаОбмена.Прочитать();
	
	Стек = Новый Массив;
	
	Если Не ((ПравилаОбмена.ЛокальноеИмя = "ПравилаОбмена") И (ПравилаОбмена.ТипУзла = ТипУзлаXML.НачалоЭлемента)) Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	Иначе
		Стек.Добавить(ПравилаОбмена.ЛокальноеИмя);
	КонецЕсли;
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если      ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Стек.Добавить(ИмяУзла);
			Если      (ИмяУзла = "Наименование") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				РезультатЗагрузки.Вставить("Наименование", одЗначениеЭлемента(ПравилаОбмена));
				Стек.Удалить(Стек.Количество() - 1);
			ИначеЕсли (ИмяУзла = "Источник") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				РезультатЗагрузки.Вставить("Источник", одЗначениеЭлемента(ПравилаОбмена));
				Стек.Удалить(Стек.Количество() - 1);
			ИначеЕсли (ИмяУзла = "Приемник") И (Стек[Стек.Количество() - 2] = "ПравилаОбмена") Тогда
				РезультатЗагрузки.Вставить("Приемник", одЗначениеЭлемента(ПравилаОбмена));
				Стек.Удалить(Стек.Количество() - 1);
			КонецЕсли;
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Стек.Удалить(Стек.Количество() - 1);
		КонецЕсли;

		Если РезультатЗагрузки.Количество() = 5 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ПравилаОбмена.Закрыть();
	
	Если ФайлЗапакован Тогда
		Попытка
			УдалитьФайлы(ИмяФайлаДляЧтенияДанных);
		Исключение
			ИмяФайлаДляЧтенияДанных = "";
		КонецПопытки;
	КонецЕсли;
	Если РезультатЗагрузки.Свойство("Наименование") Тогда
		НайденнаяКонвертация = Справочники.Конвертации.НайтиПоНаименованию(СокрЛП(РезультатЗагрузки.Наименование), Истина);
		Если ЗначениеЗаполнено(НайденнаяКонвертация) Тогда
			ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденнаяКонвертация, "Конфигурация,КонфигурацияКорреспондент, ТипКонвертации");
			Если ДанныеКонвертации.ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
				РезультатЗагрузки.Вставить("Конвертация", НайденнаяКонвертация);
				РезультатЗагрузки.Вставить("Конфигурация", ДанныеКонвертации.Конфигурация);
				РезультатЗагрузки.Вставить("КонфигурацияКорреспондент", ДанныеКонвертации.КонфигурацияКорреспондент);
			Иначе
				РезультатЗагрузки.Вставить("Наименование", РезультатЗагрузки.Наименование + " (XML)");
			КонецЕсли
		КонецЕсли;
	КонецЕсли;
	Если НЕ РезультатЗагрузки.Свойство("Конфигурация") И РезультатЗагрузки.Свойство("Источник") Тогда
		НайденнаяКонфигурация = Справочники.Релизы.НайтиПоРеквизиту("Имя", СокрЛП(РезультатЗагрузки.Источник));
		Если ЗначениеЗаполнено(НайденнаяКонфигурация) Тогда
			РезультатЗагрузки.Вставить("Конфигурация", НайденнаяКонфигурация);
		КонецЕсли;
	КонецЕсли;
	Если НЕ РезультатЗагрузки.Свойство("КонфигурацияКорреспондент") И РезультатЗагрузки.Свойство("Приемник") Тогда
		НайденнаяКонфигурация = Справочники.Релизы.НайтиПоРеквизиту("Имя", СокрЛП(РезультатЗагрузки.Приемник));
		Если ЗначениеЗаполнено(НайденнаяКонфигурация) Тогда
			РезультатЗагрузки.Вставить("КонфигурацияКорреспондент", НайденнаяКонфигурация);
		КонецЕсли;
	КонецЕсли; 
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
КонецПроцедуры

// Выполняет загрузку правил конвертации XML из файла.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при загрузке.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения загрузки.
Процедура ВыполнитьЗагрузкуПравил(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	ФлагОшибки = Ложь;
	ФайлЗапакован = Ложь;
	РезультатЗагрузки = Новый Структура("ЗагрузкаШапки, Успешно", Ложь, Истина);
	ИмяФайлаДляЧтенияДанных = ПолучитьИмяФайлаДляЧтенияДанных(ОбщиеПеременные, ФайлЗапакован, ФлагОшибки);
	Если ФлагОшибки Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;

	ИнициализацияТаблицыПКС(ОбщиеПеременные);
	ИнициализацияТаблицыПКЗ(ОбщиеПеременные);
	ИнициализацияТаблицуНастроекВариантовПоиска(ОбщиеПеременные);
	ОбщиеПеременные.Вставить("Конвертация", Новый Структура);
	ОбщиеПеременные.Вставить("ФлагОшибки", Ложь);
	ПравилаОбмена = Новый ЧтениеXML();
	ПравилаОбмена.ОткрытьФайл(ИмяФайлаДляЧтенияДанных,,,"UTF-8");
	ПравилаОбмена.Прочитать();
	Если ПравилаОбмена.ЛокальноеИмя <> "ПравилаОбмена" 
		И ПравилаОбмена.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
		РезультатЗагрузки.Успешно = Ложь;
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		// Реквизиты конвертации
		Если      ИмяУзла = "ВерсияФормата" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ВерсияФормата",        одЗначениеЭлемента(ПравилаОбмена));
			РежимСовместимости = ПравилаОбмена.ПолучитьАтрибут ("РежимСовместимости");
			Если РежимСовместимости <> Неопределено Тогда
				ОбщиеПеременные.Конвертация.Вставить("РежимСовместимости", РежимСовместимости)
			КонецЕсли;
		ИначеЕсли ИмяУзла = "Ид" Тогда
			ОбщиеПеременные.Конвертация.Вставить("Ид",                   одЗначениеЭлемента(ПравилаОбмена));
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			ОбщиеПеременные.Конвертация.Вставить("Наименование",         одЗначениеЭлемента(ПравилаОбмена));
		ИначеЕсли ИмяУзла = "ДатаВремяСоздания" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ДатаВремяСоздания",    одЗначениеЭлемента(ПравилаОбмена, Тип("Дата")));
		ИначеЕсли ИмяУзла = "УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике" Тогда
			// Не поддерживается.
			одПропустить(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Источник" Тогда
			Если одАтрибут(ПравилаОбмена, "ВерсияПлатформы") = "7.7" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияПлатформы", Перечисления.Приложения.Предприятие77);
			ИначеЕсли одАтрибут(ПравилаОбмена, "ВерсияПлатформы") = "8.0" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияПлатформы", Перечисления.Приложения.Предприятие80);
			ИначеЕсли одАтрибут(ПравилаОбмена, "ВерсияПлатформы") = "УП" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияПлатформы", Перечисления.Приложения.УправляемоеПриложение);
			КонецЕсли;
			
			ВерсияКонфигурации = одАтрибут(ПравилаОбмена, "ВерсияКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ИсточникВерсияКонфигурации", ВерсияКонфигурации);
			
			СинонимКонфигурации = одАтрибут(ПравилаОбмена, "СинонимКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ИсточникСинонимКонфигурации", СинонимКонфигурации);
						
			ОбщиеПеременные.Конвертация.Вставить("Источник",             одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			
            Если одАтрибут(ПравилаОбмена, "ВерсияПлатформы") = "7.7" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияПлатформы", Перечисления.Приложения.Предприятие77);
			ИначеЕсли одАтрибут(ПравилаОбмена, "ВерсияПлатформы") = "8.0" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияПлатформы", Перечисления.Приложения.Предприятие80);
			ИначеЕсли одАтрибут(ПравилаОбмена, "ВерсияПлатформы") = "УП" Тогда
				ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияПлатформы", Перечисления.Приложения.УправляемоеПриложение);
			КонецЕсли;
			
			ВерсияКонфигурации = одАтрибут(ПравилаОбмена, "ВерсияКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ПриемникВерсияКонфигурации", ВерсияКонфигурации);
			
			СинонимКонфигурации = одАтрибут(ПравилаОбмена, "СинонимКонфигурации");
			ОбщиеПеременные.Конвертация.Вставить("ПриемникСинонимКонфигурации", СинонимКонфигурации);
			
			ОбщиеПеременные.Конвертация.Вставить("Приемник", одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "РежимСовместимости" Тогда
			ОбщиеПеременные.Конвертация.Вставить("РежимСовместимости", одЗначениеЭлемента(ПравилаОбмена));
		ИначеЕсли ИмяУзла = "Параметры" Тогда
			ЗагрузитьПараметры(ПравилаОбмена, ОбщиеПеременные);
		ИначеЕсли ИмяУзла = "Ответственный" Тогда
			одПропустить(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ОсновнойПланОбмена" Тогда
			одПропустить(ПравилаОбмена);

		// События конвертации
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиПравилОбмена" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиПравилОбмена",  одЗначениеЭлемента(ПравилаОбмена));
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкойДанных" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередВыгрузкойДанных",     одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузкиДанных" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеВыгрузкиДанных",      одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПередЗагрузкойДанных" Тогда
            ОбщиеПеременные.Конвертация.Вставить("ПередЗагрузкойДанных",     одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиДанных" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиДанных",      одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкойОбъекта" Тогда
            ОбщиеПеременные.Конвертация.Вставить("ПередВыгрузкойОбъекта",    одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПередКонвертациейОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередКонвертациейОбъекта", одЗначениеЭлемента(ПравилаОбмена));

		ИначеЕсли ИмяУзла = "ПослеВыгрузкиОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеВыгрузкиОбъекта", одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПередЗагрузкойОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередЗагрузкойОбъекта", одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиОбъекта" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиОбъекта", одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПередОтправкойИнформацииОбУдалении" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередОтправкойИнформацииОбУдалении",  одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПриПолученииИнформацииОбУдалении" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПриПолученииИнформацииОбУдалении",  одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПередПолучениемИзмененныхОбъектов" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПередПолучениемИзмененныхОбъектов",  одЗначениеЭлемента(ПравилаОбмена));
			
		ИначеЕсли ИмяУзла = "ПослеПолученияИнформацииОбУзлахОбмена" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеПолученияИнформацииОбУзлахОбмена",  одЗначениеЭлемента(ПравилаОбмена));						
			
		ИначеЕсли ИмяУзла = "ПослеЗагрузкиПараметров" Тогда
			ОбщиеПеременные.Конвертация.Вставить("ПослеЗагрузкиПараметров",  одЗначениеЭлемента(ПравилаОбмена));			
			
		ИначеЕсли ИмяУзла = "ПравилаВыгрузкиДанных" Тогда
			ЗагрузитьПравилаВыгрузки(ПравилаОбмена, ОбщиеПеременные);
			
		ИначеЕсли ИмяУзла = "ПравилаКонвертацииОбъектов" Тогда
			ЗагрузитьПравилаКонвертации(ПравилаОбмена, ОбщиеПеременные);
			
		ИначеЕсли ИмяУзла = "ПравилаРегистрацииОбъектов" Тогда
			одПропустить(ПравилаОбмена); // правила регистрации загружаем отдельной обработкой
			
		ИначеЕсли ИмяУзла = "ПравилаОчисткиДанных" Тогда
			одПропустить(ПравилаОбмена); // правила очистки не поддерживаются.
		ИначеЕсли ИмяУзла = "Алгоритмы" Тогда
			ЗагрузитьАлгоритмы(ПравилаОбмена, ОбщиеПеременные);
		ИначеЕсли ИмяУзла = "Запросы" Тогда
			ЗагрузитьЗапросы(ПравилаОбмена, ОбщиеПеременные);
        ИначеЕсли ИмяУзла = "Обработки" Тогда
			одПропустить(ПравилаОбмена); // обработки не поддерживаются.
		ИначеЕсли (ИмяУзла = "ПравилаОбмена") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			ПравилаОбмена.Закрыть();
			Прервать;
		Иначе
 			// Ошибка формата
			ОбщиеПеременные.ФлагОшибки = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Ошибка формата файла обмена. Не возможности обработать узел'") + ": " + ИмяУзла);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ОбщиеПеременные.ФлагОшибки Тогда
		// Сохранение загруженных данных в объекты информационной базы.
		СохранитьЗагруженныеДанные(ОбщиеПеременные);
	КонецЕсли;
	Если ФайлЗапакован Тогда
		Попытка
			УдалитьФайлы(ИмяФайлаДляЧтенияДанных);
		Исключение
			ИмяФайлаДляЧтенияДанных = "";
		КонецПопытки
	КонецЕсли;
	РезультатЗагрузки.Успешно = НЕ ОбщиеПеременные.ФлагОшибки;
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
// Осуществляет загрузку параметров в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьПараметры(ПравилаОбмена, ОбщиеПеременные)
	ТабПараметры = Новый ТаблицаЗначений;
	Колонки = ТабПараметры.Колонки;

	Колонки.Добавить("Параметр");
	Колонки.Добавить("УстанавливатьВДиалоге");
	Колонки.Добавить("ТипОбъекта");
	Колонки.Добавить("ИспользуетсяПриЗагрузке");
	Колонки.Добавить("ПередаватьПараметрПриВыгрузке");
	Колонки.Добавить("АлгоритмПослеЗагрузкиПараметра");
	Колонки.Добавить("ПравилоКонвертации");

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;

		Если ИмяУзла = "Параметр" И ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			// Загрузка по версии правил 2.01
			НоваяСтрока                       = ТабПараметры.Добавить();
			НоваяСтрока.Параметр              = одАтрибут(ПравилаОбмена, "Имя");
			НоваяСтрока.УстанавливатьВДиалоге = одАтрибут(ПравилаОбмена, "УстанавливатьВДиалоге");
			НоваяСтрока.ТипОбъекта            = Строка(ПравилаОбмена.ПолучитьАтрибут("ТипЗначения"));
			НоваяСтрока.ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, "ИспользуетсяПриЗагрузке", Тип("Булево"));
			НоваяСтрока.ПередаватьПараметрПриВыгрузке = одАтрибут(ПравилаОбмена, "ПередаватьПараметрПриВыгрузке", Тип("Булево"));
			НоваяСтрока.АлгоритмПослеЗагрузкиПараметра  = одАтрибут(ПравилаОбмена, "ПослеЗагрузкиПараметра");
			НоваяСтрока.ПравилоКонвертации = одАтрибут(ПравилаОбмена, "ПравилоКонвертации");

		ИначеЕсли (ТипУзла = ТипУзлаXML.Текст) Тогда
			
			// Для совместимости с версией правил 2.0 используем загрузку из строки
			СтрокаПараметров = ПравилаОбмена.Значение;
			Для каждого Пар Из СтрРазделить(СтрокаПараметров,, Ложь) Цикл
				НоваяСтрока                       = ТабПараметры.Добавить();
				НоваяСтрока.Параметр              = Пар;
				НоваяСтрока.УстанавливатьВДиалоге = ЛОЖЬ;
				НоваяСтрока.ТипОбъекта            = "";
				НоваяСтрока.ИспользуетсяПриЗагрузке = Истина;
				НоваяСтрока.ПередаватьПараметрПриВыгрузке = ЛОЖЬ;
				НоваяСтрока.ПравилоКонвертации = "";
				НоваяСтрока.АлгоритмПослеЗагрузкиПараметра = "";
			КонецЦикла;
			
		ИначеЕсли (ИмяУзла = "Параметры") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ОбщиеПеременные.Вставить("Параметры", ТабПараметры);
КонецПроцедуры // ЗагрузитьПараметры() 

// Осуществляет загрузку правил выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьПравилаВыгрузки(ПравилаОбмена, ОбщиеПеременные)
	ТабПВД = Новый ДеревоЗначений;
	Колонки = ТабПВД.Колонки;

	Колонки.Добавить("ЭтоГруппа", одОписаниеТипа("Булево"));

	Колонки.Добавить("Отключить", одОписаниеТипа("Булево"));
	
	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок", одОписаниеТипа("Число"));
	Колонки.Добавить("Описание");
	Колонки.Добавить("Комментарий");

	Колонки.Добавить("СпособОтбораДанных");
	Колонки.Добавить("ОбъектВыборки");
	
	Колонки.Добавить("ПравилоКонвертации");

	Колонки.Добавить("ПередОбработкой");
	Колонки.Добавить("ПослеОбработки");

	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПослеВыгрузки");
	
	Колонки.Добавить("ВыбиратьДанныеДляВыгрузкиОднимЗапросом",    одОписаниеТипа("Булево"));
	Колонки.Добавить("НеВыгружатьОбъектыСозданныеВБазеПриемнике", одОписаниеТипа("Булево"));

	СтрокиДЗ = ТабПВД.Строки;
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ИмяУзла = "Правило" И ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПВД(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" И ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПВГД(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "ПравилаВыгрузкиДанных") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	СтрокиДЗ.Сортировать("Порядок", Истина);
	ОбщиеПеременные.Вставить("ПравилаВыгрузкиДанных", ТабПВД);
КонецПроцедуры // ЗагрузитьПравилаВыгрузки()

// Осуществляет загрузку группы правил выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая группу правил выгрузки данных
// 
Процедура ЗагрузитьПВГД(ПравилаОбмена, НоваяСтрока)
	// Для группы загружаем только имя и признак Отключить, т.к. ПравилаОбработкиДанных не иерархический справочник.
	НоваяСтрока.ЭтоГруппа = Истина;
	НоваяСтрока.Отключить = одАтрибут(ПравилаОбмена, "Отключить", Тип("Булево"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если ИмяУзла = "Код" Тогда
			
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Правило" И ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПВД(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" И ТипУзла = ТипУзлаXML.НачалоЭлемента
			И НЕ НоваяСтрока.Отключить Тогда
			
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
            ЗагрузитьПВГД(ПравилаОбмена, СтрокаДЗ);
			
		ИначеЕсли ИмяУзла = "Группа" И ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьПВГД()

// Осуществляет загрузку правила выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая правило выгрузки данных
// 
Процедура ЗагрузитьПВД(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.Отключить = одАтрибут(ПравилаОбмена, "Отключить", Тип("Булево"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена);

		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена);

		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));

		ИначеЕсли ИмяУзла = "Описание" Тогда
			НоваяСтрока.Описание = одЗначениеЭлемента(ПравилаОбмена);

		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "СпособОтбораДанных" Тогда
			НоваяСтрока.СпособОтбораДанных = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ВыбиратьДанныеДляВыгрузкиОднимЗапросом" Тогда
			НоваяСтрока.ВыбиратьДанныеДляВыгрузкиОднимЗапросом = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "НеВыгружатьОбъектыСозданныеВБазеПриемнике" Тогда
			НоваяСтрока.НеВыгружатьОбъектыСозданныеВБазеПриемнике = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "ОбъектВыборки" Тогда
			НоваяСтрока.ОбъектВыборки = одЗначениеЭлемента(ПравилаОбмена);

		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена);
		
		// Обработчики событий

		ИначеЕсли ИмяУзла = "ПередОбработкойПравила" Тогда
			НоваяСтрока.ПередОбработкой = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиПравила" Тогда
			НоваяСтрока.ПослеОбработки = одЗначениеЭлемента(ПравилаОбмена);
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкойОбъекта" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена);

		ИначеЕсли ИмяУзла = "ПослеВыгрузкиОбъекта" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена);

			
		// Выход
		
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	
	Если ПустаяСтрока(НоваяСтрока.Наименование) Тогда
		НоваяСтрока.Наименование = НоваяСтрока.Имя;
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьПВД()

// Осуществляет загрузку правил конвертации объектов
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьПравилаКонвертации(ПравилаОбмена, ОбщиеПеременные)
	ТабПКО = Новый ДеревоЗначений;
	ИнициализацияТаблицыПКО(ТабПКО);

	СтрокиДЗ = ТабПКО.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Правило" И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКО(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли ИмяУзла = "Группа" И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКГО(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли (ИмяУзла = "ПравилаКонвертацииОбъектов") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	ОбщиеПеременные.Вставить("ПравилаКонвертацииОбъектов", ТабПКО);
КонецПроцедуры // ЗагрузитьПравилаКонвертации() 

// Осуществляет загрузку группы правил выгрузки данных в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  НоваяСтрока    - строка дерева значений, описывающая группу правил выгрузки данных
// 
Процедура ЗагрузитьПКГО(ПравилаОбмена, НоваяСтрока, ОбщиеПеременные)
	// Для группы загружаем только имя, т.к. ПравилаКонвертацииОбъектов не иерархический справочник.

	НоваяСтрока.ЭтоГруппа = Истина;
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКГО(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли ИмяУзла = "Правило" И ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКО(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗагрузитьГруппуПКО()

// Осуществляет загрузку правила конвертации объектов
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ЗаписьXML      - Объект типа XMLЗапись - правила, сохраняемые в файл обмена и
//                   используемые при загрузке данных
// 
Процедура ЗагрузитьПКО(ПравилаОбмена, НоваяСтрока, ОбщиеПеременные)

	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если      ИмяУзла = "Код" Тогда
			Значение = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.Имя = Значение;
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли ИмяУзла = "СпособВыгрузки" Тогда
			НоваяСтрока.СпособВыгрузки = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "НеЗапоминатьВыгруженные" Тогда
			НоваяСтрока.НеЗапоминатьВыгруженные = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "СинхронизироватьПоИдентификатору" Тогда
			НоваяСтрока.СинхронизироватьПоИдентификатору = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли" Тогда
			НоваяСтрока.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));	
		ИначеЕсли ИмяУзла = "НеВыгружатьОбъектыСвойствПоСсылкам" Тогда
			НоваяСтрока.НеВыгружатьОбъектыСвойствПоСсылкам = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "НеСоздаватьЕслиНеНайден" Тогда
			НоваяСтрока.НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ИспользоватьБыстрыйПоискПриЗагрузке" Тогда
			НоваяСтрока.ИспользоватьБыстрыйПоискПриЗагрузке = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ГенерироватьНовыйНомерИлиКодЕслиНеУказан" Тогда
			НоваяСтрока.ГенерироватьНовыйНомерИлиКодЕслиНеУказан = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки" Тогда
			НоваяСтрока.ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD" Тогда
			НоваяСтрока.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике" Тогда
			НоваяСтрока.НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "РегистрироватьОбъектНаУзлеОтправителе" Тогда // не используется
			одПропустить(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник	= одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "ПриоритетОбъектовОбмена" Тогда
			НоваяСтрока.ПриоритетОбъектовОбмена = одЗначениеЭлемента(ПравилаОбмена);
			
		// Настройки вариантов поиска		
		ИначеЕсли ИмяУзла = "НастройкаВариантовПоискаОбъектов" Тогда
			НоваяСтрока.НастройкаВариантовПоискаОбъектов = ОбщиеПеременные.ТаблицаНастроекВариантовПоиска.Скопировать();
			ЗагрузитьНастройкиВариантовПоиска(ПравилаОбмена, НоваяСтрока.НастройкаВариантовПоискаОбъектов);

		// Свойства
		
		ИначеЕсли ИмяУзла = "Свойства" Тогда
			НоваяСтрока.Свойства		= ОбщиеПеременные.ТаблицаПравилКонвертацииСвойств.Скопировать();
			ЗагрузитьСвойства(ПравилаОбмена, НоваяСтрока.Свойства, ОбщиеПеременные);
			
		// Значения
		
		ИначеЕсли ИмяУзла = "Значения" Тогда
            НоваяСтрока.Значения		= ОбщиеПеременные.ТаблицаПравилКонвертацииЗначений.Скопировать();
			ЗагрузитьЗначения(ПравилаОбмена, НоваяСтрока.Значения, НоваяСтрока.Источник);
			
		// Обработчики событий
		
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
		ИначеЕсли ИмяУзла = "ПослеВыгрузкиВФайл" Тогда
			НоваяСтрока.ПослеВыгрузкиВФайл = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПослеВыгрузкиВФайл  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузкиВФайл);
		ИначеЕсли ИмяУзла = "ПередЗагрузкой" Тогда
			НоваяСтрока.ПередЗагрузкой               = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПередЗагрузкой = Не ПустаяСтрока(НоваяСтрока.ПередЗагрузкой);
		ИначеЕсли ИмяУзла = "ПриЗагрузке" Тогда
			НоваяСтрока.ПриЗагрузке               = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПриЗагрузке = Не ПустаяСтрока(НоваяСтрока.ПриЗагрузке);
		ИначеЕсли ИмяУзла = "ПослеЗагрузки" Тогда
			НоваяСтрока.ПослеЗагрузки               = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПослеЗагрузки = Не ПустаяСтрока(НоваяСтрока.ПослеЗагрузки);
		ИначеЕсли ИмяУзла = "ПоследовательностьПолейПоиска" Тогда
			НоваяСтрока.ПоследовательностьПолейПоиска               = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПоследовательностейПолейПоиска = Не ПустаяСтрока(НоваяСтрока.ПоследовательностьПолейПоиска);
						
		// Выход
		ИначеЕсли (ИмяУзла = "Правило") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры // ЗагрузитьПравилоКонвертации() 

Процедура ЗагрузитьНастройкуВариантовПоиска(ПравилаОбмена, НоваяСтрока)
	
	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если ИмяУзла = "ИмяНастройкиДляАлгоритма" Тогда
			НоваяСтрока.ИмяНастройкиДляАлгоритма = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ИмяНастройкиДляПользователя" Тогда
			НоваяСтрока.ИмяНастройкиДляПользователя = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ОписаниеНастройкиДляПользователя" Тогда
			НоваяСтрока.ОписаниеНастройкиДляПользователя = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли (ИмяУзла = "ВариантПоиска") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьНастройкиВариантовПоиска(ПравилаОбмена, ТаблицаНастроек)

	Пока ПравилаОбмена.Прочитать() Цикл
		
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		
		Если ИмяУзла = "ВариантПоиска" Тогда
			
            СтрокаНастройки = ТаблицаНастроек.Добавить();
			ЗагрузитьНастройкуВариантовПоиска(ПравилаОбмена, СтрокаНастройки);
			
		ИначеЕсли (ИмяУзла = "НастройкаВариантовПоискаОбъектов") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьНастройкиВариантовПоиска()

// Осуществляет загрузку правил конвертации свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
//  ТаблицаПоиска  - таблица значений, содержащая ПКС (синхронизирующих)
// 
Процедура ЗагрузитьСвойства(ПравилаОбмена, ТаблицаСвойств, ОбщиеПеременные)

	СтрокиДЗ = ТаблицаСвойств.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Свойство" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКС(ПравилаОбмена, ТаблицаСвойств, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКГС(ПравилаОбмена, ТаблицаСвойств, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли (ИмяУзла = "Свойства") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьСвойства()

// Осуществляет загрузку правила конвертации свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
//  ТаблицаПоиска  - таблица значений, содержащая ПКС (синхронизирующих)
// 
Процедура ЗагрузитьПКС(ПравилаОбмена, ТаблицаСвойств, НоваяСтрока)

	НоваяСтрока.Поиск     = одАтрибут(ПравилаОбмена, "Поиск", Тип("Булево"));
	НоваяСтрока.Отключить = одАтрибут(ПравилаОбмена, "Отключить", Тип("Булево"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник		= одАтрибут(ПравилаОбмена, "Имя");
			НоваяСтрока.ВидИсточника	= одАтрибут(ПравилаОбмена, "Вид");
			НоваяСтрока.ТипИсточника	= одАтрибут(ПравилаОбмена, "Тип");
			Если СокрЛП(НоваяСтрока.ТипИсточника) = "ОпределениеТипа" Тогда
				НоваяСтрока.ТипИсточника = "";
			КонецЕсли;
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник		= одАтрибут(ПравилаОбмена, "Имя");
			НоваяСтрока.ВидПриемника	= одАтрибут(ПравилаОбмена, "Вид");
			НоваяСтрока.ТипПриемника	= одАтрибут(ПравилаОбмена, "Тип");
			Если СокрЛП(НоваяСтрока.ТипПриемника) = "ОпределениеТипа" Тогда
				НоваяСтрока.ТипПриемника = "";
			КонецЕсли;
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));

		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
			
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена);
	        НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПолучитьИзВходящихДанных" Тогда
			НоваяСтрока.ПолучитьИзВходящихДанных = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "ПриводитьКДлине" Тогда
			
			ДлинаЭлемента = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
			НоваяСтрока.ПриводитьКДлине = Истина;
			
		ИначеЕсли ИмяУзла = "ИмяПараметраДляПередачи" Тогда
			
			НоваяСтрока.ИмяПараметраДляПередачи = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ПоискПоДатеНаРавенство" Тогда
			
			НоваяСтрока.ПоискПоДатеНаРавенство = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли (ИмяУзла = "Свойство") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьПКС() 

// Осуществляет загрузку правила конвертации группы свойств
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  ТаблицаСвойств - таблица значений, содержащая ПКС
// 
Процедура ЗагрузитьПКГС(ПравилаОбмена, ТаблицаСвойств, НоваяСтрока, ОбщиеПеременные)

	НоваяСтрока.ЭтоГруппа     = Истина;
	НоваяСтрока.ПравилаГруппы = ОбщиеПеременные.ТаблицаПравилКонвертацииСвойств.Скопировать();
	НоваяСтрока.Отключить     = одАтрибут(ПравилаОбмена, "Отключить", Тип("Булево"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник		= одАтрибут(ПравилаОбмена, "Имя");
			НоваяСтрока.ВидИсточника	= одАтрибут(ПравилаОбмена, "Вид");
			НоваяСтрока.ТипИсточника	= одАтрибут(ПравилаОбмена, "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник		= одАтрибут(ПравилаОбмена, "Имя");
			НоваяСтрока.ВидПриемника	= одАтрибут(ПравилаОбмена, "Вид");
			НоваяСтрока.ТипПриемника	= одАтрибут(ПравилаОбмена, "Тип");
			одПропустить(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Свойство" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКС(ПравилаОбмена, НоваяСтрока.ПравилаГруппы, СтрокаДЗ);

		ИначеЕсли ИмяУзла = "ПередОбработкойВыгрузки" Тогда
			НоваяСтрока.ПередОбработкойВыгрузки	= одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПередОбработкойВыгрузки = Не ПустаяСтрока(НоваяСтрока.ПередОбработкойВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПослеОбработкиВыгрузки" Тогда
			НоваяСтрока.ПослеОбработкиВыгрузки	= одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПослеОбработкиВыгрузки = Не ПустаяСтрока(НоваяСтрока.ПослеОбработкиВыгрузки);
			
		ИначеЕсли ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));

		ИначеЕсли ИмяУзла = "НеЗамещать" Тогда
			НоваяСтрока.НеЗамещать = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "КодПравилаКонвертации" Тогда
			НоваяСтрока.ПравилоКонвертации = одЗначениеЭлемента(ПравилаОбмена);
			
		ИначеЕсли ИмяУзла = "ПередВыгрузкой" Тогда
			НоваяСтрока.ПередВыгрузкой = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПередВыгрузкой = Не ПустаяСтрока(НоваяСтрока.ПередВыгрузкой);
			
		ИначеЕсли ИмяУзла = "ПриВыгрузке" Тогда
			НоваяСтрока.ПриВыгрузке = одЗначениеЭлемента(ПравилаОбмена);
			НоваяСтрока.ЕстьОбработчикПриВыгрузке    = Не ПустаяСтрока(НоваяСтрока.ПриВыгрузке);
			
		ИначеЕсли ИмяУзла = "ПослеВыгрузки" Тогда
			НоваяСтрока.ПослеВыгрузки = одЗначениеЭлемента(ПравилаОбмена);
	        НоваяСтрока.ЕстьОбработчикПослеВыгрузки  = Не ПустаяСтрока(НоваяСтрока.ПослеВыгрузки);
			
		ИначеЕсли ИмяУзла = "ПолучитьИзВходящихДанных" Тогда
			НоваяСтрока.ПолучитьИзВходящихДанных = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "ВыгружатьГруппуЧерезФайл" Тогда
			НоваяСтрока.ВыгружатьГруппуЧерезФайл = одЗначениеЭлемента(ПравилаОбмена, Тип("Булево"));
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПКГС() 

// Осуществляет загрузку алгоритмов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьАлгоритмы(ПравилаОбмена, ОбщиеПеременные)
	ТабАлгоритмы = Новый ДеревоЗначений;
	Колонки = ТабАлгоритмы.Колонки;

	Колонки.Добавить("Код");
	Колонки.Добавить("Алгоритм");
	Колонки.Добавить("Параметры");
	Колонки.Добавить("Комментарий");
	Колонки.Добавить("ЭтоГруппа", одОписаниеТипа("Булево"));
	Колонки.Добавить("ИспользуетсяПриЗагрузке", одОписаниеТипа("Булево"));

	СтрокиДЗ = ТабАлгоритмы.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Алгоритм" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьАлгоритм(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьАлгоритмГруппа(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Алгоритмы") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ОбщиеПеременные.Вставить("Алгоритмы", ТабАлгоритмы);
КонецПроцедуры // ЗагрузитьАлгоритмы() 

// Осуществляет загрузку групп алгоритмов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьАлгоритмГруппа(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.ЭтоГруппа = Истина;

	НоваяСтрока.Код = одАтрибут(ПравилаОбмена, "Имя");

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ИмяУзла = "Алгоритм" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьАлгоритм(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьАлгоритмГруппа(ПравилаОбмена, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьАлгоритмГруппа()

// Осуществляет загрузку алгоритма в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьАлгоритм(ПравилаОбмена, НоваяСтрока)

	НоваяСтрока.Код = одАтрибут(ПравилаОбмена, "Имя");
	НоваяСтрока.ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, "ИспользуетсяПриЗагрузке", Тип("Булево"));

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Текст" Тогда
			НоваяСтрока.Алгоритм = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Параметры" Тогда
			НоваяСтрока.Параметры = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли (ИмяУзла = "Алгоритм") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьАлгоритм() 

// Осуществляет загрузку запросов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьЗапросы(ПравилаОбмена, ОбщиеПеременные)
	ТабЗапросы = Новый ДеревоЗначений();
	Колонки = ТабЗапросы.Колонки;

	Колонки.Добавить("Код");
	Колонки.Добавить("ТекстЗапроса");
	Колонки.Добавить("Комментарий");
	Колонки.Добавить("ЭтоГруппа", одОписаниеТипа("Булево"));
	Колонки.Добавить("ИспользуетсяПриЗагрузке", одОписаниеТипа("Булево"));
	ОбщиеПеременные.Вставить("Запросы", ТабЗапросы);

	СтрокиДЗ = ОбщиеПеременные.Запросы.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Запрос" Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьЗапрос(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли ИмяУзла = "Группа" Тогда
			СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьЗапросГруппа(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли (ИмяУзла = "Запросы") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗагрузитьЗапросы() 

// Осуществляет загрузку групп запросов в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьЗапросГруппа(ПравилаОбмена, НоваяСтрока, ОбщиеПеременные)

	НоваяСтрока.ЭтоГруппа = Истина;

	НоваяСтрока.Код = одАтрибут(ПравилаОбмена, "Имя");

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ИмяУзла = "Запрос" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьЗапрос(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьЗапросГруппа(ПравилаОбмена, СтрокаДЗ, ОбщиеПеременные);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьЗапросГруппа()

// Осуществляет загрузку запроса в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьЗапрос(ПравилаОбмена, НоваяСтрока, ОбщиеПеременные)

	ИмяЗапроса = одАтрибут(ПравилаОбмена, "Имя");
	
	НоваяСтрока.Код = ИмяЗапроса;
	НоваяСтрока.ИспользуетсяПриЗагрузке = одАтрибут(ПравилаОбмена, "ИспользуетсяПриЗагрузке", Тип("Булево"));
	
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Текст" Тогда
			НоваяСтрока.ТекстЗапроса = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли (ИмяУзла = "Запрос") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьЗапрос() 

// Осуществляет загрузку правил конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
//  ТипИсточника   - значение типа Тип - тип объекта источника
// 
Процедура ЗагрузитьЗначения(ПравилаОбмена, ТаблицаЗначений, ТипИсточника)

	СтрокиДЗ = ТаблицаЗначений.Строки;

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Значение" Тогда
            СтрокаДЗ = СтрокиДЗ.Добавить();
			ЗагрузитьПКЗ(ПравилаОбмена, ТаблицаЗначений, СтрокаДЗ);
		ИначеЕсли ИмяУзла = "Группа" Тогда
			ЗагрузитьПКГЗ(ПравилаОбмена, ТаблицаЗначений, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Значения") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Осуществляет загрузку правила конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
//  ТипИсточника   - значение типа Тип - тип объекта источника
// 
Процедура ЗагрузитьПКГЗ(ПравилаОбмена, ТаблицаЗначений, НоваяСтрока)
	// Группы не создаются, загружаются только сами значения.
	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если ИмяУзла = "Значение" Тогда
			СтрокаДЗ = НоваяСтрока.Строки.Добавить();
			ЗагрузитьПКЗ(ПравилаОбмена, ТаблицаЗначений, СтрокаДЗ);
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПКЗ() 

// Осуществляет загрузку правила конвертации значений
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
//  Значения       - соответствие значений объекта источника - строковым
//                   представлениям объекта приемника
// 
Процедура ЗагрузитьПКЗ(ПравилаОбмена, ТаблицаЗначений, НоваяСтрока)

	Пока ПравилаОбмена.Прочитать() Цикл
		ИмяУзла = ПравилаОбмена.ЛокальноеИмя;
		ТипУзла = ПравилаОбмена.ТипУзла;
		Если      ИмяУзла = "Код" Тогда
			НоваяСтрока.Имя = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли ИмяУзла = "Наименование" Тогда
			НоваяСтрока.Наименование = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Источник" Тогда
			НоваяСтрока.Источник = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Приемник" Тогда
			НоваяСтрока.Приемник = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Комментарий" Тогда
			НоваяСтрока.Комментарий = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Описание" Тогда
			НоваяСтрока.Описание = одЗначениеЭлемента(ПравилаОбмена);
		ИначеЕсли ИмяУзла = "Порядок" Тогда
			НоваяСтрока.Порядок = одЗначениеЭлемента(ПравилаОбмена, Тип("Число"));
		ИначеЕсли (ИмяУзла = "Значение") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗагрузитьПКЗ() 

// Инициализирует колонки таблицы правил конвертации объектов
//
// Параметры:
//  ТабПКО: ДеревоЗначений.
// 
Процедура ИнициализацияТаблицыПКО(ТабПКО)

	Колонки = ТабПКО.Колонки;

	Колонки.Добавить("ЭтоГруппа", одОписаниеТипа("Булево"));

	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок");

	Колонки.Добавить("СпособВыгрузки");

	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");

	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПриВыгрузке");
	Колонки.Добавить("ПослеВыгрузки");
	Колонки.Добавить("ПослеВыгрузкиВФайл");

	Колонки.Добавить("ЕстьОбработчикПередВыгрузкой",	одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриВыгрузке",		одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузки",		одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузкиВФайл",одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ПередЗагрузкой");
	Колонки.Добавить("ПриЗагрузке");
	Колонки.Добавить("ПослеЗагрузки");
	
	Колонки.Добавить("ЕстьОбработчикПередЗагрузкой", одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриЗагрузке",    одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеЗагрузки",  одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПоследовательностейПолейПоиска",  одОписаниеТипа("Булево"));
		
	Колонки.Добавить("Свойства", одОписаниеТипа("ДеревоЗначений"));
	
	Колонки.Добавить("Значения", одОписаниеТипа("ДеревоЗначений"));
	
	Колонки.Добавить("НастройкаВариантовПоискаОбъектов", одОписаниеТипа("ТаблицаЗначений"));
	
	Колонки.Добавить("ВыгружатьПредставлениеИсточника",		одОписаниеТипа("Булево"));
	
	Колонки.Добавить("НеЗамещать",					      одОписаниеТипа("Булево"));
	Колонки.Добавить("НеЗапоминатьВыгруженные",           одОписаниеТипа("Булево"));
    Колонки.Добавить("СинхронизироватьПоИдентификатору", одОписаниеТипа("Булево"));
	Колонки.Добавить("ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли", одОписаниеТипа("Булево"));
    Колонки.Добавить("НеВыгружатьОбъектыСвойствПоСсылкам", одОписаниеТипа("Булево"));
	Колонки.Добавить("НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска", одОписаниеТипа("Булево"));	
	Колонки.Добавить("ИспользоватьБыстрыйПоискПриЗагрузке", одОписаниеТипа("Булево"));
	Колонки.Добавить("ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки", одОписаниеТипа("Булево"));
	Колонки.Добавить("ГенерироватьНовыйНомерИлиКодЕслиНеУказан", одОписаниеТипа("Булево"));
	Колонки.Добавить("ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD", одОписаниеТипа("Булево"));
	Колонки.Добавить("НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике", одОписаниеТипа("Булево"));
		
	Колонки.Добавить("ПоследовательностьПолейПоиска");
	Колонки.Добавить("ПриоритетОбъектовОбмена");
	
КонецПроцедуры // ИнициализацияТаблицыПравилКонвертации()

Процедура СохранитьЗагруженныеДанные(ОбщиеПеременные)
	Источник = ОбщиеПеременные.Конфигурация;
	ИнициализацияГруппОбъектов(Источник);
	ОбщиеПеременные.Вставить("Обновление", Ложь);
	Если ОбщиеПеременные.КонфигурацииСовпадают Тогда
		
		Приемник = Источник;
		
	Иначе
		Приемник = ОбщиеПеременные.КонфигурацияКорреспондент;
		ИнициализацияГруппОбъектов(Приемник);
	КонецЕсли;
	// Конвертация
	Если ОбщиеПеременные.СпособЗагрузкиКонвертации = 0 Тогда
		
		НоваяКонвертация = Справочники.Конвертации.СоздатьЭлемент();
		НоваяКонвертация.Наименование = ОбщиеПеременные.ИмяКонвертацииДляЗагрузки;
        НоваяКонвертация.Конфигурация = Источник;
		НоваяКонвертация.КонфигурацияКорреспондент = Приемник;
		НоваяКонвертация.ТипКонвертации = Перечисления.ТипыКонвертаций.XML;
		НоваяКонвертация.Записать();
		
	Иначе
        
		НоваяКонвертация = ОбщиеПеременные.КонвертацияСсылка.ПолучитьОбъект();
		НоваяКонвертация.Конфигурация = Источник;
		НоваяКонвертация.КонфигурацияКорреспондент = Приемник;
		// Параметры загружаются поверх всегда.
		НоваяКонвертация.Параметры.Очистить();
		НоваяКонвертация.Записать();
		Если  ОбщиеПеременные.СпособЗагрузкиКонвертации = 1 Тогда
			// Полная замена.
			КонвертацияСсылка = НоваяКонвертация.Ссылка;
			УдалитьЭлементыКонвертации(КонвертацияСсылка, "Запросы");
			УдалитьЭлементыКонвертации(КонвертацияСсылка, "Алгоритмы");
			УдалитьЭлементыКонвертации(КонвертацияСсылка, "ПравилаОбработкиДанных");
			УдалитьЭлементыКонвертации(КонвертацияСсылка, "ПравилаКонвертацииПредопределенныхДанных");
			УдалитьЭлементыКонвертации(КонвертацияСсылка, "ПравилаКонвертацииОбъектов");
		ИначеЕсли ОбщиеПеременные.СпособЗагрузкиКонвертации = 2 Тогда
			
			ОбщиеПеременные.Вставить("Обновление", Истина);
			
			ПолучитьВсеПравилаКонвертации(КонвертацияСсылка, ОбщиеПеременные);
		КонецЕсли;
		
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиПравилОбмена") Тогда
		НоваяКонвертация.АлгоритмПослеЗагрузкиПравилОбмена  = ОбщиеПеременные.Конвертация.ПослеЗагрузкиПравилОбмена;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПередПолучениемИзмененныхОбъектов") Тогда
		НоваяКонвертация.АлгоритмПередПолучениемИзмененныхОбъектов  = ОбщиеПеременные.Конвертация.ПередПолучениемИзмененныхОбъектов;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПослеПолученияИнформацииОбУзлахОбмена") Тогда
		НоваяКонвертация.АлгоритмПослеПолученияИнформацииОбУзлахОбмена  = ОбщиеПеременные.Конвертация.ПослеПолученияИнформацииОбУзлахОбмена;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПередВыгрузкойДанных") Тогда
		НоваяКонвертация.АлгоритмПередВыгрузкойДанных     = ОбщиеПеременные.Конвертация.ПередВыгрузкойДанных;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПослеВыгрузкиДанных") Тогда
		НоваяКонвертация.АлгоритмПослеВыгрузкиДанных      = ОбщиеПеременные.Конвертация.ПослеВыгрузкиДанных;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПередЗагрузкойДанных") Тогда
		НоваяКонвертация.АлгоритмПередЗагрузкойДанных     = ОбщиеПеременные.Конвертация.ПередЗагрузкойДанных;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиДанных") Тогда
		НоваяКонвертация.АлгоритмПослеЗагрузкиДанных      = ОбщиеПеременные.Конвертация.ПослеЗагрузкиДанных;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПередВыгрузкойОбъекта") Тогда
		НоваяКонвертация.АлгоритмПередВыгрузкойОбъекта    = ОбщиеПеременные.Конвертация.ПередВыгрузкойОбъекта;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПередКонвертациейОбъекта") Тогда
		НоваяКонвертация.АлгоритмПередКонвертациейОбъекта = ОбщиеПеременные.Конвертация.ПередКонвертациейОбъекта;
	КонецЕсли;

	Если ОбщиеПеременные.Конвертация.Свойство("ПослеВыгрузкиОбъекта") Тогда
		НоваяКонвертация.АлгоритмПослеВыгрузкиОбъекта = ОбщиеПеременные.Конвертация.ПослеВыгрузкиОбъекта;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПередЗагрузкойОбъекта") Тогда
		НоваяКонвертация.АлгоритмПередЗагрузкойОбъекта = ОбщиеПеременные.Конвертация.ПередЗагрузкойОбъекта;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиОбъекта") Тогда
		НоваяКонвертация.АлгоритмПослеЗагрузкиОбъекта = ОбщиеПеременные.Конвертация.ПослеЗагрузкиОбъекта;
	КонецЕсли;
	
	Если ОбщиеПеременные.Конвертация.Свойство("ПередОтправкойИнформацииОбУдалении") Тогда
		НоваяКонвертация.АлгоритмПередОтправкойИнформацииОбУдалении = ОбщиеПеременные.Конвертация.ПередОтправкойИнформацииОбУдалении;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПриПолученииИнформацииОбУдалении") Тогда
		НоваяКонвертация.АлгоритмПриПолученииИнформацииОбУдалении = ОбщиеПеременные.Конвертация.ПриПолученииИнформацииОбУдалении;
	КонецЕсли;
	Если ОбщиеПеременные.Конвертация.Свойство("ПослеЗагрузкиПараметров") Тогда
		НоваяКонвертация.АлгоритмПослеЗагрузкиПараметров = ОбщиеПеременные.Конвертация.ПослеЗагрузкиПараметров;
	КонецЕсли;
	
	// Параметры.
	Для Каждого СтрокаТаблицы Из ОбщиеПеременные.Параметры Цикл
		НовыйПараметр = НоваяКонвертация.Параметры.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйПараметр, СтрокаТаблицы);
		
		Если НЕ ПустаяСтрока(СтрокаТаблицы.ТипОбъекта) Тогда
			
			СпрОбъект = Справочники.Объекты.НайтиПоНаименованию(СтрокаТаблицы.ТипОбъекта, ИСТИНА, , НоваяКонвертация.Конфигурация);
			Если СпрОбъект <> Справочники.Объекты.ПустаяСсылка() Тогда
				НовыйПараметр.ТипОбъекта = СпрОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОбщиеПеременные.Вставить("Конфигурация", НоваяКонвертация.Конфигурация);
	ОбщиеПеременные.Вставить("КонфигурацияКорреспондент", НоваяКонвертация.КонфигурацияКорреспондент);
	НоваяКонвертация.Записать();
	ЗагружаемаяКонвертация = НоваяКонвертация.Ссылка;

	
	ЗаписатьПКО(ОбщиеПеременные.ПравилаКонвертацииОбъектов, ЗагружаемаяКонвертация, ОбщиеПеременные);
	ЗаписатьАлгоритмы(ОбщиеПеременные.Алгоритмы, ЗагружаемаяКонвертация, ОбщиеПеременные);
	ЗаписатьЗапросы(ОбщиеПеременные.Запросы, ЗагружаемаяКонвертация, ОбщиеПеременные);
	ЗаписатьПВД(ОбщиеПеременные.ПравилаВыгрузкиДанных, ЗагружаемаяКонвертация, ОбщиеПеременные);
	Если ОбщиеПеременные.Обновление Тогда
		Для каждого СсылкаДляУдаления Из ОбщиеПеременные.ВсеПравилаКонвертации Цикл
			
			Если СсылкаДляУдаления.Значение.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектДляУдаления = СсылкаДляУдаления.Значение.ПолучитьОбъект();
			ОбъектДляУдаления.УстановитьПометкуУдаления(Истина, Ложь);
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьПКО(СтрокиПКО, Конвертация, ОбщиеПеременные, Родитель = "")
	
	Для каждого Строка Из СтрокиПКО.Строки Цикл
		Если Строка.ЭтоГруппа Тогда
			// Группы правил не создаются, обрабатываются вложенные в них строки.
			Если Родитель = "" Тогда
				ИмяРодителя = Строка.Имя;
			Иначе
				ИмяРодителя = Родитель + "\" +Строка.Имя; 
			КонецЕсли;
			ЗаписатьПКО(Строка, Конвертация, ОбщиеПеременные, ИмяРодителя);
			Продолжить;
		КонецЕсли;
		// Может быть ПравилоКонвертацииОбъекта, ПравилоКонвертацииПредопределенныхДанных или два правила сразу.
		ПКОСоздано = Ложь;
		Если Строка.Свойства.Строки.Количество() > 0 Тогда
			ЗаписатьЭлементПКО(Строка, Конвертация, ОбщиеПеременные, Истина, Родитель);
			ПКОСоздано = Истина;
		КонецЕсли;
		Если Строка.Значения.Строки.Количество() > 0 Тогда
			ЗаписатьЭлементПКО(Строка, Конвертация, ОбщиеПеременные, Ложь, Родитель);
			ПКОСоздано = Истина;
		КонецЕсли;
		Если НЕ ПКОСоздано Тогда
			// Тип правила определяем по виду объекта.
			ОбъектКонфигурации = ОпределитьОбъектКонфигурации(Строка.Источник, ОбщиеПеременные);
			ТипОбъекта = ОбъектКонфигурации.Тип;
			Если ТипОбъекта = Перечисления.ТипыОбъектов.Перечисление Тогда
				ЗаписатьЭлементПКО(Строка, Конвертация, ОбщиеПеременные, Ложь, Родитель);
			Иначе
				ЗаписатьЭлементПКО(Строка, Конвертация, ОбщиеПеременные, Истина, Родитель);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаписатьПКО()

Процедура ЗаписатьЭлементПКО(Строка, Конвертация, ОбщиеПеременные, ЭтоПКО, Родитель)
	Если ЭтоПКО Тогда
		ИмяСправочника = "ПравилаКонвертацииОбъектов";
	Иначе
		ИмяСправочника = "ПравилаКонвертацииПредопределенныхДанных";
	КонецЕсли;
	ПКО = НайтиИлиСоздатьЭлементКонвертации(Строка, ИмяСправочника, Конвертация, ОбщиеПеременные);
	
	ПКО.ГруппаПравил = Родитель;
	ПКО.ИспользоватьДляОтправки = Истина;
	
	ПКО.ОбъектКонфигурации = ОпределитьОбъектКонфигурации(Строка.Источник, ОбщиеПеременные);
	ПКО.ОбъектКонфигурацииКорреспондент = ОпределитьОбъектКонфигурации(Строка.Приемник, ОбщиеПеременные, Истина);
	Если НЕ ЭтоПКО Тогда
		ПКО.СопоставлениеЗначений.Очистить();
		ЗаписатьПКЗ(Строка.Значения, ПКО, ПКО.ОбъектКонфигурации, ПКО.ОбъектКонфигурацииКорреспондент);
	КонецЕсли;

	Если Строка.ЕстьОбработчикПередВыгрузкой Тогда
		ПКО.АлгоритмПередВыгрузкойОбъекта = Строка.ПередВыгрузкой;
	КонецЕсли;
	Если Строка.ЕстьОбработчикПриВыгрузке Тогда
		ПКО.АлгоритмПриВыгрузкеОбъекта    = Строка.ПриВыгрузке;
	КонецЕсли;
	Если Строка.ЕстьОбработчикПослеВыгрузки Тогда
		ПКО.АлгоритмПослеВыгрузкиОбъекта  = Строка.ПослеВыгрузки;
	КонецЕсли;
	Если Строка.ЕстьОбработчикПослеВыгрузкиВФайл Тогда
		ПКО.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена  = Строка.ПослеВыгрузкиВФайл;
	КонецЕсли;
	Если Строка.ЕстьОбработчикПередЗагрузкой Тогда
		ПКО.АлгоритмПередЗагрузкойОбъекта = Строка.ПередЗагрузкой;
	КонецЕсли;
	Если Строка.ЕстьОбработчикПриЗагрузке Тогда
		ПКО.АлгоритмПриЗагрузкеОбъекта    = Строка.ПриЗагрузке;
	КонецЕсли;
	Если Строка.ЕстьОбработчикПослеЗагрузки Тогда
		ПКО.АлгоритмПослеЗагрузкиОбъекта  = Строка.ПослеЗагрузки;
	КонецЕсли;

	Если НЕ ЭтоПКО Тогда
		ПКО.Записать();
		Возврат;
	КонецЕсли;
	ПКО.НеЗапоминатьВыгруженные            = Строка.НеЗапоминатьВыгруженные;
	Если НЕ Строка.СинхронизироватьПоИдентификатору Тогда
		ПКО.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоПолямПоиска;
	ИначеЕсли Строка.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли Тогда
		ПКО.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска;
	Иначе
		ПКО.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоУникальномуИдентификатору;
	КонецЕсли;
	ПКО.НеВыгружатьОбъектыСвойствПоСсылкам = Строка.НеВыгружатьОбъектыСвойствПоСсылкам;
	ПКО.НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска = Строка.НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска;
	ПКО.ИспользоватьБыстрыйПоискПриЗагрузке = Строка.ИспользоватьБыстрыйПоискПриЗагрузке;
	ПКО.ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки = Строка.ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки;
	ПКО.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD = Строка.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD;
	ПКО.НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике = Строка.НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике;
	ПКО.ГенерироватьНовыйНомерИлиКодЕслиНеУказан = Строка.ГенерироватьНовыйНомерИлиКодЕслиНеУказан;
	ПКО.НеЗамещать                         = Строка.НеЗамещать;
	ПКО.Порядок = Строка.Порядок;
	Если Не ПустаяСтрока(Строка.ПриоритетОбъектовОбмена) Тогда
		
		Если Строка.ПриоритетОбъектовОбмена = "Ниже" Тогда
			ПКО.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаНиже;
		ИначеЕсли Строка.ПриоритетОбъектовОбмена = "Совпадает" Тогда
			ПКО.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаСовпадает;
		КонецЕсли
		
	Иначе
		
		ПКО.ПриоритетОбъектовОбмена = Перечисления.ПриоритетОбъектовОбмена.ПриоритетПоступившегоПриОбменеОбъектаВыше;
		
	КонецЕсли;

	Если Строка.ЕстьОбработчикПоследовательностейПолейПоиска Тогда
		ПКО.АлгоритмПоследовательностьПолейПоиска  = Строка.ПоследовательностьПолейПоиска;
	КонецЕсли;

	ПКО.НастройкаВариантовПоискаОбъектовXML.Очистить();
	Если Строка.НастройкаВариантовПоискаОбъектов <> Неопределено
		И Строка.НастройкаВариантовПоискаОбъектов.Количество() > 0 Тогда
		
		Для Каждого СтрокаТаблицы Из Строка.НастройкаВариантовПоискаОбъектов Цикл
			
			СтрокаТабЧасти = ПКО.НастройкаВариантовПоискаОбъектовXML.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, СтрокаТаблицы);
			
		КонецЦикла;
		
	КонецЕсли;
	ПКО.Записать();
	ЗаписатьПКС(Строка.Свойства, ПКО.Ссылка, ПКО.ОбъектКонфигурации, ПКО.ОбъектКонфигурацииКорреспондент, Конвертация, ОбщиеПеременные);

КонецПроцедуры

Функция НайтиИлиСоздатьПКС(ПКС, СведенияПКС, Строка, ОбщиеПеременные)
	СоздаватьНовый = СведенияПКС.СоздаватьНовый;
	Владелец = СведенияПКС.Владелец;
	ОбъектИсточник = СведенияПКС.ОбъектИсточник;
	ОбъектПриемник = СведенияПКС.ОбъектПриемник;
	Родитель = СведенияПКС.Родитель;
	Если СоздаватьНовый Тогда
		
		Если Строка.ЭтоГруппа Тогда
			ПКС = Справочники.ПравилаКонвертацииСвойств.СоздатьГруппу();
		Иначе
			ПКС = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
		КонецЕсли;
		
		ПКС.Владелец     = Владелец;
		ПКС.Код          = Строка.Имя;
	КонецЕсли;
	
	СвойствоРодительИсточник = Неопределено;
	СвойствоРодительПриемник = Неопределено;
	Если Родитель <> Неопределено Тогда
		ПКС.Родитель = Родитель;
		ДанныеРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель,"СвойствоКонфигурации, СвойствоКонфигурацииКорреспондента");
		Если ЗначениеЗаполнено(ДанныеРодителя.СвойствоКонфигурации) Тогда
			СвойствоРодительИсточник = ДанныеРодителя.СвойствоКонфигурации;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеРодителя.СвойствоКонфигурацииКорреспондента) Тогда
			СвойствоРодительПриемник = ДанныеРодителя.СвойствоКонфигурацииКорреспондента;
		КонецЕсли;
	КонецЕсли;

	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.ВсеПравилаКонвертации.Удалить(ПКС.Ссылка);
	КонецЕсли;
	ПКС.ОбменДанными.Загрузка = Истина;
	ПКС.Наименование             = Строка.Наименование;
	Если ЗначениеЗаполнено(ОбъектИсточник) Тогда
		Если Строка.ЭтоГруппа Тогда
			ДанныеДляЗаполнения = Новый Структура("ЭтоГруппа, Вид", Строка.ЭтоГруппа, Строка.ВидИсточника);
		Иначе
			ДанныеДляЗаполнения = Новый Структура("ЭтоГруппа, Тип, Вид", Строка.ЭтоГруппа, Строка.ТипИсточника, Строка.ВидИсточника);
		КонецЕсли;
		ПКС.СвойствоКонфигурации = ОпределитьСвойствоКонфигурации(Строка.Источник, ОбъектИсточник, ДанныеДляЗаполнения, СвойствоРодительИсточник);
	КонецЕсли;
	Если НЕ Строка.ЭтоГруппа Тогда
		ПКС.ПолноеИмяСвойстваКонфигурации = Строка.Источник;
		Если ЗначениеЗаполнено(ПКС.Родитель) И ЗначениеЗаполнено(ПКС.СвойствоКонфигурации.Родитель) Тогда
			ПКС.ПолноеИмяСвойстваКонфигурации = СокрЛП(ДанныеРодителя.СвойствоКонфигурации) + "." + Строка.Источник;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектПриемник) Тогда
		Если Строка.ЭтоГруппа Тогда
			ДанныеДляЗаполнения = Новый Структура("ЭтоГруппа, Вид", Строка.ЭтоГруппа, Строка.ВидПриемника);
		Иначе
			ДанныеДляЗаполнения = Новый Структура("ЭтоГруппа, Тип, Вид", Строка.ЭтоГруппа, Строка.ТипПриемника, Строка.ВидПриемника);
		КонецЕсли;
		ПКС.СвойствоКонфигурацииКорреспондента = ОпределитьСвойствоКонфигурации(Строка.Приемник, ОбъектПриемник, ДанныеДляЗаполнения, СвойствоРодительПриемник);
	КонецЕсли;
	Если НЕ Строка.ЭтоГруппа Тогда
		ПКС.ПолноеИмяСвойстваКонфигурацииКорреспондента = Строка.Приемник;
		Если ЗначениеЗаполнено(ПКС.Родитель) И ЗначениеЗаполнено(ПКС.СвойствоКонфигурацииКорреспондента.Родитель) Тогда
			ПКС.ПолноеИмяСвойстваКонфигурацииКорреспондента = СокрЛП(ДанныеРодителя.СвойствоКонфигурацииКорреспондента) + "." + Строка.Приемник;
		КонецЕсли; 
	КонецЕсли;
	ПКС.ПолучитьИзВходящихДанных = Строка.ПолучитьИзВходящихДанных;
	ПКС.НеЗамещать               = Строка.НеЗамещать;
	ПКС.Отключить                = Строка.Отключить;
	ПКС.Порядок                  = Строка.Порядок;

	Если ЗначениеЗаполнено(Строка.ТипИсточника) Или ЗначениеЗаполнено(Строка.ТипПриемника) Тогда
		ПКС.ТипСвойстваКонфигурации = Строка.ТипИсточника;
		ПКС.ТипСвойстваКонфигурацииКорреспондента = Строка.ТипПриемника;
	Иначе
		ПКС.ТипСвойстваКонфигурации = Строка.ВидИсточника;
		ПКС.ТипСвойстваКонфигурацииКорреспондента = Строка.ВидПриемника;
	КонецЕсли;
		
	Если Строка.ЕстьОбработчикПередВыгрузкой Тогда
		ПКС.АлгоритмПередВыгрузкойСвойства  = Строка.ПередВыгрузкой;
	КонецЕсли;
		
	Если Строка.ЕстьОбработчикПриВыгрузке Тогда
		ПКС.АлгоритмПриВыгрузкеСвойства     = Строка.ПриВыгрузке;
	КонецЕсли;

	Если Строка.ЕстьОбработчикПослеВыгрузки Тогда
		ПКС.АлгоритмПослеВыгрузкиСвойства   = Строка.ПослеВыгрузки;
	КонецЕсли;	
		
КонецФункции

Процедура ЗаписатьПКС(СтрокиПКС, Владелец, ОбъектИсточник, ОбъектПриемник, Конвертация, ОбщиеПеременные, Родитель = Неопределено)

	Для каждого Строка Из СтрокиПКС.Строки Цикл
		
		СоздаватьНовый = Истина;
			
		Если ОбщиеПеременные.Обновление Тогда
			СсылкаПКС = Справочники.ПравилаКонвертацииСвойств.НайтиПоКоду(Строка.Имя, , , Владелец);
			Если НЕ СсылкаПКС.Пустая() Тогда
				ПКС = СсылкаПКС.ПолучитьОбъект();
				СоздаватьНовый = Ложь;
			КонецЕсли;
		КонецЕсли;
		СведенияПКС = Новый Структура("Родитель, Владелец, СоздаватьНовый", Родитель, Владелец, СоздаватьНовый);
		СведенияПКС.Вставить("ОбъектИсточник", ОбъектИсточник);
		СведенияПКС.Вставить("ОбъектПриемник", ОбъектПриемник);
		НайтиИлиСоздатьПКС(ПКС, СведенияПКС, Строка, ОбщиеПеременные);

		Если Строка.ЭтоГруппа Тогда

			НоваяГруппаПКС = ПКС;
					
			Если Строка.ЕстьОбработчикПередОбработкойВыгрузки Тогда
				НоваяГруппаПКС.АлгоритмПередОбработкойВыгрузки = Строка.ПередОбработкойВыгрузки;
			КонецЕсли;

			Если Строка.ЕстьОбработчикПослеОбработкиВыгрузки Тогда
				НоваяГруппаПКС.АлгоритмПослеОбработкиВыгрузки  = Строка.ПослеОбработкиВыгрузки;
			КонецЕсли;

			НоваяГруппаПКС.ОбменДанными.Загрузка = Истина;
			
			НоваяГруппаПКС.ВыгружатьГруппуЧерезФайл = Строка.ВыгружатьГруппуЧерезФайл;
			НоваяГруппаПКС.ОбменДанными.Загрузка = Истина;
			НоваяГруппаПКС.ИспользуетсяАлгоритмКонвертации = НЕ ПустаяСтрока(НоваяГруппаПКС.АлгоритмПередВыгрузкойСвойства)
				Или НЕ ПустаяСтрока(НоваяГруппаПКС.АлгоритмПриВыгрузкеСвойства) Или НЕ ПустаяСтрока(НоваяГруппаПКС.АлгоритмПослеВыгрузкиСвойства)
				Или НЕ ПустаяСтрока(НоваяГруппаПКС.АлгоритмПередОбработкойВыгрузки)
				Или НЕ ПустаяСтрока(НоваяГруппаПКС.АлгоритмПослеОбработкиВыгрузки);
						
			НоваяГруппаПКС.Записать();
			
			ЗаписатьПКС(Строка, Владелец, ОбъектИсточник, ОбъектПриемник, Конвертация, ОбщиеПеременные, НоваяГруппаПКС.Ссылка);
			
		Иначе
			
			НовоеПКС = ПКС;
									
			НовоеПКС.Поиск = Строка.Поиск;
			
			НовоеПКС.АвтоматическиПриводитьЗначениеКДлинеПриемника = Строка.ПриводитьКДлине;
			НовоеПКС.ИмяПараметраДляПередачи = Строка.ИмяПараметраДляПередачи;
			НовоеПКС.ПоискПоДатеНаРавенство = Строка.ПоискПоДатеНаРавенство;
						
			НовоеПКС.ОбменДанными.Загрузка = Истина;
			НовоеПКС.ИспользуетсяАлгоритмКонвертации = НЕ ПустаяСтрока(НовоеПКС.АлгоритмПередВыгрузкойСвойства)
				Или НЕ ПустаяСтрока(НовоеПКС.АлгоритмПриВыгрузкеСвойства) Или НЕ ПустаяСтрока(НовоеПКС.АлгоритмПослеВыгрузкиСвойства);
			
			НовоеПКС.ПравилоКонвертацииСвойства = Строка.ПравилоКонвертации;
			НовоеПКС.Записать(); 			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // ЗаписатьПКС()

Процедура ЗаписатьПКЗ(СтрокиПКЗ, Владелец, Источник, Приемник)
	
	Для каждого Строка Из СтрокиПКЗ.Строки Цикл
		ПКЗ = Владелец.СопоставлениеЗначений.Добавить();
		ПКЗ.ЗначениеКонфигурации = Строка.Источник;
		ПКЗ.ЗначениеКонфигурацииКорреспондент = Строка.Приемник;
		
		// Проверка наличия значений
		Если ЗначениеЗаполнено(Строка.Источник) И ЗначениеЗаполнено(Источник) И ТипЗнч(Источник) = Тип("СправочникСсылка.Объекты") Тогда
			ЗначениеИсточник = Справочники.Значения.НайтиПоНаименованию(Строка.Источник, Истина,, Источник);
			Если НЕ ЗначениеЗаполнено(ЗначениеИсточник) Тогда
				ЗначениеОбъект = Справочники.Значения.СоздатьЭлемент();
				ЗначениеОбъект.ПометкаУдаления = Истина;
				ЗначениеОбъект.Наименование = Строка.Источник;
				ЗначениеОбъект.Владелец = Источник;
				ЗначениеОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Приемник) И ЗначениеЗаполнено(Приемник) И ТипЗнч(Приемник) = Тип("СправочникСсылка.Объекты") Тогда
			ЗначениеПриемник = Справочники.Значения.НайтиПоНаименованию(Строка.Приемник, Истина,, Приемник);
			Если НЕ ЗначениеЗаполнено(ЗначениеПриемник) Тогда
				ЗначениеОбъект = Справочники.Значения.СоздатьЭлемент();
				ЗначениеОбъект.ПометкаУдаления = Истина;
				ЗначениеОбъект.Наименование = Строка.Приемник;
				ЗначениеОбъект.Владелец = Приемник;
				ЗначениеОбъект.Записать();
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры // ЗаписатьПКЗ()

Процедура ЗаписатьАлгоритмы(СтрокиАлгоритмы, Конвертация, ОбщиеПеременные, Родитель = "")

	Для каждого Строка Из СтрокиАлгоритмы.Строки Цикл
		Если Строка.ЭтоГруппа Тогда
			Если Родитель = "" Тогда
				ИмяРодителя = Строка.Код;
			Иначе
				ИмяРодителя = Родитель + "\" +Строка.Код; 
			КонецЕсли;
			ЗаписатьАлгоритмы(Строка, Конвертация, ОбщиеПеременные, ИмяРодителя);
			Продолжить;
		КонецЕсли;
		Алгоритм = НайтиИлиСоздатьЭлементКонвертации(Строка, "Алгоритмы", Конвертация, ОбщиеПеременные);

		Алгоритм.ГруппаПравил = Родитель;
		Алгоритм.Алгоритм = Строка.Алгоритм;
		Алгоритм.ИспользуетсяПриЗагрузке = Строка.ИспользуетсяПриЗагрузке;
		Алгоритм.Параметры = Строка.Параметры;

		Алгоритм.Записать();

	КонецЦикла;

КонецПроцедуры // ЗаписатьАлгоритмы()

Процедура ЗаписатьЗапросы(СтрокиЗапросы, Конвертация, ОбщиеПеременные, Родитель = "")

	Для каждого Строка Из СтрокиЗапросы.Строки Цикл
		Если Строка.ЭтоГруппа Тогда
			Если Родитель = "" Тогда
				ИмяРодителя = Строка.Код;
			Иначе
				ИмяРодителя = Родитель + "\" +Строка.Код; 
			КонецЕсли;
			ЗаписатьЗапросы(Строка, Конвертация, ОбщиеПеременные, ИмяРодителя);
			Продолжить;
		КонецЕсли;
		Запрос = НайтиИлиСоздатьЭлементКонвертации(Строка, "Запросы", Конвертация, ОбщиеПеременные);
		Запрос.ТекстЗапроса = Строка.ТекстЗапроса;
		Запрос.ГруппаПравил = Родитель;
		Запрос.ИспользуетсяПриЗагрузке = Строка.ИспользуетсяПриЗагрузке;

		Запрос.Записать();
	КонецЦикла;

КонецПроцедуры // ЗаписатьЗапросы()

Процедура ЗаписатьПВД(СтрокиПВД, Конвертация, ОбщиеПеременные, Родитель = "")
	Для каждого Строка Из СтрокиПВД.Строки Цикл
		Если Строка.ЭтоГруппа Тогда
			Если НЕ Строка.Отключить Тогда
				Если Родитель = "" Тогда
					ИмяРодителя = Строка.Имя;
				Иначе
					ИмяРодителя = Родитель + "\" +Строка.Имя; 
				КонецЕсли;
				// Элементы отключенной группы не загружаем.
				ЗаписатьПВД(Строка, Конвертация, ОбщиеПеременные, ИмяРодителя);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		ПВД = НайтиИлиСоздатьЭлементКонвертации(Строка, "ПравилаОбработкиДанных", Конвертация, ОбщиеПеременные);
		ПВД.ИспользоватьДляОтправки = Истина;
		ПВД.ГруппаПравил = Родитель;
		Если НРег(СокрЛП(Строка.СпособОтбораДанных)) = НРег("ПроизвольныйАлгоритм") Тогда
			ПВД.СпособВыборки = 1;
		Иначе
			ПВД.СпособВыборки = 0;
		КонецЕсли;
		ПВД.Отключить = Строка.Отключить;
		
		ПВД.ВыбиратьДанныеДляВыгрузкиОднимЗапросом    = Строка.ВыбиратьДанныеДляВыгрузкиОднимЗапросом;
		ПВД.НеВыгружатьОбъектыСозданныеВБазеПриемнике = Строка.НеВыгружатьОбъектыСозданныеВБазеПриемнике;

		ПВД.ОбъектВыборки = ОпределитьОбъектКонфигурации(Строка.ОбъектВыборки, ОбщиеПеременные);

		ПВД.ПравилоКонвертацииОбъекта = Строка.ПравилоКонвертации;

		ПВД.АлгоритмПередОбработкойПравила = Строка.ПередОбработкой;
		ПВД.АлгоритмПослеОбработкиПравила  = Строка.ПослеОбработки;
		ПВД.АлгоритмПередВыгрузкойОбъекта  = Строка.ПередВыгрузкой;
		ПВД.АлгоритмПослеВыгрузкиОбъекта   = Строка.ПослеВыгрузки;
		ПВД.Комментарий = Строка.Комментарий;
		ПВД.Описание = Строка.Описание;
		ПВД.Записать();
	КонецЦикла;

КонецПроцедуры

Функция НайтиИлиСоздатьЭлементКонвертации(СтрокаДанные, ИмяСправочника, Конвертация, ОбщиеПеременные)
	СоздаватьНовый = Истина;
	Если ИмяСправочника = "ПравилаОбработкиДанных" Тогда
		РеквизитПоиска = "Наименование";
	Иначе
		РеквизитПоиска = "Код";
	КонецЕсли;
	РеквизитДанных = "Имя";
	Если ИмяСправочника = "Алгоритмы" Или ИмяСправочника = "Запросы" Тогда
		РеквизитДанных = "Код";
	КонецЕсли;
	Если ОбщиеПеременные.Обновление Тогда
		// Поиск существующего элемента конвертации.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЭлементКонвертации.Ссылка КАК СсылкаПравило,
		|	Состав.Ссылка КАК СсылкаСостав
		|ИЗ Справочник." + ИмяСправочника + " КАК ЭлементКонвертации
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = ЭлементКонвертации.Ссылка
		|	И Состав.Владелец = &Конвертация
		|	И Состав.Отключить = ЛОЖЬ
		|ГДЕ ЭлементКонвертации.Ссылка." + РеквизитПоиска + " = &Имя";
		Запрос.УстановитьПараметр("Конвертация", Конвертация);
		Запрос.УстановитьПараметр("Имя", СтрокаДанные[РеквизитДанных]);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЭлементКонвертации = Выборка.СсылкаПравило.ПолучитьОбъект();
			СоздаватьНовый = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если СоздаватьНовый Тогда
		ЭлементКонвертации = Справочники[ИмяСправочника].СоздатьЭлемент();
		ЭлементКонвертации[РеквизитПоиска] = СтрокаДанные[РеквизитДанных];
		УИД = Новый УникальныйИдентификатор;
		ЭлементКонвертации.УстановитьСсылкуНового(Справочники[ИмяСправочника].ПолучитьСсылку(УИД));
		
		СоставКонвертации = Справочники.СоставыКонвертаций.СоздатьЭлемент();
		СоставКонвертации.Владелец = Конвертация;
		СоставКонвертации.ЭлементКонвертации = ЭлементКонвертации.ПолучитьСсылкуНового();
		СоставКонвертации.Записать();
	КонецЕсли;
			
	Если ОбщиеПеременные.Обновление Тогда
		ОбщиеПеременные.ВсеПравилаКонвертации.Удалить(ЭлементКонвертации.Ссылка);
	КонецЕсли;
	Если ИмяСправочника = "ПравилаКонвертацииОбъектов"
		Или ИмяСправочника = "ПравилаОбработкиДанных"
		Или ИмяСправочника = "ПравилаКонвертацииПредопределенныхДанных" Тогда
		ЭлементКонвертации.Порядок      = СтрокаДанные.Порядок;
	КонецЕсли;
	Если ИмяСправочника <> "Запросы" Тогда
		ЭлементКонвертации.ТипКонвертации = Перечисления.ТипыКонвертаций.XML;
	КонецЕсли;
	ЭлементКонвертации.ОбменДанными.Загрузка = Истина;
	Возврат ЭлементКонвертации;
КонецФункции

Процедура УдалитьЭлементыКонвертации(Конвертация, ИмяСправочника)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|СоставСвой.Ссылка КАК СоставСсылка,
	|Правило.Ссылка КАК ЭлементСсылка,
	|ВЫБОР КОГДА СоставЧужой.Ссылка IS NULL ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК УдалитьЭлемент
	|ИЗ Справочник." + ИмяСправочника + " КАК Правило
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставСвой
	|ПО СоставСвой.ЭлементКонвертации = Правило.Ссылка
	|	И СоставСвой.Владелец = &Конвертация
	|	И СоставСвой.Отключить = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК СоставЧужой
	|ПО СоставСвой.ЭлементКонвертации = Правило.Ссылка
	|	И СоставСвой.Владелец <> &Конвертация
	|";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// Удаление элемента из состава конвертации.
		СоставОбъект = Выборка.СоставСсылка.ПолучитьОбъект();
		СоставОбъект.Удалить();
		
		// Удаление элемента, если на него нет ссылок из других конвертаций.
		Если Выборка.УдалитьЭлемент Тогда
			
			ЭлементОбъект = Выборка.ЭлементСсылка.ПолучитьОбъект();
			Если ЭлементОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЭлементОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьВсеПравилаКонвертации(Конвертация, ОбщиеПеременные)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|СоставСвой.Ссылка
	|ИЗ Справочник.СоставыКонвертаций КАК СоставСвой
	|ГДЕ СоставСвой.ЭлементКонвертации = ЭлементКонвертации.Ссылка
	|	И СоставСвой.Владелец = &Конвертация
	|	И СоставСвой.Отключить = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|ЭлементКонвертации.Ссылка
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК ЭлементКонвертации
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК СоставСвой
	|ПО СоставСвой.ЭлементКонвертации = ЭлементКонвертации.Владелец
	|	И СоставСвой.Владелец = &Конвертация
	|	И СоставСвой.Отключить = ЛОЖЬ
	|ГДЕ СоставСвой.ЭлементКонвертации IS NOT NULL
	|";
	ВсеПравилаКонвертации = Новый Соответствие;
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВсеПравилаКонвертации.Вставить(Выборка.Ссылка, Выборка.Ссылка);
	КонецЦикла;
	ОбщиеПеременные.Вставить("ВсеПравилаКонвертации", ВсеПравилаКонвертации);
КонецПроцедуры

// Осуществляет инициализацию объектов, определяющих базовые типы
// Параметры:
//  Владелец       - ссылка на элемент справочника "Конфигурации",
//                   являющуюся владельцем инициализируемых объектов.
// 
Процедура ИнициализацияГруппОбъектов(Владелец)

	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "КонстантыНабор", "КонстантыНабор", НСтр("ru='Набор констант'"), Перечисления.ТипыОбъектов.НаборКонстант);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Число", "Число", "Число", Перечисления.ТипыОбъектов.Число);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Строка", "Строка", "Строка", Перечисления.ТипыОбъектов.Строка);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Дата", "Дата", "Дата", Перечисления.ТипыОбъектов.Дата);


	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "Булево", "Булево", "Булево", Перечисления.ТипыОбъектов.Булево);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "ХранилищеЗначения", "ХранилищеЗначения", НСтр("ru='Хранилище значения'"), Перечисления.ТипыОбъектов.ХранилищеЗначения);
	СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, "УникальныйИдентификатор", "УникальныйИдентификатор", НСтр("ru='Уникальный идентификатор'"), Перечисления.ТипыОбъектов.УникальныйИдентификатор);

КонецПроцедуры // ИнициализацияГруппОбъектов()

Функция СоздатьБазовыйЭлементДляОбъектовКонфигурации(Владелец, НаименованиеЭлемента, ИмяЭлемента = "", СинонимЭлемента = "", Тип = Неопределено)
	
	ЭлементКонфигурации = Справочники.Объекты.НайтиПоНаименованию(НаименованиеЭлемента, 1,, Владелец);
	
	Если ЭлементКонфигурации.Пустая() Тогда
		
		Если Тип = Неопределено Тогда
			НовыйЭлемент = Справочники.Объекты.СоздатьГруппу();
		Иначе
			НовыйЭлемент = Справочники.Объекты.СоздатьЭлемент();
		КонецЕсли;	

        НовыйЭлемент.Владелец     = Владелец;
        НовыйЭлемент.Имя          = ?(ПустаяСтрока(ИмяЭлемента), Справочники.Объекты.ПолучитьИмяГруппыОбъектовПоНаименованию(НаименованиеЭлемента), ИмяЭлемента);
		НовыйЭлемент.Наименование = НаименованиеЭлемента;
		НовыйЭлемент.Синоним      = ?(ПустаяСтрока(СинонимЭлемента), ИмяЭлемента, СинонимЭлемента);
		Если Тип <> Неопределено Тогда
			НовыйЭлемент.Тип = Тип;
		КонецЕсли;
		НовыйЭлемент.Записать();
		
		Возврат НовыйЭлемент.Ссылка;
		
	Иначе	
		
		Возврат ЭлементКонфигурации;
		
	КонецЕсли;	
	
КонецФункции

// Читает текст элемента и приводит значение к указанному типу
//
// Параметры:
//  Объект           - объект типа XMLЧтение, из которого происходит чтение
//  Тип              - тип получаемого значения
//  ИскатьПоСвойству - для ссылочных типов может быть указано свойство, по которому
//                     следует искать объект: "Код", "Наименование", <ИмяРеквизита>, "Имя" (предопределенного значения)
//
// Возвращаемое значение:
//  Значение xml-элемента, приведенное к соответствующему типу
//
Функция одЗначениеЭлемента(Объект, Знач Тип = Неопределено)
	Если Тип = Неопределено Тогда
		Тип = Тип("Строка");
	КонецЕсли;

	Значение = "";
	Имя      = Объект.ЛокальноеИмя;

	Пока Объект.Прочитать() Цикл
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		Если ТипУзла = ТипУзлаXML.Текст Тогда
			Значение = СокрП(Объект.Значение);
		ИначеЕсли (ИмяУзла = Имя) И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			Прервать;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат XMLЗначение(Тип, Значение);	
	
КонецФункции // одЗначениеЭлемента() 

// Читает значение атрибута по имени из указанного объекта, приводит значение
// к указанному примитивному типу
//
// Параметры:
//  Объект      - объект типа XMLЧтение, спозиционированный на начале элемента,
//                атрибут которого требуется получить
//  Тип         - Значение типа Тип. Тип атрибута. Если не передан, значит Строка
//  Имя         - Строка. Имя атрибута
//
// Возвращаемое значение:
//  Значение атрибута полученное по имени и приведенное к указанному типу
// 
Функция одАтрибут(Объект, Имя, Знач Тип = Неопределено)
	Если Тип = Неопределено Тогда
		Тип = Тип("Строка");
	КонецЕсли;
	СтрЗначение = СокрП(Объект.ПолучитьАтрибут(Имя));
	Если Не ПустаяСтрока(СтрЗначение) Тогда
		Возврат XMLЗначение(Тип, СтрЗначение);
	Иначе
		Если Тип = Тип("Строка") Тогда  // Строка
			Возврат ""; 
		ИначеЕсли Тип = Тип("Булево") Тогда
			Возврат Ложь;
		ИначеЕсли Тип = Тип("Число") Тогда
			Возврат 0;
		ИначеЕсли Тип = Тип("Дата") Тогда
			Возврат Дата("01.01.0001 00:00:00");
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции // одАтрибут() 

Функция одОписаниеТипа(ЗначениеТипа)

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип(ЗначениеТипа));
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);

	Возврат ОписаниеТипов;

КонецФункции // одОписаниеТипа()

// Пропускает узлы xml до конца указанного элемента (по умолчанию текущего)
//
// Параметры:
//  Объект   - объект типа XMLЧтение
//  Имя      - имя узла, до конца которого пропускаем элементы
// 
Процедура одПропустить(Объект, Имя="")

	КолвоВложений = 0; // количество одноименных вложений

	Если Имя = "" Тогда
		Имя = Объект.ЛокальноеИмя;	
	КонецЕсли; 
	
	Пока Объект.Прочитать() Цикл
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		Если ИмяУзла = Имя Тогда
			Если ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				Если КолвоВложений = 0 Тогда
					Прервать;
				Иначе
					КолвоВложений = КолвоВложений - 1;
				КонецЕсли; 
			ИначеЕсли ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				КолвоВложений = КолвоВложений + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // одПропустить() 

Процедура ИнициализацияТаблицыПКС(ОбщиеПеременные)
	Таб = Новый ДеревоЗначений;
	Колонки = Таб.Колонки;

	Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Порядок");

	Колонки.Добавить("ЭтоГруппа", одОписаниеТипа("Булево"));
    Колонки.Добавить("ПравилаГруппы");

	Колонки.Добавить("ВидИсточника");
	Колонки.Добавить("ВидПриемника");

	Колонки.Добавить("ТипИсточника");
	Колонки.Добавить("ТипПриемника");
	
	Колонки.Добавить("СтрокаТипИсточника");
	Колонки.Добавить("СтрокаТипПриемника");
	
	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");
	
	Колонки.Добавить("СтрокаИсточник");
	Колонки.Добавить("СтрокаПриемник");

	Колонки.Добавить("ПравилоКонвертации");

	Колонки.Добавить("ПолучитьИзВходящихДанных", одОписаниеТипа("Булево"));
	Колонки.Добавить("ВыгружатьГруппуЧерезФайл", одОписаниеТипа("Булево"));
	
	Колонки.Добавить("НеЗамещать", одОписаниеТипа("Булево"));
	Колонки.Добавить("Поиск", 	   одОписаниеТипа("Булево"));
	Колонки.Добавить("Отключить",  одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ПередВыгрузкой");
	Колонки.Добавить("ПриВыгрузке");
	Колонки.Добавить("ПослеВыгрузки");

	Колонки.Добавить("ПередОбработкойВыгрузки");
	Колонки.Добавить("ПослеОбработкиВыгрузки");

	Колонки.Добавить("ЕстьОбработчикПередВыгрузкой",			одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПриВыгрузке",				одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеВыгрузки",				одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ЕстьОбработчикПередОбработкойВыгрузки",	одОписаниеТипа("Булево"));
	Колонки.Добавить("ЕстьОбработчикПослеОбработкиВыгрузки",	одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ПриводитьКДлине",	одОписаниеТипа("Булево"));
	
	Колонки.Добавить("ИмяПараметраДляПередачи");
	Колонки.Добавить("ПоискПоДатеНаРавенство",	одОписаниеТипа("Булево"));
	ОбщиеПеременные.Вставить("ТаблицаПравилКонвертацииСвойств", Таб);
КонецПроцедуры

Процедура ИнициализацияТаблицыПКЗ(ОбщиеПеременные)
	Таб = Новый ДеревоЗначений;
	Колонки = Таб.Колонки;

	Колонки.Добавить("ЭтоГруппа", одОписаниеТипа("Булево"));
    Колонки.Добавить("Имя");
	Колонки.Добавить("Наименование");
	Колонки.Добавить("Источник");
	Колонки.Добавить("Приемник");
	Колонки.Добавить("Комментарий");
	Колонки.Добавить("Описание");
	Колонки.Добавить("Порядок");
	ОбщиеПеременные.Вставить("ТаблицаПравилКонвертацииЗначений", Таб);
КонецПроцедуры // ИнициализацияТаблицыПравилКонвертацииСвойств()

Процедура ИнициализацияТаблицуНастроекВариантовПоиска(ОбщиеПеременные)
	Таб = Новый ДеревоЗначений;
	
	Колонки = Таб.Колонки;

	Колонки.Добавить("ИмяНастройкиДляАлгоритма");
	Колонки.Добавить("ИмяНастройкиДляПользователя");
	Колонки.Добавить("ОписаниеНастройкиДляПользователя");
	ОбщиеПеременные.Вставить("ТаблицаНастроекВариантовПоиска", Таб);
	
КонецПроцедуры

Функция ПолучитьИмяФайлаДляЧтенияДанных(ОбщиеПеременные, ФайлЗапакован, ФлагОшибки)
	ИмяФайлаДляЧтенияДанных = "";

	Файл = Новый Файл(ОбщиеПеременные.ИмяФайлаПравил);
	Если НЕ Файл.Существует() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не найден файл с именем'") + ": " + ОбщиеПеременные.ИмяФайлаПравил);
		ФлагОшибки = Истина;
	ИначеЕсли НЕ Файл.ЭтоФайл() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Файл является каталогом'") + ": " + ОбщиеПеременные.ИмяФайлаПравил);
		ФлагОшибки = Истина;
	КонецЕсли;
	Возврат ОбщиеПеременные.ИмяФайлаПравил;
КонецФункции

Функция ОпределитьОбъектКонфигурации(ИмяОбъекта, ОбщиеПеременные, Корреспондент = Ложь)
	Если НЕ ЗначениеЗаполнено(ИмяОбъекта) Тогда
		Возврат Справочники.Объекты.ПустаяСсылка();
	КонецЕсли;
	Если Корреспондент Тогда
		ТекКонфигурация = ОбщиеПеременные.КонфигурацияКорреспондент;
	Иначе
		ТекКонфигурация = ОбщиеПеременные.Конфигурация;
	КонецЕсли;
	ТекСсылка = Справочники.Объекты.НайтиПоНаименованию(ИмяОбъекта, Истина,,ТекКонфигурация);
	Если ЗначениеЗаполнено(ТекСсылка) Тогда
		Возврат ТекСсылка;
	КонецЕсли;
	// Создание нового объекта и пометка его на удаление.
	ТекОбъект = Справочники.Объекты.СоздатьЭлемент();
	ТекОбъект.ПометкаУдаления = Истина;
	ТекОбъект.Наименование = ИмяОбъекта;
	ТекОбъект.Владелец = ТекКонфигурация;
	ТекОбъект.Записать();
	Возврат ТекОбъект.Ссылка;
КонецФункции

Функция ОпределитьСвойствоКонфигурации(ИмяСвойства, ОбъектКонфигурации, ДанныеДляЗаполнения, СвойствоРодитель = Неопределено)
	Если НЕ ЗначениеЗаполнено(ИмяСвойства) Тогда
		Возврат Справочники.Свойства.ПустаяСсылка();
	КонецЕсли;
	СвойствоСсылка = Справочники.Свойства.ПустаяСсылка();
	ЗапросСвойство = Новый Запрос;
	ЗапросСвойство.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ Справочник.Свойства
	|ГДЕ Родитель = &Родитель И Владелец = &Владелец И (Наименование = &Наименование Или Наименование = &Наименование2)
	|	И ЭтоГруппа = &ЭтоГруппа 
	|УПОРЯДОЧИТЬ ПО ПометкаУдаления ВОЗР";
	ВидСсылкой = Перечисления.ВидыСвойств.ПустаяСсылка();
	Если ДанныеДляЗаполнения.Свойство("Вид") И ЗначениеЗаполнено(ДанныеДляЗаполнения.Вид) Тогда
		Попытка
			ВидСсылкой = Перечисления.ВидыСвойств[ДанныеДляЗаполнения.Вид];
		Исключение
			ВидСсылкой = Перечисления.ВидыСвойств.ПустаяСсылка();
		КонецПопытки;
		Если ЗначениеЗаполнено(ВидСсылкой) Тогда
			Если ВидСсылкой = Перечисления.ВидыСвойств.Свойство Или ВидСсылкой = Перечисления.ВидыСвойств.Реквизит Тогда
				Виды = Новый Массив;
				Виды.Добавить(Перечисления.ВидыСвойств.Реквизит);
				Виды.Добавить(Перечисления.ВидыСвойств.Свойство);
				ЗапросСвойство.УстановитьПараметр("Вид", Виды);

				ЗапросСвойство.Текст = СтрЗаменить(ЗапросСвойство.Текст, "ГДЕ", "ГДЕ Вид В (&Вид) И ");
			Иначе
				ЗапросСвойство.УстановитьПараметр("Вид", ВидСсылкой);
				ЗапросСвойство.Текст = СтрЗаменить(ЗапросСвойство.Текст, "ГДЕ", "ГДЕ Вид = &Вид И ");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ЗапросСвойство.УстановитьПараметр("Родитель", ?(ЗначениеЗаполнено(СвойствоРодитель), СвойствоРодитель, Справочники.Свойства.ПустаяСсылка()));
	ЗапросСвойство.УстановитьПараметр("Владелец", ОбъектКонфигурации);
	Если ДанныеДляЗаполнения.ЭтоГруппа И (ВидСсылкой = Перечисления.ВидыСвойств.НаборДвиженийРегистраБухгалтерии
		Или ВидСсылкой = Перечисления.ВидыСвойств.НаборДвиженийРегистраНакопления
		Или ВидСсылкой = Перечисления.ВидыСвойств.НаборДвиженийРегистраРасчета
		Или ВидСсылкой = Перечисления.ВидыСвойств.НаборДвиженийРегистраСведений) Тогда
		Если СтрНайти(СокрЛП(ИмяСвойства), "{") = 0 Тогда
			ЗапросСвойство.УстановитьПараметр("Наименование", СокрЛП(ИмяСвойства));
			ЗапросСвойство.УстановитьПараметр("Наименование2", "{" + СокрЛП(ИмяСвойства) + "}"); 
			ИмяСвойства = "{" + СокрЛП(ИмяСвойства) + "}";
		Иначе
			Наименование2 = СтрЗаменить(СокрЛП(ИмяСвойства), "{", "");
			Наименование2 = СтрЗаменить(СокрЛП(Наименование2), "}", "");
			ЗапросСвойство.УстановитьПараметр("Наименование2", СокрЛП(ИмяСвойства));
			ЗапросСвойство.УстановитьПараметр("Наименование", Наименование2);
			ИмяСвойства = СокрЛП(ИмяСвойства); 
		КонецЕсли;
	Иначе
		ЗапросСвойство.УстановитьПараметр("Наименование", СокрЛП(ИмяСвойства));
		ЗапросСвойство.УстановитьПараметр("Наименование2", СокрЛП(ИмяСвойства));
		ИмяСвойства = СокрЛП(ИмяСвойства);
	КонецЕсли;


	ЗапросСвойство.УстановитьПараметр("ЭтоГруппа", ДанныеДляЗаполнения.ЭтоГруппа);
	ВыборкаСвойство = ЗапросСвойство.Выполнить().Выбрать();
	Если ВыборкаСвойство.Следующий() Тогда
		СвойствоСсылка = ВыборкаСвойство.Ссылка;
	КонецЕсли;
	Если ЗначениеЗаполнено(СвойствоСсылка) Тогда
		Возврат СвойствоСсылка;
	КонецЕсли;
	
	// Создаем новое свойство и помечаем на удаление (есть в правилах но нет в структуре метаданных).
	Если ДанныеДляЗаполнения.ЭтоГруппа Тогда
		СвойствоОбъект = Справочники.Свойства.СоздатьГруппу();
		Если ЗначениеЗаполнено(ВидСсылкой) Тогда
			СвойствоОбъект.Вид = ВидСсылкой;
		Иначе
			СвойствоОбъект.Вид = Перечисления.ВидыСвойств.ТабличнаяЧасть;
		КонецЕсли;
	Иначе
		СвойствоОбъект = Справочники.Свойства.СоздатьЭлемент();
		СвойствоОбъект.Вид = ВидСсылкой;
	КонецЕсли;
	СвойствоОбъект.Владелец = ОбъектКонфигурации;
	СвойствоОбъект.ПометкаУдаления = Истина;
	СвойствоОбъект.Родитель = СвойствоРодитель;
	СвойствоОбъект.Наименование = ИмяСвойства;
	Если ДанныеДляЗаполнения.Свойство("Тип") И ЗначениеЗаполнено(ДанныеДляЗаполнения.Тип) Тогда
		СвойствоОбъект.ТипыСтрокой = ДанныеДляЗаполнения.Тип;
	КонецЕсли;
	СвойствоОбъект.ОбменДанными.Загрузка = Истина;
	СвойствоОбъект.Записать();
	Возврат СвойствоОбъект.Ссылка;
КонецФункции
#КонецОбласти

#КонецЕсли
