#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Выполняет загрузку правил регистрации из файла.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при загрузке.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения загрузки.
Процедура ВыполнитьЗагрузкуРегистрации(ОбщиеПеременные, АдресВременногоХранилища) Экспорт 
 	ОбщиеПеременные.Вставить("Ошибки", ""); 
	ОбщиеПеременные.Вставить("Отказ", Ложь);
	ОбщиеПеременные.Вставить("СообщениеОРезультате", "");
    ОбщиеПеременные.Вставить("ТекущийТег", Новый Массив);   
	ОбщиеПеременные.Вставить("ТегОткрытие", "");
	ОбщиеПеременные.Вставить("ТегЗакрытие", "");
	ОбщиеПеременные.Вставить("ДанныеДляЗагрузки", Неопределено);
 	ОбщиеПеременные.Вставить("ШаблонДереваОтборПоСвойствамПланаОбмена", ИнициализацияТаблицыОтборПоСвойствамПланаОбмена(Ложь));
	ОбщиеПеременные.Вставить("ШаблонДереваОтборПоСвойствамОбъекта", ИнициализацияТаблицыОтборПоСвойствамОбъекта(Ложь));
	ОбщиеПеременные.Вставить("ШаблонДереваСвойствОбъекта", ИнициализацияТаблицыИлиДереваСвойств());
	ОбщиеПеременные.Вставить("ШаблонТаблицыСвойствОбъекта", ИнициализацияТаблицыИлиДереваСвойств(Ложь));
	ОбщиеПеременные.Вставить("ОтборыПоСвойствамПланаОбмена", Новый Соответствие);
	ОбщиеПеременные.Вставить("ОтборыПоСвойствамОбъекта", Новый Соответствие); 
	ОбщиеПеременные.Вставить("СтруктураРегистрации", ИнициализацияРегистрации());
	ОбщиеПеременные.Вставить("ЭлементыСправочникаОбъекты", Новый Соответствие);
	ОбщиеПеременные.Вставить("СовместнаяРабота", Константы.СовместнаяРабота.Получить());
	ОбщиеПеременные.Вставить("ЗахваченныеПравила", Новый Массив);
	Если ОбщиеПеременные.СовместнаяРабота И НЕ ОбщиеПеременные.СоздатьНовуюРегистрацию Тогда
		// Получим ПРО которые захвачены другими пользователями и не могут загружаться.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ДанныеЗахвата.Объект КАК СсылкаПравило,
		|	Правило.Ссылка КАК ИсходноеПравило
		|ИЗ Справочник.ПравилаРегистрацииОбъектов КАК Правило
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник.ПравилаРегистрацииОбъектов
		|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
		|ПО ДанныеЗахвата.РабочаяКопия = Правило.Ссылка
		|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
		|ГДЕ Правило.Владелец = &Регистрация";
		Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь); 
		Запрос.УстановитьПараметр("Регистрация", ОбщиеПеременные.Регистрация);
		ОбщиеПеременные.ЗахваченныеПравила = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаПравило");
	КонецЕсли;

	Если ОбщиеПеременные.ИсточникЗагрузки = 1 Тогда
		// Загрузка из текстового файла
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ОбщиеПеременные.ПомещенныеФайлы[0].Хранение, КодировкаТекста.UTF8);
		СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстДок, 1));
		Если Лев(СтрокаКомментария,3) <> "// " Тогда
			СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстДок, 2));
		КонецЕсли;

	ИначеЕсли ОбщиеПеременные.ИсточникЗагрузки = 0 Тогда
		// Загрузка из макета XML  
		Попытка
			Правила = Новый ЧтениеXML();
			Правила.ОткрытьФайл(ОбщиеПеременные.ПомещенныеФайлы[0].Хранение);
			Правила.Прочитать();
		Исключение
			СообщитьОбОшибкеОбработки(ОбщиеПеременные, 3, ОписаниеОшибки());
			ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки", НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.Ошибки); 
			ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
			Возврат;
		КонецПопытки;
		Если Не (Правила.ЛокальноеИмя = "ПравилаРегистрации"
				И Правила.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			
			// Ошибка формата правил
			СообщитьОбОшибкеОбработки(ОбщиеПеременные, 4);
			ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки", НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.Ошибки); 
			ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
			Возврат;
		КонецЕсли;
		ОбщиеПеременные.ДанныеДляЗагрузки = Правила;
		ЗагрузитьПравилаРегистрацииОбъектовXML(ОбщиеПеременные); 
		Попытка
			УдалитьФайлы(ОбщиеПеременные.ПомещенныеФайлы[0].Хранение);
		Исключение
		КонецПопытки;

		ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки, Регистрация", НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.Ошибки, ОбщиеПеременные.Регистрация); 
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
		Возврат;
	Иначе
		ИмяМодуля = ОбщиеПеременные.ИмяМенеджераРегистрации; 
		СтрокаПоиска = "\CommonModules\" + ИмяМодуля + "\" + ?(ОбщиеПеременные.ИсточникЗагрузки = 3, "Ext\" , "") + "Module.bsl";
		Для Каждого ПомещенныйФайл Из ОбщиеПеременные.ПомещенныеФайлы Цикл
			Если СтрНайти(ПомещенныйФайл.ПолноеИмя, СтрокаПоиска) > 0 Тогда
				ТекстДок = Новый ТекстовыйДокумент;
				ТекстДок.Прочитать(ПомещенныйФайл.Хранение, КодировкаТекста.UTF8);
				ТекстМодуля = ТекстДок.ПолучитьТекст();
				СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстМодуля, 1));
				Если Лев(СтрокаКомментария,3) <> "// " Тогда
					СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстМодуля, 2));
				КонецЕсли;
		        ОбщиеПеременные.ДанныеДляЗагрузки = ТекстМодуля;
			КонецЕсли;
		КонецЦикла;
		Если ОбщиеПеременные.ДанныеДляЗагрузки = Неопределено Тогда
			ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки", Ложь, НСтр("ru='Не удалось найти общий модуль '") + ИмяМодуля);
			ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ОбщиеПеременные.СоздатьНовуюРегистрацию Тогда
		Если НЕ ЗначениеЗаполнено(ОбщиеПеременные.ИмяНовойРегистрации) И ЗначениеЗаполнено(СтрокаКомментария) Тогда
			// Прочитаем имя из текста модуля.
			Если Лев(СтрокаКомментария,15) = "// Регистрация " Тогда
				ПозицияКонецИмени = Найти(СтрокаКомментария, " от ");
				Если ПозицияКонецИмени > 0 Тогда
					ОбщиеПеременные.ИмяНовойРегистрации = Сред(СтрокаКомментария,16, ПозицияКонецИмени - 16);
				Иначе
					ОбщиеПеременные.ИмяНовойРегистрации = Прав(СтрокаКомментария,СтрДлина(СтрокаКомментария) - 15);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Создание новой регистрации будет после чтения ключевых параметров.
	КонецЕсли;
	ОбщиеПеременные.Вставить("ТаблицаРезультатов", ПодготовитьСтруктуруТаблицыРезультат());
	ЗагрузитьПроцедурыИФункцииВТаблицы(ОбщиеПеременные);
	СтрокиРезультат = ОбщиеПеременные.ТаблицаРезультатов.НайтиСтроки(Новый Структура("ИмяПроцедурыФункции", "ПараметрыРегистрации"));
	Если СтрокиРезультат.Количество() > 0 Тогда
		ПрочитатьПараметрыРегистрации(ОбщиеПеременные, СтрокиРезультат[0]);
	КонецЕсли;
	Если ОбщиеПеременные.СоздатьНовуюРегистрацию Тогда
		СоздатьНовуюРегистрацию(ОбщиеПеременные);
	КонецЕсли;
	ЗагрузитьПроцедурыИФункцииВОбъектыМетаданных(ОбщиеПеременные);
	
	// Удаление временных файлов.
	УдалитьВременныеФайлы(ОбщиеПеременные);

	Если АдресВременногоХранилища <> Неопределено Тогда
		ВозвращаемоеЗначение = Новый Структура("Регистрация, Успешно, Ошибки", ОбщиеПеременные.Регистрация, НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.Ошибки); 
		Если ЗначениеЗаполнено(ОбщиеПеременные.СообщениеОРезультате) Тогда 
			ВозвращаемоеЗначение.Вставить("СообщениеОРезультате", ОбщиеПеременные.СообщениеОРезультате);
		КонецЕсли;
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
	КонецЕсли; 
КонецПроцедуры

// Заполняет список общих модулей, которые являются модулем с правилами регистрации
Процедура ЗаполнитьСписокМодулейРегистрации(ОбщиеПеременные, АдресВременногоХранилища) Экспорт 
	ОбщиеПеременные.Вставить("Отказ", Ложь); 
	ОбщиеПеременные.Вставить("СписокМодулейРегистрации", Новый Массив);
	Для Каждого ПомещенныйФайл Из ОбщиеПеременные.ПомещенныеФайлы Цикл
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ПомещенныйФайл.Хранение, КодировкаТекста.UTF8);
		ТекстМодуля = ТекстДок.ПолучитьТекст();
		НайтиИмяМодуляРегистрации(ТекстМодуля, ОбщиеПеременные);
	КонецЦикла;
	// Удаление временных файлов.
	УдалитьВременныеФайлы(ОбщиеПеременные);
	Если АдресВременногоХранилища <> Неопределено Тогда
		ВозвращаемоеЗначение = Новый Структура("Успешно, СписокМодулейРегистрации", НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.СписокМодулейРегистрации); 
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
	КонецЕсли; 

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
#Область ЧтениеФайлаПравилРегистрации
// Процедура выполняет последовательное чтение XML файла с правилами регистрации
// Параметры:
//  ОбщиеПеременные - Структура - различные параметры и переменные обработки.
// Возвращаемое значение - Структура - результат загрузки.
Процедура ЗагрузитьПравилаРегистрацииОбъектовXML(ОбщиеПеременные)  
	Правила = ОбщиеПеременные.ДанныеДляЗагрузки;
	
	// Выполняем инициализацию коллекций для правил
	ОбщиеПеременные.Вставить("ПравилаРегистрацииОбъектов", ИнициализацияТаблицыПРО());
	// Состав плана обмена.
	СоставПланаОбмена = Новый ТаблицаЗначений;
	СоставПланаОбмена.Колонки.Добавить("Наименование",    Новый ОписаниеТипов("Строка"));
	СоставПланаОбмена.Колонки.Добавить("Тип",             Новый ОписаниеТипов("Строка"));
	СоставПланаОбмена.Колонки.Добавить("Авторегистрация", Новый ОписаниеТипов("Булево"));

	ОбщиеПеременные.Вставить("СоставПланаОбмена", СоставПланаОбмена);
	
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		// Реквизиты регистрации
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ИмяУзла = "ВерсияФормата"
				Или ИмяУзла = "Ид" 
				Или ИмяУзла = "Наименование"
				Или ИмяУзла = "Комментарий" Тогда
				
				ОбщиеПеременные.СтруктураРегистрации[ИмяУзла] = одЗначениеЭлемента(Правила);
				
			ИначеЕсли ИмяУзла = "ДатаВремяСоздания" Тогда
				
				ОбщиеПеременные.СтруктураРегистрации.ДатаВремяСоздания = одЗначениеЭлемента(Правила, Тип("Дата"));
				
			ИначеЕсли ИмяУзла = "ПланОбмена" Тогда
				
				// Атрибуты для плана обмена
				ИмяПланаОбмена = одЗначениеЭлемента(Правила);
				ОбщиеПеременные.СтруктураРегистрации.ИмяПланаОбмена = СтрЗаменить(ИмяПланаОбмена, "ПланОбменаСсылка.", "");
				
			ИначеЕсли ИмяУзла = "Конфигурация" Тогда
				
				// Атрибуты конфигурации
				ОбщиеПеременные.СтруктураРегистрации.ВерсияПлатформы     = одАтрибут(Правила, "ВерсияПлатформы");
				ОбщиеПеременные.СтруктураРегистрации.ВерсияКонфигурации  = одАтрибут(Правила, "ВерсияКонфигурации");
				ОбщиеПеременные.СтруктураРегистрации.СинонимКонфигурации = одАтрибут(Правила, "СинонимКонфигурации");
				
				// Наименование конфигурации
				ОбщиеПеременные.СтруктураРегистрации.Конфигурация = одЗначениеЭлемента(Правила);
				
				
			ИначеЕсли ИмяУзла = "СоставПланаОбмена" Тогда
				
				ЗагрузитьСоставПланаОбмена(Правила, ОбщиеПеременные.СоставПланаОбмена);
				
			ИначеЕсли ИмяУзла = "ПравилаРегистрацииОбъектов" Тогда
				
				ЗагрузитьПравилаРегистрации(Правила, ОбщиеПеременные, ОбщиеПеременные.ПравилаРегистрацииОбъектов)
			Иначе
				одПропустить(Правила);
			КонецЕсли;
		ИначеЕсли (ИмяУзла = "ПравилаРегистрации") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		КонецЕсли;
		
	КонецЦикла;
	Правила.Закрыть();
	Если ОбщиеПеременные.Отказ Тогда
		Возврат;
	КонецЕсли; 
	Если ОбщиеПеременные.СоздатьНовуюРегистрацию Тогда
		СоздатьНовуюРегистрацию(ОбщиеПеременные);
	КонецЕсли;
	ЗагрузитьЭлементыПравилРегистрацииОбъектов(ОбщиеПеременные, ОбщиеПеременные.ПравилаРегистрацииОбъектов);
	
	Если НЕ ОбщиеПеременные.Свойство("ТаблицаСвойствПланаОбмена") Тогда
		ТаблицаСвойствПланаОбмена = ОбщиеПеременные.ШаблонДереваСвойствОбъекта.Скопировать();
		ОбщиеПеременные.Вставить("ТаблицаСвойствПланаОбмена", ТаблицаСвойствПланаОбмена);
	КонецЕсли;

	СоздатьОбъектыИСвойстваПоТаблицеВложенныхСвойств(ОбщиеПеременные, ОбщиеПеременные.Регистрация.ИмяПланаОбмена, ОбщиеПеременные.ТаблицаСвойствПланаОбмена);

КонецПроцедуры

// Загрузка из XML состава плана обмена.
Процедура ЗагрузитьСоставПланаОбмена(Правила, СоставПланаОбмена)
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		
		Если ИмяУзла = "Элемент" Тогда
			
			ЗагрузитьЭлементСоставаПланаОбмена(Правила, СоставПланаОбмена);
			
		ИначеЕсли (ИмяУзла = "СоставПланаОбмена") И (Правила.ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЭлементСоставаПланаОбмена(Правила, СоставПланаОбмена)
	
	НоваяСтрока = СоставПланаОбмена.Добавить();
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		
		Если ИмяУзла = "Тип" Тогда
			
			НоваяСтрока.Тип = одЗначениеЭлемента(Правила);
			
			НоваяСтрока.Наименование = ПолучитьИмяОбъектаПоНаименованию(НоваяСтрока.Тип);
			
		ИначеЕсли ИмяУзла = "Авторегистрация" Тогда
			
			НоваяСтрока.Авторегистрация = одЗначениеЭлемента(Правила, Тип("Булево"));
			
		ИначеЕсли (ИмяУзла = "Элемент") И (Правила.ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Осуществляет загрузку правил регистрации в соответствии с форматом правил обмена
//
// Параметры:
//  ПравилаОбмена  - Объект типа XMLЧтение
// 
Процедура ЗагрузитьПравилаРегистрации(Правила, ОбщиеПеременные, ПравилаРегистрацииОбъектов)
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		
		Если ИмяУзла = "Правило" Тогда
			
			ЗагрузитьПравилоРегистрации(Правила, ОбщиеПеременные, ПравилаРегистрацииОбъектов);
			
		ИначеЕсли ИмяУзла = "Группа" Тогда
			
			ЗагрузитьГруппуПравилРегистрации(Правила, ОбщиеПеременные, ПравилаРегистрацииОбъектов);
			
		ИначеЕсли (ИмяУзла = "ПравилаРегистрацииОбъектов") И (Правила.ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьПравилаРегистрации()

Процедура ЗагрузитьГруппуПравилРегистрации(Правила, ОбщиеПеременные, ДеревоЗначений)
	
	НоваяСтрока = ДеревоЗначений.Строки.Добавить();
	
	НоваяСтрока.ЭтоГруппа = Истина;
	НоваяСтрока.Отключить = одАтрибут(Правила, "Отключить", Тип("Булево"));
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		
		Если ИмяУзла = "Правило" Тогда
			
			ЗагрузитьПравилоРегистрации(Правила, ОбщиеПеременные, НоваяСтрока);
			
		ИначеЕсли ИмяУзла = "Группа" И Правила.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ЗагрузитьГруппуПравилРегистрации(Правила, ОбщиеПеременные, НоваяСтрока);
			
		ИначеЕсли ИмяУзла = "Код"
			Или ИмяУзла = "Описание" 
			Или ИмяУзла = "Комментарий" 
			Или ИмяУзла = "Наименование"
			Или ИмяУзла = "ТипГруппы" Тогда
			
			НоваяСтрока[ИмяУзла] = одЗначениеЭлемента(Правила);
			
		ИначеЕсли ИмяУзла = "Группа" И Правила.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		
			Прервать; 
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьГруппуПравилРегистрации()

Процедура ЗагрузитьПравилоРегистрации(Правила, ОбщиеПеременные, ДеревоЗначений)
	НоваяСтрока = ДеревоЗначений.Строки.Добавить();
	
	НоваяСтрока.ЭтоГруппа = Ложь;
	НоваяСтрока.Отключить = одАтрибут(Правила, "Отключить", Тип("Булево"));
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		
		Если ИмяУзла = "Код"
			Или ИмяУзла = "Описание"
			Или ИмяУзла = "Комментарий"
			Или ИмяУзла = "Наименование"
			Или ИмяУзла = "ОбъектНастройки"
			Или ИмяУзла = "РеквизитРежимаВыгрузки"
			Или ИмяУзла = "ТегВырезки"
			// Обработчики событий.
			Или ИмяУзла = "ПередОбработкой"
			Или ИмяУзла = "ПриОбработке" 
			Или ИмяУзла = "ПакетнаяОбработка"
			Или ИмяУзла = "ПриОбработкеДополнительный"
			Или ИмяУзла = "ПослеОбработки" Тогда
			
			НоваяСтрока[ИмяУзла] = одЗначениеЭлемента(Правила);
		ИначеЕсли ИмяУзла = "ОтборПоСвойствамПланаОбмена" Тогда
			
			// Инициализируем коллекцию свойств для текущего ПРО.
			НоваяСтрока.ОтборПоСвойствамПланаОбмена = ОбщиеПеременные.ШаблонДереваОтборПоСвойствамПланаОбмена.Скопировать();
			
			ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(Правила, ОбщиеПеременные, НоваяСтрока.ОтборПоСвойствамПланаОбмена);
			
		ИначеЕсли ИмяУзла = "ОтборПоСвойствамОбъекта" Тогда
			
			// Инициализируем коллекцию свойств для текущего ПРО.
			НоваяСтрока.ОтборПоСвойствамОбъекта = ОбщиеПеременные.ШаблонДереваОтборПоСвойствамОбъекта.Скопировать();
			
			ЗагрузитьДеревоОтбораПоСвойствамОбъекта(Правила, ОбщиеПеременные, НоваяСтрока.ОтборПоСвойствамОбъекта);
			
		ИначеЕсли (ИмяУзла = "Правило") И (Правила.ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьПравилоРегистрации()

Процедура ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(Правила, ОбщиеПеременные, ДеревоЗначений)
	
	СтрокиДЗ = ДеревоЗначений.Строки;
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		Если ИмяУзла = "ЭлементОтбора" Тогда
			
			ЗагрузитьЭлементОтбораПланаОбмена(Правила, ОбщиеПеременные, СтрокиДЗ.Добавить());
			
		ИначеЕсли ИмяУзла = "Группа" Тогда
			
			ЗагрузитьГруппуЭлементовОтбораПланаОбмена(Правила, ОбщиеПеременные, СтрокиДЗ.Добавить());
			
		ИначеЕсли (ИмяУзла = "ОтборПоСвойствамПланаОбмена") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДеревоОтбораПоСвойствамОбъекта(Правила, ОбщиеПеременные, ДеревоЗначений)
	
	СтрокиДЗ = ДеревоЗначений.Строки;
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		Если ИмяУзла = "ЭлементОтбора" Тогда
			
			ЗагрузитьЭлементОтбораОбъекта(Правила, ОбщиеПеременные, СтрокиДЗ.Добавить());
			
		ИначеЕсли ИмяУзла = "Группа" Тогда
			
			ЗагрузитьГруппуЭлементовОтбораОбъекта(Правила, ОбщиеПеременные, СтрокиДЗ.Добавить());
			
		ИначеЕсли (ИмяУзла = "ОтборПоСвойствамОбъекта") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЭлементОтбораПланаОбмена(Правила, ОбщиеПеременные, НоваяСтрока)
	
	НоваяСтрока.ЭтоГруппа = Ложь;
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		Если ИмяУзла = "СвойствоОбъекта" Тогда
			
			Если НоваяСтрока.ЭтоСтрокаКонстанты Тогда
				
				НоваяСтрока.СвойствоОбъекта = одЗначениеЭлемента(Правила, Тип(НоваяСтрока.ТипСвойстваОбъекта));
				
			Иначе
				
				НоваяСтрока.СвойствоОбъекта = одЗначениеЭлемента(Правила);
				
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "СвойствоПланаОбмена"
			Или ИмяУзла = "ВидСравнения"
			Или ИмяУзла = "ТипСвойстваОбъекта" Тогда
			
			НоваяСтрока[ИмяУзла] = одЗначениеЭлемента(Правила);
			
		ИначеЕсли ИмяУзла = "ЭтоСтрокаКонстанты" Тогда
			
			НоваяСтрока.ЭтоСтрокаКонстанты = одЗначениеЭлемента(Правила, Тип("Булево"));
			
		ИначеЕсли ИмяУзла = "ТаблицаСвойствОбъекта" Тогда
			НоваяСтрока.ТаблицаСвойствОбъекта = ОбщиеПеременные.ШаблонДереваСвойствОбъекта.Скопировать();
			ЗагрузитьТаблицуСвойств(Правила, НоваяСтрока.ТаблицаСвойствОбъекта);
		ИначеЕсли ИмяУзла = "ТаблицаСвойствПланаОбмена" Тогда
			Если НЕ ОбщиеПеременные.Свойство("ТаблицаСвойствПланаОбмена") Тогда
				ТаблицаСвойствПланаОбмена = ОбщиеПеременные.ШаблонДереваСвойствОбъекта.Скопировать();
			Иначе
				ТаблицаСвойствПланаОбмена = ОбщиеПеременные.ТаблицаСвойствПланаОбмена
			КонецЕсли;
			
			ЗагрузитьТаблицуСвойств(Правила, ТаблицаСвойствПланаОбмена, Истина);
			ОбщиеПеременные.Вставить("ТаблицаСвойствПланаОбмена", ТаблицаСвойствПланаОбмена);

		ИначеЕсли (ИмяУзла = "ЭлементОтбора") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЭлементОтбораОбъекта(Правила, ОбщиеПеременные, НоваяСтрока)
	
	НоваяСтрока.ЭтоГруппа = Ложь;
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		Если ИмяУзла = "СвойствоОбъекта"
			Или ИмяУзла = "ВидСравнения"
			Или ИмяУзла = "ТипСвойстваОбъекта" Тогда
			
			НоваяСтрока[ИмяУзла] = одЗначениеЭлемента(Правила);
			
		ИначеЕсли ИмяУзла = "ЗначениеКонстанты" Тогда
			
			Если ПустаяСтрока(НоваяСтрока.ВидЭлементаОтбора) Тогда
				
				НоваяСтрока.ВидЭлементаОтбора = "ЗначениеКонстанты";
				
			КонецЕсли;
			
			Если НоваяСтрока.ВидЭлементаОтбора = "ЗначениеКонстанты" Тогда
				
				НоваяСтрока.ЗначениеКонстанты = одЗначениеЭлемента(Правила, Тип(НоваяСтрока.ТипСвойстваОбъекта)); // только примитивные типы
				
			Иначе
				
				НоваяСтрока.ЗначениеКонстанты = одЗначениеЭлемента(Правила); // строка
				
			КонецЕсли;
			
		ИначеЕсли ИмяУзла = "Вид" Тогда
			
			НоваяСтрока.ВидЭлементаОтбора = одЗначениеЭлемента(Правила);
			
		ИначеЕсли ИмяУзла = "ТаблицаСвойствОбъекта" Тогда
			НоваяСтрока.ТаблицаСвойствОбъекта = ОбщиеПеременные.ШаблонДереваСвойствОбъекта.Скопировать();
			ЗагрузитьТаблицуСвойств(Правила, НоваяСтрока.ТаблицаСвойствОбъекта, Ложь);
		ИначеЕсли (ИмяУзла = "ЭлементОтбора") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьГруппуЭлементовОтбораПланаОбмена(Правила, ОбщиеПеременные, НоваяСтрока)
	
	НоваяСтрока.ЭтоГруппа = Истина;
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		Если ИмяУзла = "ЭлементОтбора" Тогда
			
			ЗагрузитьЭлементОтбораПланаОбмена(Правила, ОбщиеПеременные, НоваяСтрока.Строки.Добавить());
		
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			
			ЗагрузитьГруппуЭлементовОтбораПланаОбмена(Правила, ОбщиеПеременные, НоваяСтрока.Строки.Добавить());
			
		ИначеЕсли ИмяУзла = "БулевоЗначениеГруппы" Тогда
			
			НоваяСтрока.БулевоЗначениеГруппы = одЗначениеЭлемента(Правила);
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьГруппуЭлементовОтбораОбъекта(Правила, ОбщиеПеременные, НоваяСтрока)
	
	НоваяСтрока.ЭтоГруппа = Истина;
	
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		Если ИмяУзла = "ЭлементОтбора" Тогда
			
			ЗагрузитьЭлементОтбораОбъекта(Правила, ОбщиеПеременные, НоваяСтрока.Строки.Добавить());
		
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
			
			ЗагрузитьГруппуЭлементовОтбораОбъекта(Правила, ОбщиеПеременные, НоваяСтрока.Строки.Добавить());
			
		ИначеЕсли ИмяУзла = "БулевоЗначениеГруппы" Тогда
			
			НоваяСтрока.БулевоЗначениеГруппы = одЗначениеЭлемента(Правила);
			
		ИначеЕсли (ИмяУзла = "Группа") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗагрузитьТаблицуСвойств(Правила, ДеревоЗначений, ПроверятьСуществование = Ложь)
	
	Правила.Прочитать();
	
	Если Правила.ЛокальноеИмя = "Свойство" Тогда
		
		ЗагрузитьСвойствоОбъекта(Правила, ДеревоЗначений, ПроверятьСуществование);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСвойствоОбъекта(Правила, ДеревоЗначений, ПроверятьСуществование)
	
	СтруктураПоиска = Новый Структура;
	Пока Правила.Прочитать() Цикл
		
		ИмяУзла = Правила.ЛокальноеИмя;
		ТипУзла = Правила.ТипУзла;
		
		Если ИмяУзла = "Наименование"
			Или ИмяУзла = "Тип"
			Или ИмяУзла = "Вид" Тогда
			СтруктураПоиска.Вставить(ИмяУзла, одЗначениеЭлемента(Правила));
			
		ИначеЕсли (ИмяУзла = "Свойство") И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать; 
			
		Иначе
			
			одПропустить(Правила);
			
		КонецЕсли;
		
	КонецЦикла;
	СоздатьСтроку = Истина;
	Если ПроверятьСуществование Тогда
		РезультатПоиска = ДеревоЗначений.Строки.Найти(СтруктураПоиска);
		Если РезультатПоиска <> Неопределено И РезультатПоиска.Количество() > 0 Тогда
			СоздатьСтроку = Ложь;
			СтрокаДерева = РезультатПоиска[0];
		КонецЕсли;
	КонецЕсли;
	Если СоздатьСтроку Тогда
		СтрокаДерева = ДеревоЗначений.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураПоиска);
	КонецЕсли;
	ЗагрузитьТаблицуСвойств(Правила, СтрокаДерева, ПроверятьСуществование); // вызов сложной рекурсии
	
КонецПроцедуры

Процедура НайтиИмяМодуляРегистрации(ТекстМодуля, ОбщиеПеременные)
	НайденаПроцедураПриПолученииНастроек = Ложь;
	Для НомерСтроки = 1 По СтрЧислоСтрок(ТекстМодуля) Цикл
		Стр = СтрПолучитьСтроку(ТекстМодуля, НомерСтроки);
		Если СтрНайти(Стр, "//") > 0 Или СокрЛП(Стр) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Стр, "Процедура ПриПолученииНастроек(") > 0 Тогда
			НайденаПроцедураПриПолученииНастроек = Истина;
		ИначеЕсли НайденаПроцедураПриПолученииНастроек И СтрНайти(Стр, "КонецПроцедуры") > 0 Тогда
			Прервать;
		ИначеЕсли НайденаПроцедураПриПолученииНастроек И СтрНайти(Стр, ".ИмяМенеджераРегистрации") > 0 Тогда
			ОбщиеПеременные.СписокМодулейРегистрации.Добавить(СокрЛП(ТекстВнутриКавычек(Стр)));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ПроцедурыИнициализации
// Инициализирует колонки таблицы правил регистрации объектов
//
// Параметры:
//  Нет.
// 
Функция ИнициализацияТаблицыПРО() 
	
	ДеревоЗначений = Новый ДеревоЗначений;
	
	Колонки = ДеревоЗначений.Колонки;
	// Для группы и элемента.
	Колонки.Добавить("ЭтоГруппа",       Новый ОписаниеТипов("Булево")); 
	Колонки.Добавить("Отключить",       Новый ОписаниеТипов("Булево")); 
	Колонки.Добавить("Код",             Новый ОписаниеТипов("Строка")); 
	Колонки.Добавить("Описание",        Новый ОписаниеТипов("Строка")); 
	Колонки.Добавить("Комментарий",     Новый ОписаниеТипов("Строка")); 
	Колонки.Добавить("Наименование",    Новый ОписаниеТипов("Строка"));  
	// Для группы.
	Колонки.Добавить("ТипГруппы",       Новый ОписаниеТипов("Строка")); 
	// Для элемента.
	Колонки.Добавить("РеквизитРежимаВыгрузки",      Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ОбъектНастройки",             Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ОтборПоСвойствамОбъекта",     Новый ОписаниеТипов("ДеревоЗначений"));
	Колонки.Добавить("ОтборПоСвойствамПланаОбмена", Новый ОписаниеТипов("ДеревоЗначений"));
	Колонки.Добавить("ТегВырезки",    Новый ОписаниеТипов("Строка"));
	
	// Обработчики событий.
	Колонки.Добавить("ПередОбработкой",            Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ПриОбработке",               Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ПриОбработкеДополнительный", Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ПослеОбработки",             Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ПакетнаяОбработка",    	   Новый ОписаниеТипов("Строка"));
	
	Возврат ДеревоЗначений;
	
КонецФункции

// Инициализирует структуру регистрации
//
// Параметры:
//  Нет.
// 
Функция ИнициализацияРегистрации()
	
	СтруктураРегистрации = Новый Структура;
	СтруктураРегистрации.Вставить("ВерсияФормата",       "");
	СтруктураРегистрации.Вставить("Ид",                  "");
	СтруктураРегистрации.Вставить("Наименование",        "");
	СтруктураРегистрации.Вставить("ДатаВремяСоздания",   Дата('00010101'));
	СтруктураРегистрации.Вставить("ИмяПланаОбмена",      "");
	СтруктураРегистрации.Вставить("Комментарий",         "");
	
	// Параметры конфигурации.
	СтруктураРегистрации.Вставить("ВерсияПлатформы",     "");
	СтруктураРегистрации.Вставить("ВерсияКонфигурации",  "");
	СтруктураРегистрации.Вставить("СинонимКонфигурации", "");
	СтруктураРегистрации.Вставить("Конфигурация",        "");
	
	Возврат СтруктураРегистрации;
	
КонецФункции

// Инициализирует колонки таблицы правил регистрации по свойствам
//
// Параметры:
//  ДляЗаполненияПРО - Булево - признак того что таблица нужна для заполнения элемента справочника ПРО.
// 
Функция ИнициализацияТаблицыОтборПоСвойствамПланаОбмена(ДляЗаполненияПРО)
	
	ШаблонДерева = Новый ДеревоЗначений;
	
	Колонки = ШаблонДерева.Колонки;
	
	Колонки.Добавить("ЭтоГруппа",            Новый ОписаниеТипов("Булево"));
	
	Колонки.Добавить("СвойствоОбъекта"); // Произвольный тип в каждой строке таблицы.
	Колонки.Добавить("ЭтоСтрокаКонстанты",   Новый ОписаниеТипов("Булево"));
	Колонки.Добавить("СвойствоПланаОбмена",  Новый ОписаниеТипов("Строка"));
	
	Если ДляЗаполненияПРО Тогда
		Колонки.Добавить("ВидСравнения",         Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСравнения"));
		Колонки.Добавить("БулевоЗначениеГруппы",  Новый ОписаниеТипов("ПеречислениеСсылка.БулевыОперации"));
		Колонки.Добавить("ТипСвойстваОбъекта",    Новый ОписаниеТипов("Строка"));
	Иначе
		Колонки.Добавить("ВидСравнения",         Новый ОписаниеТипов("Строка"));
		Колонки.Добавить("БулевоЗначениеГруппы", Новый ОписаниеТипов("Строка"));
		Колонки.Добавить("ТипСвойстваОбъекта",   Новый ОписаниеТипов("Строка"));
		Колонки.Добавить("ТаблицаСвойствОбъекта",     Новый ОписаниеТипов("ДеревоЗначений"));
	КонецЕсли;
	Возврат ШаблонДерева;
	
КонецФункции

// Инициализирует колонки таблицы правил регистрации по свойствам
//
// Параметры:
//  ДляЗаполненияПРО - Булево - признак того что таблица нужна для заполнения элемента справочника ПРО.
// 
Функция ИнициализацияТаблицыОтборПоСвойствамОбъекта(ДляЗаполненияПРО)
	
	ШаблонДерева = Новый ДеревоЗначений;
	
	Колонки = ШаблонДерева.Колонки;
	
	Колонки.Добавить("ЭтоГруппа",             Новый ОписаниеТипов("Булево"));
	Колонки.Добавить("СвойствоОбъекта",       Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ВидЭлементаОтбора",     Новый ОписаниеТипов("Строка"));
	
	
	Колонки.Добавить("ЗначениеКонстанты"); // Произвольный тип.
	Если ДляЗаполненияПРО Тогда
		Колонки.Добавить("ВидСравнения",          Новый ОписаниеТипов("ПеречислениеСсылка.ВидыСравнения"));
		Колонки.Добавить("БулевоЗначениеГруппы",  Новый ОписаниеТипов("ПеречислениеСсылка.БулевыОперации"));
		Колонки.Добавить("ТипСвойстваОбъекта",    Новый ОписаниеТипов("Строка"));
	Иначе
		Колонки.Добавить("ВидСравнения",          Новый ОписаниеТипов("Строка"));
		Колонки.Добавить("БулевоЗначениеГруппы",  Новый ОписаниеТипов("Строка")); // "И", "ИЛИ"
		Колонки.Добавить("ТипСвойстваОбъекта",    Новый ОписаниеТипов("Строка"));
		Колонки.Добавить("ТаблицаСвойствОбъекта", Новый ОписаниеТипов("ДеревоЗначений"));
	КонецЕсли;
	Возврат ШаблонДерева;
	
КонецФункции

// Инициализирует колонки таблицы либо дерева вложенных свойств объекта
//
// Параметры:
//  Нет.
// 
Функция ИнициализацияТаблицыИлиДереваСвойств(Дерево = Истина)
	Если Дерево Тогда
		Шаблон = Новый ДеревоЗначений;
	Иначе
		Шаблон = Новый ТаблицаЗначений;
	КонецЕсли;
	Колонки = Шаблон.Колонки;
	
	Колонки.Добавить("Уровень",      Новый ОписаниеТипов("Число"));
	Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("Тип",          Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("Вид",          Новый ОписаниеТипов("Строка"));
	
	Возврат Шаблон;
	
КонецФункции

Функция ПодготовитьСтруктуруТаблицыРезультат()
	ТабЗнач = Новый ТаблицаЗначений;
	ТабЗнач.Колонки.Добавить("ИмяПроцедурыФункции");
	ТабЗнач.Колонки.Добавить("ТекстМодуля");
	ТабЗнач.Колонки.Добавить("ТекущийТег");  
	Возврат ТабЗнач;
КонецФункции

#КонецОбласти
#Область РаботаСОбъектамиДанных
// Осуществляет поиск элемента справочника Объекты по ключевым полям. Если объект не найден, то создает новый элемент
//
// Параметры:
//  ОбщиеПеременные - Структура - общие переменные модуля
//  Наименование - Строка - наименование элемента. Например: "СправочникСсылка.Номенклатура"
//  Владелец     - СправочникСсылка.Релиз - владелец элемента
//  Родитель     - СправочникСсылка.Объекты, Неопределено - родитель элемента (необязательный).
//  ЭтоГруппа    - Булево - признак группы элемента (необязательный).
// 
// Возвращаемое значение:
//  СправочникСсылка.Объекты - найденный или созданный элемент справочника Объекты.
//
Функция ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные, Наименование, Владелец, Родитель = Неопределено, ЭтоГруппа = Ложь)
	
	Если ПустаяСтрока(Наименование) Тогда
		Возврат Справочники.Объекты.ПустаяСсылка();
	КонецЕсли;
	
	// Получаем элемент из соответствия ранее найденных элементов.
	Элемент = ОбщиеПеременные.ЭлементыСправочникаОбъекты[Наименование];
	
	Если Элемент <> Неопределено Тогда
		Возврат Элемент;
	КонецЕсли;
	
	Элемент = Справочники.Объекты.НайтиПоНаименованию(Наименование, Истина, Родитель, Владелец);
	
	Если Не Элемент.Пустая() Тогда
		
		// Заполняем соответствие найденных объектов.
		ОбщиеПеременные.ЭлементыСправочникаОбъекты.Вставить(Наименование, Элемент);
		
		Возврат Элемент; 
		
	КонецЕсли;
	
	// Ссылку не нашли; создаем новый объект.
	Если ЭтоГруппа Тогда
		
		ЭлементОбъект = Справочники.Объекты.СоздатьГруппу();
		
	Иначе
		
		ЭлементОбъект = Справочники.Объекты.СоздатьЭлемент();
		
	КонецЕсли;
	
	// Назначаем ключевые свойства объекта для поиска ссылки.
	ЭлементОбъект.Наименование = Наименование;
	ЭлементОбъект.Родитель     = Родитель;
	ЭлементОбъект.Владелец     = Владелец;
	
	Если ЭтоГруппа Тогда
		
		Имя = Справочники.Объекты.ПолучитьИмяГруппыОбъектовПоНаименованию(Наименование);
		
		ЭлементОбъект.Имя     = Имя;
		ЭлементОбъект.Синоним = Имя;
		
	Иначе
		Имя = ПолучитьИмяОбъектаПоНаименованию(Наименование);
			
		ЭлементОбъект.Имя      = Имя;
		ЭлементОбъект.Синоним  = Имя;
		
		Если СтрНайти(Наименование, "СправочникСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Справочник;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"Справочники", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ДокументСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Документ;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"Документы", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ПеречислениеСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Перечисление;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"Перечисления", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ПланВидовХарактеристикСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.ПланВидовХарактеристик;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"ПланыВидовХарактеристик", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ПланВидовРасчетаСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.ПланВидовРасчета;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"ПланыВидовРасчета", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ПланСчетов") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.ПланСчетов;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"ПланыСчетов", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "РегистрСведенийЗапись") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрСведений;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"РегистрыСведений", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "РегистрНакопленияЗапись") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрНакопления;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"РегистрыНакопления", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "РегистрБухгалтерииЗапись") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрБухгалтерии;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"РегистрыБухгалтерии", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "РегистрРасчетаЗапись") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.РегистрРасчета;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"РегистрыРасчета", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "БизнесПроцессСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.БизнесПроцесс;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"БизнесПроцессы", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ТочкаМаршрутаБизнесПроцессаСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.ТочкаМаршрутаБизнесПроцесса;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"БизнесПроцессы", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ЗадачаСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Задача;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"Задачи", Владелец,, Истина);
			
		ИначеЕсли СтрНайти(Наименование, "ПланОбменаСсылка") Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.ПланОбмена;
			ЭлементОбъект.Родитель = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные,"ПланыОбмена", Владелец,, Истина);
			
			
		// Примитивные типы.
			
		ИначеЕсли Наименование = "Строка" Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Строка;
			
		ИначеЕсли Наименование = "Число" Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Число;
			
		ИначеЕсли Наименование = "Булево" Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Булево;
			
		ИначеЕсли Наименование = "Дата" Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.Дата;
			
		ИначеЕсли Наименование = "ХранилищеЗначения" Тогда
			
			Имя = НСтр("ru='Хранилище значения'");
			
			ЭлементОбъект.Имя      = Наименование;
			ЭлементОбъект.Синоним  = Имя;
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.ХранилищеЗначения;
			
		ИначеЕсли Наименование = "УникальныйИдентификатор" Тогда
			
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.УникальныйИдентификатор;
			
		ИначеЕсли Наименование = "КонстантыНабор" Тогда
			
			Имя = НСтр("ru='Набор констант'");
			
			ЭлементОбъект.Имя      = Наименование;
			ЭлементОбъект.Синоним  = Имя;
			ЭлементОбъект.Тип      = Перечисления.ТипыОбъектов.НаборКонстант;
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Записываем новый объект.
	ЗаписатьОбъект(ЭлементОбъект, ОбщиеПеременные);
	
	// Заполняем соответствие загруженных объектов.
	ОбщиеПеременные.ЭлементыСправочникаОбъекты.Вставить(Наименование, ЭлементОбъект.Ссылка);
	
	Возврат ЭлементОбъект.Ссылка;
	
КонецФункции

// Осуществляет поиск элемента справочника Свойства по ключевым полям. Если объект не найден, то создает новый элемент
//
// Параметры:
//  ДанныеОбъекта - Структура - сведения, которые относятся к объекту - владельцу свойства:
//   * Ссылка - СправочникСсылка.Объекты - объект конфигурации
//   * Наименование - Строка - Наименование объекта конфигурации
//   * Конфигурация - СправочникСсылка.Релизы
//     Должна быть передана либо Ссылка, либо Наименование + Конфигурация.
//  ДанныеСвойства - Структура - Сведения, которые относятся к свойству:
//   * Наименование - Строка - наименование элемента. Например, "ПометкаУдаления"
//   * Тип          - СправочникСсылка.Объекты - задает тип свойства
//   * Вид          - ПеречислениеСсылка.ВидыСвойств - вид свойства. Например, "Реквизит" (необязательный)
//   * Родитель     - СправочникСсылка.Свойства - родитель элемента (необязательный)
//   * ЭтоГруппа    - Булево - признак группы элемента (необязательный)
// Авторегистрация - Булево - признак необходимости авторегистрации.
// Возвращаемое значение:
//  СправочникСсылка.Свойства - найденный или созданный элемент справочника Свойства.
//
Функция ПолучитьСоздатьЭлементСправочникаСвойства(ОбщиеПеременные, ДанныеОбъекта, ДанныеСвойства, Авторегистрация = Ложь)
	
	Если ПустаяСтрока(ДанныеСвойства.Наименование) Тогда
		Возврат Справочники.Свойства.ПустаяСсылка();
	КонецЕсли;
	
	Вид = Неопределено;
	ДанныеСвойства.Свойство("Вид", Вид);
	Если Вид = Неопределено Тогда
		Вид = Перечисления.ВидыСвойств.ПустаяСсылка();
	КонецЕсли;
	
	Родитель = Неопределено;
	ДанныеСвойства.Свойство("Родитель", Родитель);
	Если Родитель = Неопределено Тогда
		Родитель = Справочники.Свойства.ПустаяСсылка();
	КонецЕсли;
	ЗапросПоСправочникуСвойств = Новый Запрос();
	ЗапросПоСправочникуСвойств.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Свойства.Ссылка
		|ИЗ
		|	Справочник.Свойства КАК Свойства
		|ГДЕ
		|	  Свойства.Наименование = &Наименование
		|	И ((Свойства.Владелец.Наименование     = &ВладелецСтрокой
		|		И Свойства.Владелец.Владелец = &Конфигурация)
		|		ИЛИ Свойства.Владелец = &ВладелецСсылка)
		|	И Свойства.ЭтоГруппа    = &ЭтоГруппа
		|	И Свойства.Родитель     = &Родитель
		|	И (Свойства.Вид = &Вид ИЛИ Свойства.Вид = &Вид2)";
	
	ЗапросПоСправочникуСвойств.УстановитьПараметр("Наименование", ДанныеСвойства.Наименование);
	Если ДанныеОбъекта.Свойство("Ссылка") И ЗначениеЗаполнено(ДанныеОбъекта.Ссылка) Тогда
		ЗапросПоСправочникуСвойств.УстановитьПараметр("ВладелецСсылка", ДанныеОбъекта.Ссылка);
		ЗапросПоСправочникуСвойств.УстановитьПараметр("ВладелецСтрокой", "");
		ЗапросПоСправочникуСвойств.УстановитьПараметр("Конфигурация", Неопределено);
	Иначе
		ЗапросПоСправочникуСвойств.УстановитьПараметр("ВладелецСсылка", Неопределено);
		ЗапросПоСправочникуСвойств.УстановитьПараметр("ВладелецСтрокой", ДанныеОбъекта.Наименование);
		ЗапросПоСправочникуСвойств.УстановитьПараметр("Конфигурация", ДанныеОбъекта.Конфигурация);
	КонецЕсли;
	ЗапросПоСправочникуСвойств.УстановитьПараметр("Родитель",     Родитель);
	ЗапросПоСправочникуСвойств.УстановитьПараметр("ЭтоГруппа",    ДанныеСвойства.ЭтоГруппа);
	ЗапросПоСправочникуСвойств.УстановитьПараметр("Вид",          Вид);
	Если Вид = Перечисления.ВидыСвойств.Свойство Тогда
		ЗапросПоСправочникуСвойств.УстановитьПараметр("Вид2", Перечисления.ВидыСвойств.Реквизит);
	ИначеЕсли Вид = Перечисления.ВидыСвойств.Реквизит Тогда
		ЗапросПоСправочникуСвойств.УстановитьПараметр("Вид2", Перечисления.ВидыСвойств.Свойство);
	Иначе
		ЗапросПоСправочникуСвойств.УстановитьПараметр("Вид2", Вид);
	КонецЕсли;
	
	Выборка = ЗапросПоСправочникуСвойств.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Ссылка = NULL Тогда
			
			Элемент = Справочники.Свойства.ПустаяСсылка();
		Иначе
			
			Элемент = Выборка.Ссылка;
		КонецЕсли;
		
	Иначе
		
		Элемент = Справочники.Свойства.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Элемент.Пустая() Тогда
		
		Возврат Элемент; 
		
	КонецЕсли;
	
	// Ссылку не нашли; создаем новый объект.
	Если ДанныеСвойства.ЭтоГруппа Тогда
		
		ЭлементОбъект = Справочники.Свойства.СоздатьГруппу();
		
	Иначе
		
		ЭлементОбъект = Справочники.Свойства.СоздатьЭлемент();
		ЭлементОбъект.Авторегистрация = Авторегистрация;
		
	КонецЕсли;
	
	// Назначаем ключевые свойства объекта для поиска ссылки.
	ЭлементОбъект.Наименование = ДанныеСвойства.Наименование;
	ЭлементОбъект.Родитель     = Родитель;
	Если ДанныеОбъекта.Свойство("Ссылка") Тогда
		ЭлементОбъект.Владелец = ДанныеОбъекта.Ссылка;
	Иначе
		ЭлементОбъект.Владелец = Справочники.Объекты.НайтиПоНаименованию(ДанныеОбъекта.Наименование,,,ДанныеОбъекта.Конфигурация);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭлементОбъект.Вид) Тогда
		ЭлементОбъект.Вид = Вид;
	КонецЕсли;
	Если ДанныеСвойства.Свойство("Тип") И Не ДанныеСвойства.Тип.Пустая() Тогда
		
		// Добавляем элемент типа в таблицу типов свойства.
		ЭлементОбъект.Типы.Добавить().Тип = ДанныеСвойства.Тип;
		
		ЭлементОбъект.ТипыСтрокой = Обработки.ЗагрузкаСтруктурыКонфигурации.глТипыСвойстваСтрокой(ЭлементОбъект);
		
	КонецЕсли;
	
	// Записываем новый объект.
	ЗаписатьОбъект(ЭлементОбъект, ОбщиеПеременные);
	
	Возврат ЭлементОбъект.Ссылка;
	
КонецФункции

Процедура ЗагрузитьЭлементыПравилРегистрацииОбъектов(ОбщиеПеременные, ДеревоЗначений, Родитель = Неопределено)
	
	Для Каждого СтрокаДерева Из ДеревоЗначений.Строки Цикл
		
		// Получаем объект для модификации новый или имеющийся.
		Элемент = НайтиСоздатьЭлементПРО(ОбщиеПеременные, СтрокаДерева); 
		Если НЕ СтрокаДерева.ЭтоГруппа Тогда
			// Проверка возможности загрузки при совместной работе.
			ОбъектЗанят = ПроверкаЗахвата(ОбщиеПеременные, Элемент.Ссылка);
			Если ОбъектЗанят Тогда
				ОбщиеПеременные.Отказ = Истина;
				СтрокаОшибка = НСтр("ru='Невозможно загрузить Правило регистрации %1: захвачено другим пользователем.'");
				СтрокаОшибка = СтрЗаменить(СтрокаОшибка, "%1", Элемент.Наименование);
				ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + Символы.ПС + СтрокаОшибка; 
				Продолжить;
			КонецЕсли; 
		КонецЕсли;
		// Значения реквизитов групп и элементов (общие).
		Элемент.Родитель     = Родитель;
		Элемент.Отключить    = СтрокаДерева.Отключить;
		Элемент.Описание     = СтрокаДерева.Описание;
		Элемент.Комментарий  = СтрокаДерева.Комментарий;
		Элемент.Наименование = СтрокаДерева.Наименование;
		
		Если СтрокаДерева.ЭтоГруппа Тогда 
			
			Элемент.ТипГруппы = ПолучитьЗначениеПеречисления("ТипыОбъектов", СтрокаДерева.ТипГруппы);
			
		Иначе 
			
			Элемент.ОбъектНастройки = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные, СтрокаДерева.ОбъектНастройки, ОбщиеПеременные.Конфигурация);
			
			Элемент.РеквизитРежимаВыгрузкиОбъектовОбмена = СтрокаДерева.РеквизитРежимаВыгрузки;
			
			// Инициализируем дерево отбора по свойствам объекта.
			ОтборПоСвойствамОбъекта = ИнициализацияТаблицыОтборПоСвойствамОбъекта(Истина);
			
			// Обнуляем таблицу свойств объекта.
			ЗаполнитьДеревоОтбораПоСвойствамОбъекта(ОбщиеПеременные, Элемент.ОбъектНастройки, СтрокаДерева.ОтборПоСвойствамОбъекта, ОтборПоСвойствамОбъекта);
			
			Элемент.ОтборПоСвойствамОбъекта = Новый ХранилищеЗначения(ОтборПоСвойствамОбъекта);
			
			// Инициализируем дерево отбора по свойствам плана обмена.
			ОтборПоСвойствамПланаОбмена = ИнициализацияТаблицыОтборПоСвойствамПланаОбмена(Истина);
			
			ЗаполнитьДеревоОтбораПоСвойствамПланаОбмена(ОбщиеПеременные, Элемент.ОбъектНастройки, СтрокаДерева.ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамПланаОбмена);
			
			Элемент.ОтборПоСвойствамПланаОбмена = Новый ХранилищеЗначения(ОтборПоСвойствамПланаОбмена);
			
			Элемент.АлгоритмПередОбработкойПравила            = СтрокаДерева.ПередОбработкой;
			Элемент.АлгоритмПриОбработкеПравила               = СтрокаДерева.ПриОбработке;
			Элемент.АлгоритмПриОбработкеДополнительныйПравила = СтрокаДерева.ПриОбработкеДополнительный;
			Элемент.АлгоритмПослеОбработкиПравила             = СтрокаДерева.ПослеОбработки;
			Элемент.АлгоритмПакетнаяОбработкаРегистрации	  = СтрокаДерева.ПакетнаяОбработка; 
			// Теги вырезки.
			Элемент.Теги.Очистить();
			Если ЗначениеЗаполнено(СтрокаДерева.ТегВырезки) Тогда
				ТекущийТегМассив = СтрРазделить(СтрокаДерева.ТегВырезки, Символы.ПС);
				Для Каждого ТекТег Из ТекущийТегМассив Цикл
					ТекТегСсылка = НайтиСоздатьТег(ОбщиеПеременные, ТекТег);
					Если ТекТегСсылка = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					СтрТег = Элемент.Теги.Добавить();
					СтрТег.Тег = ТекТегСсылка;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// Записываем модифицированный объект.
		ЗаписатьОбъект(Элемент, ОбщиеПеременные);
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			
			// Рекурсивно вызываем процедуру для загрузки элементов текущей группы.
			ЗагрузитьЭлементыПравилРегистрацииОбъектов(ОбщиеПеременные, СтрокаДерева, Элемент.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОбъект(Объект, ОбщиеПеременные)
	
	Попытка
		
		Объект.ОбменДанными.Загрузка = Истина;
		
		Объект.Записать();
		
	Исключение
		
		НСтрока = НСтр("ru = 'Ошибка при записи объекта: %1. Описание ошибки: %2'");
		
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтрока, Строка(Объект), ОписаниеОшибки());
		
		СообщитьОбОшибкеОбработки(ОбщиеПеременные, 5, СтрокаСообщения);
		
		ВызватьИсключение СтрокаСообщения;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоОтбораПоСвойствамОбъекта(ОбщиеПеременные, ОбъектНастройки, ДеревоЗначенийИсточник, ДеревоЗначенийПриемник)
	
	Для Каждого СтрокаДерева Из ДеревоЗначенийИсточник.Строки Цикл
		
		НоваяСтрока = ДеревоЗначенийПриемник.Строки.Добавить();
		
		Если СтрокаДерева.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева, "ЭтоГруппа");
			
			НоваяСтрока.БулевоЗначениеГруппы = ПолучитьЗначениеПеречисления("БулевыОперации", СтрокаДерева.БулевоЗначениеГруппы);
			
			// Добавляем вложенные элементы отбора.
			ЗаполнитьДеревоОтбораПоСвойствамОбъекта(ОбщиеПеременные, ОбъектНастройки, СтрокаДерева, НоваяСтрока);
			
		Иначе 
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева, "ЗначениеКонстанты, СвойствоОбъекта, ЭтоГруппа, ВидЭлементаОтбора");
			
			НоваяСтрока.ТипСвойстваОбъекта   = СтрокаДерева.ТипСвойстваОбъекта;
			НоваяСтрока.ВидСравнения         = ПолучитьЗначениеПеречисления("ВидыСравнения", СтрокаДерева.ВидСравнения);
			СоздатьОбъектыИСвойстваПоТаблицеВложенныхСвойств(ОбщиеПеременные, ОбъектНастройки, СтрокаДерева.ТаблицаСвойствОбъекта);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоОтбораПоСвойствамПланаОбмена(ОбщиеПеременные, ОбъектНастройки, ДеревоЗначенийИсточник, ДеревоЗначенийПриемник)
	
	Для Каждого СтрокаДерева Из ДеревоЗначенийИсточник.Строки Цикл
		
		НоваяСтрока = ДеревоЗначенийПриемник.Строки.Добавить();
		
		Если СтрокаДерева.ЭтоГруппа Тогда 
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева, "ЭтоГруппа");
			
			НоваяСтрока.БулевоЗначениеГруппы = ПолучитьЗначениеПеречисления("БулевыОперации", СтрокаДерева.БулевоЗначениеГруппы);
			
			// Добавляем вложенные элементы отбора.
			ЗаполнитьДеревоОтбораПоСвойствамПланаОбмена(ОбщиеПеременные, ОбъектНастройки, СтрокаДерева, НоваяСтрока);
			
		Иначе 
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева, "СвойствоОбъекта, СвойствоПланаОбмена, ЭтоГруппа, ЭтоСтрокаКонстанты");
			
			НоваяСтрока.ТипСвойстваОбъекта   = СтрокаДерева.ТипСвойстваОбъекта;
			НоваяСтрока.ВидСравнения         = ПолучитьЗначениеПеречисления("ВидыСравнения", СтрокаДерева.ВидСравнения);
			СоздатьОбъектыИСвойстваПоТаблицеВложенныхСвойств(ОбщиеПеременные, ОбъектНастройки, СтрокаДерева.ТаблицаСвойствОбъекта);

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьОбъектыИСвойстваПоТаблицеВложенныхСвойств(ОбщиеПеременные, Владелец, ДеревоЗначений, Родитель = Неопределено)
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Объекты") Тогда
		ДанныеОбъекта = Новый Структура("Ссылка", Владелец);
	Иначе
		ДанныеОбъекта = Новый Структура("Наименование, Конфигурация", Владелец, ОбщиеПеременные.Конфигурация);
	КонецЕсли;
	Для Каждого СтрокаДерева Из ДеревоЗначений.Строки Цикл
		
		Вид = ПолучитьЗначениеПеречисления("ВидыСвойств", СтрокаДерева.Вид);
		
		Если Вид = Перечисления.ВидыСвойств.ТабличнаяЧасть Тогда
			
			Наименование = СтрЗаменить(СтрЗаменить(СтрокаДерева.Наименование,"[",""),"]","");
			
			ДанныеСвойства = Новый Структура("Наименование, Вид, Родитель", 
										Наименование, Вид, Родитель);
			ДанныеСвойства.Вставить("ЭтоГруппа", Истина);
			// Создаем вложенное свойство рекурсивным вызовом.
			Родитель = ПолучитьСоздатьЭлементСправочникаСвойства(ОбщиеПеременные, ДанныеОбъекта, ДанныеСвойства);
			СоздатьОбъектыИСвойстваПоТаблицеВложенныхСвойств(ОбщиеПеременные, Владелец, СтрокаДерева, Родитель);
			
		Иначе
			
			Тип = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные, СтрокаДерева.Тип, ОбщиеПеременные.Конфигурация);
			ДанныеСвойства = Новый Структура("Наименование, Тип, Вид", 
											СтрокаДерева.Наименование, Тип, Вид);
			ДанныеСвойства.Вставить("ЭтоГруппа", Ложь);
			ДанныеСвойства.Вставить("Родитель", Родитель);
			ПолучитьСоздатьЭлементСправочникаСвойства(ОбщиеПеременные, ДанныеОбъекта, ДанныеСвойства);
			
			// Создаем вложенное свойство рекурсивным вызовом.
			СоздатьОбъектыИСвойстваПоТаблицеВложенныхСвойств(ОбщиеПеременные, Тип, СтрокаДерева);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиСоздатьЭлементПРО(ОбщиеПеременные, СтрокаДерева)
	
	Элемент = Справочники.ПравилаРегистрацииОбъектов.НайтиПоКоду(СтрокаДерева.Код,,, ОбщиеПеременные.Регистрация);
	Если Элемент.Пустая()
		Или Элемент.ЭтоГруппа <> СтрокаДерева.ЭтоГруппа Тогда
		// Найден элемент по коду, но он не подходит.
		Если НЕ Элемент.Пустая() Тогда
			// Записываем другой код.
			ЭлементОбъект = Элемент.ПолучитьОбъект();
			Если ЭлементОбъект <> Неопределено Тогда
				ЭлементОбъект.УстановитьНовыйКод();
				ЗаписатьОбъект(ЭлементОбъект, ОбщиеПеременные);
			КонецЕсли;
		КонецЕсли;
		// Создаем новый элемент.
		Если СтрокаДерева.ЭтоГруппа Тогда
			Элемент = Справочники.ПравилаРегистрацииОбъектов.СоздатьГруппу();
		Иначе
			Элемент = Справочники.ПравилаРегистрацииОбъектов.СоздатьЭлемент();
		КонецЕсли;
		
		// Для новых объектов сразу назначаем ключевые реквизиты поиска.
		Элемент.Владелец = ОбщиеПеременные.Регистрация;
		Элемент.Код      = СтрокаДерева.Код;
		
		Возврат Элемент;
		
	Иначе
		
		Возврат Элемент.ПолучитьОбъект();
		
	КонецЕсли;

КонецФункции

Процедура ЗагрузитьПроцедурыИФункцииВОбъектыМетаданных(ОбщиеПеременные)
	СуществующиеПравила = Новый Массив;
	Если НЕ ОбщиеПеременные.СоздатьНовуюРегистрацию Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Правила.Ссылка КАК Правило
		|ИЗ Справочник.ПравилаРегистрацииОбъектов КАК Правила
		|ГДЕ Правила.Владелец = &Регистрация И ЭтоГруппа = Ложь И Копия = Ложь
		|";
		Запрос.УстановитьПараметр("Регистрация", ОбщиеПеременные.Регистрация);
        СуществующиеПравила = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Правило");
	КонецЕсли;
	Для Каждого СтрокаРезультат Из ОбщиеПеременные.ТаблицаРезультатов Цикл
		Если СтрокаРезультат.ИмяПроцедурыФункции = "ПараметрыРегистрации" Тогда
			// Уже обработали ранее
			Продолжить;
		ИначеЕсли СтрокаРезультат.ИмяПроцедурыФункции = "ИнициализацияПравилРегистрации" 
			Или СтрокаРезультат.ИмяПроцедурыФункции = "ПриОбработке"
			Или СтрокаРезультат.ИмяПроцедурыФункции = "УстановитьОтборы" Тогда 
			// Служебные процедуры не содержат правил регистрации.
			Продолжить;
		ИначеЕсли Лев(СтрокаРезультат.ИмяПроцедурыФункции, 12) = "ДобавитьПРО_" Тогда
			ЗагрузитьПРО(ОбщиеПеременные, СтрокаРезультат, СуществующиеПравила);
		КонецЕсли;
	КонецЦикла; 
	Если НЕ ОбщиеПеременные.Отказ Тогда
		// Пометка на удаление лишних правил.
		Для Каждого ПРО Из СуществующиеПравила Цикл
			ПРООбъект = ПРО.ПолучитьОбъект();
			ПРООбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПрочитатьПараметрыРегистрации(ОбщиеПеременные, СтрокаРезультат)
	ЧислоСтрок = СтрЧислоСтрок(СтрокаРезультат.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, Сч);
		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, "Результат.Вставить(") Тогда
			ИмяПараметра = ТекстВнутриКавычек(ТекСтрока);
			Если ИмяПараметра = "ПланаОбмена" Тогда
				ОбщиеПеременные.СтруктураРегистрации.ИмяПланаОбмена = ТекстВнутриКавычек(ТекСтрока, 3);
			ИначеЕсли ИмяПараметра = "Комментарий" Тогда
				ОбщиеПеременные.СтруктураРегистрации.Комментарий = ТекстВнутриКавычек(ТекСтрока, 3);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры 

Процедура ЗагрузитьПРО(ОбщиеПеременные, СтрокаРезультат, СуществующиеПравила)
	ЧислоСтрок = СтрЧислоСтрок(СтрокаРезультат.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	Идентификатор = "";
	ОбъектМетаданныхИмя = "";
	ИмяРеквизитаФлага = "";
	ЕстьОбработчикПриОбработке = Ложь;
	ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	ПакетноеВыполнениеОбработчиков = Ложь;
	ЕстьОбработчикПослеОбработки = Ложь;
	ЕстьОбработчикПередОбработкой = Ложь;
	ИмяПроцедурыОтборПланОбмена = "";
	ИмяПроцедурыОтборОбъект = "";
	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, Сч);
		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, ".Идентификатор") > 0 Тогда
			Идентификатор = ТекстВнутриКавычек(ТекСтрока);
		ИначеЕсли СтрНайти(ТекСтрока, ".ОбъектМетаданныхИмя") > 0 Тогда 
			ОбъектМетаданныхИмя = ТекстВнутриКавычек(ТекСтрока); 
		ИначеЕсли СтрНайти(ТекСтрока, ".ИмяРеквизитаФлага") > 0 Тогда 
			ИмяРеквизитаФлага = ТекстВнутриКавычек(ТекСтрока); 
		ИначеЕсли СтрНайти(ТекСтрока, ".ЕстьОбработчикПриОбработкеДополнительный") > 0 Тогда
			БулевоСтрокой = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(БулевоСтрокой) Тогда
				ЕстьОбработчикПриОбработкеДополнительный = Булево(БулевоСтрокой);
			КонецЕсли; 
		ИначеЕсли СтрНайти(ТекСтрока, ".ЕстьОбработчикПередОбработкой") > 0 Тогда
			БулевоСтрокой = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(БулевоСтрокой) Тогда
				ЕстьОбработчикПередОбработкой = Булево(БулевоСтрокой);
			КонецЕсли; 
		ИначеЕсли СтрНайти(ТекСтрока, ".ЕстьОбработчикПриОбработке") > 0 Тогда
			БулевоСтрокой = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(БулевоСтрокой) Тогда
				ЕстьОбработчикПриОбработке = Булево(БулевоСтрокой);
			КонецЕсли;
		ИначеЕсли СтрНайти(ТекСтрока, ".ПакетноеВыполнениеОбработчиков") > 0 Тогда
			БулевоСтрокой = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(БулевоСтрокой) Тогда
				ПакетноеВыполнениеОбработчиков = Булево(БулевоСтрокой);
			КонецЕсли;
		ИначеЕсли СтрНайти(ТекСтрока, ".ЕстьОбработчикПослеОбработки") > 0 Тогда
			БулевоСтрокой = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(БулевоСтрокой) Тогда
				ЕстьОбработчикПослеОбработки = Булево(БулевоСтрокой);
			КонецЕсли; 
		ИначеЕсли СтрНайти(ТекСтрока, "УстановитьОтборы(") > 0 Тогда
			СчВызовОтбора = Сч + 1;
			ТекСтрокаОтбор = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, СчВызовОтбора);
			Если СтрНайти(ТекСтрокаОтбор, "ПустойОтбор") = 0 Тогда
				ИмяПроцедурыОтборПланОбмена = СокрЛП(СтрЗаменить(ТекСтрокаОтбор, "()", "")); 
				ИмяПроцедурыОтборПланОбмена = СтрЗаменить(ИмяПроцедурыОтборПланОбмена, ",", "");
				ИмяПроцедурыОтборПланОбмена = СтрЗаменить(ИмяПроцедурыОтборПланОбмена, ";", "");
				ИмяПроцедурыОтборПланОбмена = СтрЗаменить(ИмяПроцедурыОтборПланОбмена, ")", "");
				ПрочитатьОтборПланаОбмена(ОбщиеПеременные, ИмяПроцедурыОтборПланОбмена);
			КонецЕсли;
			СчВызовОтбора = Сч + 2;
			ТекСтрокаОтбор = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, СчВызовОтбора);
			Если СтрНайти(ТекСтрокаОтбор, "ПустойОтбор") = 0 Тогда
				ИмяПроцедурыОтборОбъект = СокрЛП(СтрЗаменить(ТекСтрокаОтбор, "()", ""));
				ИмяПроцедурыОтборОбъект = СтрЗаменить(ИмяПроцедурыОтборОбъект, ",", "");
				ИмяПроцедурыОтборОбъект = СтрЗаменить(ИмяПроцедурыОтборОбъект, ";", "");
				ИмяПроцедурыОтборОбъект = СтрЗаменить(ИмяПроцедурыОтборОбъект, ")", "");
				ПрочитатьОтборОбъекта(ОбщиеПеременные, ИмяПроцедурыОтборОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(ОбъектМетаданныхИмя) Тогда
		Возврат;
	КонецЕсли; 
	НайденноеПравило = Неопределено;
	ПозицияПодч = СтрНайти(ОбъектМетаданныхИмя, ".");
	ОбъектНастройкиИмя = Сред(ОбъектМетаданныхИмя, ПозицияПодч+1);
	ОбъектНастройкиТипСтрокой = Лев(ОбъектМетаданныхИмя, ПозицияПодч-1); 
	ОбъектНастройкиТип = ПолучитьЗначениеПеречисления("ТипыОбъектов", ОбъектНастройкиТипСтрокой);
	Если ОбщиеПеременные.СоздатьНовуюРегистрацию = Ложь Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка
		|ИЗ Справочник.ПравилаРегистрацииОбъектов
		|ГДЕ Владелец = &Регистрация
		|	И ОбъектНастройки.Имя = &ОбъектНастройкиИмя
		|	И ОбъектНастройки.Тип = &ОбъектНастройкиТип
		|	И Копия = Ложь
		|УПОРЯДОЧИТЬ ПО Код";
		Запрос.УстановитьПараметр("ОбъектНастройкиИмя", ОбъектНастройкиИмя); 
		Запрос.УстановитьПараметр("ОбъектНастройкиТип", ОбъектНастройкиТип);
		Запрос.УстановитьПараметр("Регистрация", ОбщиеПеременные.Регистрация); 

		МассивПравил = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если МассивПравил.Количество() > 0 Тогда
			Если СтрЗаменить(ОбъектМетаданныхИмя, ".", "_") = Идентификатор Тогда
				НайденноеПравило = МассивПравил[0];
			Иначе
				// несколько правил с одинаковыми объектами.
				НомерДубляСтрокой = Прав(Идентификатор,1);
				НомерДубля = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НомерДубляСтрокой);
				Если НомерДубля <> Неопределено И МассивПравил.Количество() >= НомерДубля Тогда
					НайденноеПравило = МассивПравил[НомерДубля-1];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НайденноеПравило = Неопределено Тогда
		// Поиск объекта.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.Объекты
		|ГДЕ Владелец = &Релиз И Имя = &ОбъектНастройкиИмя И Тип = &ОбъектНастройкиТип";
		Запрос.УстановитьПараметр("ОбъектНастройкиИмя", ОбъектНастройкиИмя); 
		Запрос.УстановитьПараметр("ОбъектНастройкиТип", ОбъектНастройкиТип);
		Запрос.УстановитьПараметр("Релиз", ОбщиеПеременные.Конфигурация); 
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			ОбщиеПеременные.Отказ = Истина;
			СтрокаОшибка = НСтр("ru='Не удалось найти объект метаданных: %1%. Правило регистрации %2% не загружено'");
			СтрокаОшибка = СтрЗаменить(СтрокаОшибка, "%1%", ОбъектМетаданныхИмя);
			СтрокаОшибка = СтрЗаменить(СтрокаОшибка, "%2%", Идентификатор);
			ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + СтрокаОшибка + Символы.ПС;  
			Возврат;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ОбъектМД = Выборка.Ссылка;
		КонецЕсли;
		ПРООбъект = Справочники.ПравилаРегистрацииОбъектов.СоздатьЭлемент();
		ПРООбъект.Владелец = ОбщиеПеременные.Регистрация;
		ПРООбъект.ОбъектНастройки = ОбъектМД; 
		ГруппаПоУмолчанию = Справочники.ПравилаРегистрацииОбъектов.НайтиПоРеквизиту("ТипГруппы", ОбъектНастройкиТип,, ОбщиеПеременные.Регистрация);
		Если НЕ ЗначениеЗаполнено(ГруппаПоУмолчанию) Тогда
			ГруппаПоУмолчаниюОбъект = Справочники.ПравилаРегистрацииОбъектов.СоздатьГруппу();
			
			ГруппаПоУмолчаниюОбъект.ТипГруппы    = ОбъектНастройкиТип;
			ГруппаПоУмолчаниюОбъект.Владелец     = ОбщиеПеременные.Регистрация;
	
			ГруппаПоУмолчаниюОбъект.Наименование = Справочники.ПравилаРегистрацииОбъектов.ПолучитьМножественноеПредставлениеТипаОбъекта(ОбъектНастройкиТип); 
			ГруппаПоУмолчаниюОбъект.УстановитьНовыйКод();
			ЗаписатьОбъект(ГруппаПоУмолчаниюОбъект, ОбщиеПеременные);
			ГруппаПоУмолчанию = ГруппаПоУмолчаниюОбъект.Ссылка;
		КонецЕсли;
		ПРООбъект.Родитель = ГруппаПоУмолчанию; 
		// Данные объекта настройки.
		ДанныеОбъектаНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектМД, "Синоним, Тип");
		ПРООбъект.Наименование = ДанныеОбъектаНастройки.Синоним; 
		ПРООбъект.УстановитьНовыйКод();
	Иначе
		ИндексНайденногоПРО = СуществующиеПравила.Найти(НайденноеПравило);
		Если ИндексНайденногоПРО <> Неопределено Тогда
			СуществующиеПравила.Удалить(ИндексНайденногоПРО);
		КонецЕсли;
		
		// Проверка возможности загрузки при совместной работе.
		ОбъектЗанят = ПроверкаЗахвата(ОбщиеПеременные, НайденноеПравило);
		Если ОбъектЗанят Тогда
			ОбщиеПеременные.Отказ = Истина;
			СтрокаОшибка = НСтр("ru='Невозможно загрузить Правило регистрации %1: захвачено другим пользователем.'");
			СтрокаОшибка = СтрЗаменить(СтрокаОшибка, "%1", НайденноеПравило.Наименование);
			ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + Символы.ПС + СтрокаОшибка; 
			Возврат;
		КонецЕсли; 

		ПРООбъект = НайденноеПравило.ПолучитьОбъект();
	КонецЕсли; 
	ПРООбъект.ОбменДанными.Загрузка = Истина;
	ПРООбъект.Отключить = Ложь;
	ПРООбъект.ПометкаУдаления = Ложь; 
	ПРООбъект.РеквизитРежимаВыгрузкиОбъектовОбмена = ИмяРеквизитаФлага;
	// Теги.
	ПРООбъект.Теги.Очистить();
	Если ЗначениеЗаполнено(СтрокаРезультат.ТекущийТег) Тогда
		ТекущийТегМассив = СтрРазделить(СтрокаРезультат.ТекущийТег, Символы.ПС);
		Для Каждого ТекТег Из ТекущийТегМассив Цикл
			ТекТегСсылка = НайтиСоздатьТег(ОбщиеПеременные, ТекТег); 
			Если ТекТегСсылка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрТег = ПРООбъект.Теги.Добавить();
			СтрТег.Тег = ТекТегСсылка;
		КонецЦикла;
	КонецЕсли;
	Если ЕстьОбработчикПриОбработке Тогда
		ИмяПроцедурыОбработчика = "ПРО_" + Идентификатор + "_ПриОбработке";
		ПРООбъект.АлгоритмПриОбработкеПравила = ПолучитьТекстОбработчика(ОбщиеПеременные, ИмяПроцедурыОбработчика); 
	Иначе
		ПРООбъект.АлгоритмПриОбработкеПравила = "";
	КонецЕсли; 
	Если ЕстьОбработчикПриОбработкеДополнительный Тогда
		ИмяПроцедурыОбработчика = "ПРО_" + Идентификатор + "_ПриОбработкеДополнительный";
		ПРООбъект.АлгоритмПриОбработкеДополнительныйПравила = ПолучитьТекстОбработчика(ОбщиеПеременные, ИмяПроцедурыОбработчика);
	Иначе
		ПРООбъект.АлгоритмПриОбработкеДополнительныйПравила = "";
	КонецЕсли; 
	Если ЕстьОбработчикПослеОбработки Тогда
		ИмяПроцедурыОбработчика = "ПРО_" + Идентификатор + "_ПослеОбработки";
		ПРООбъект.АлгоритмПослеОбработкиПравила = ПолучитьТекстОбработчика(ОбщиеПеременные, ИмяПроцедурыОбработчика); 
	Иначе
		ПРООбъект.АлгоритмПослеОбработкиПравила = "";	
	КонецЕсли;
	Если ЕстьОбработчикПередОбработкой Тогда
		ИмяПроцедурыОбработчика = "ПРО_" + Идентификатор + "_ПередОбработкой";
		ПРООбъект.АлгоритмПередОбработкойПравила = ПолучитьТекстОбработчика(ОбщиеПеременные, ИмяПроцедурыОбработчика);
	Иначе
		ПРООбъект.АлгоритмПередОбработкойПравила = "";
	КонецЕсли;
	Если ПакетноеВыполнениеОбработчиков Тогда
		ИмяПроцедурыОбработчика = "ПРО_" + Идентификатор + "_ПакетнаяОбработка";
		ПРООбъект.АлгоритмПакетнаяОбработкаРегистрации = ПолучитьТекстОбработчика(ОбщиеПеременные, ИмяПроцедурыОбработчика);
	Иначе
		ПРООбъект.АлгоритмПакетнаяОбработкаРегистрации = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяПроцедурыОтборОбъект) Или ЗначениеЗаполнено(ИмяПроцедурыОтборПланОбмена) Тогда
		ЗаполнитьОтборы(ОбщиеПеременные, ПРООбъект, ИмяПроцедурыОтборПланОбмена, ИмяПроцедурыОтборОбъект);
	КонецЕсли;
	ЗаписатьОбъект(ПРООбъект, ОбщиеПеременные);
КонецПроцедуры

Процедура СоздатьНовуюРегистрацию(ОбщиеПеременные)
	РегистрацияОбъект = Справочники.Регистрации.СоздатьЭлемент(); 
	РегистрацияОбъект.НомерВерсии = ?(ОбщиеПеременные.ИсточникЗагрузки = 0, 1, 2);
	Если ЗначениеЗаполнено(ОбщиеПеременные.ИмяНовойРегистрации) Тогда
		РегистрацияОбъект.Наименование = ОбщиеПеременные.ИмяНовойРегистрации;
	Иначе
		РегистрацияОбъект.Наименование = ОбщиеПеременные.СтруктураРегистрации.Наименование;
	КонецЕсли;
	РегистрацияОбъект.Конфигурация = ОбщиеПеременные.Конфигурация; 
	РегистрацияОбъект.Статус = Перечисления.СостоянияПравил.ВРаботе;
	РегистрацияОбъект.ДатаОбновления = ТекущаяДатаСеанса();
	РегистрацияОбъект.Описание = ОбщиеПеременные.СтруктураРегистрации.Комментарий;
	Если ЗначениеЗаполнено(ОбщиеПеременные.СтруктураРегистрации.ИмяПланаОбмена) Тогда
		РегистрацияОбъект.ИмяПланаОбмена = ПолучитьСоздатьЭлементСправочникаОбъекты(ОбщиеПеременные, ОбщиеПеременные.СтруктураРегистрации.ИмяПланаОбмена, ОбщиеПеременные.Конфигурация);
	КонецЕсли;
	ЗаписатьОбъект(РегистрацияОбъект, ОбщиеПеременные);
	ОбщиеПеременные.Регистрация = РегистрацияОбъект.Ссылка;
КонецПроцедуры
#КонецОбласти
#Область ПрочиеВспомогательныеПроцедуры
Функция ПолучитьИмяОбъектаПоНаименованию(Знач Наименование)
	МассивПодстрок = СтрРазделить(Наименование, ".", Ложь);
	Если МассивПодстрок.Количество() > 1 Тогда
		Возврат МассивПодстрок[1];
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Процедура СообщитьОбОшибкеОбработки(ОбщиеПеременные, КодОшибки, ОписаниеОшибки="")
	Сообщения = Новый Соответствие;
	
	Сообщения.Вставить(0,  НСтр("ru = 'Внутренняя ошибка'"));
	Сообщения.Вставить(1,  НСтр("ru = 'Ошибка при загрузке правил регистрации из XML-файла данных'"));
	Сообщения.Вставить(2,  НСтр("ru = 'Ошибка при загрузке справочников: Регистрация, ПравилаРегистрацииОбъектов, Объекты, Свойства'"));
	Сообщения.Вставить(3,  НСтр("ru = 'Ошибка при чтении файла XML'"));
	Сообщения.Вставить(4,  НСтр("ru = 'Ошибка формата файла правил регистрации'"));
	Сообщения.Вставить(5,  НСтр("ru = 'Ошибка при записи объекта'"));
	Сообщения.Вставить(6,  НСтр("ru = 'Ошибка при копировании файла правил в каталог временных файлов'"));
	Сообщения.Вставить(7,  НСтр("ru = 'Не указано имя файла правил регистрации'"));
	Сообщения.Вставить(8,  НСтр("ru = 'Не указано наименование новой регистрации'"));
	Сообщения.Вставить(9,  НСтр("ru = 'Не указано наименование новой конфигурации'"));
	Сообщения.Вставить(10, НСтр("ru = 'Не указана регистрация для обновления'"));
	Сообщения.Вставить(11, НСтр("ru = 'Не указана конфигурация для обновления'"));
	Сообщения.Вставить(12, НСтр("ru = 'Ошибка при получении файла правил для чтения'"));
	ТекстСообщения = Сообщения.Получить(КодОшибки);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + ОписаниеОшибки;
	КонецЕсли;
	
	ОбщиеПеременные.Отказ = Истина;
	ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + ТекстСообщения + Символы.ПС;
КонецПроцедуры

// Читает текст элемента и приводит значение к указанному типу
//
// Параметры:
//  Объект           - объект типа XMLЧтение, из которого происходит чтение
//  Тип              - тип получаемого значения
//  ИскатьПоСвойству - для ссылочных типов может быть указано свойство, по которому
//                     следует искать объект: "Код", "Наименование", <ИмяРеквизита>, "Имя" (предопределенного значения)
//
// Возвращаемое значение:
//  Значение xml-элемента, приведенное к соответствующему типу
//
Функция одЗначениеЭлемента(Объект, Знач Тип = Неопределено)
	Если Тип = Неопределено Тогда
		Тип = Тип("Строка");
	КонецЕсли;
	Значение = "";
	Имя = Объект.ЛокальноеИмя;

	Пока Объект.Прочитать() Цикл
		
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		
		Если ТипУзла = ТипУзлаXML.Текст Тогда
			
			Значение = СокрП(Объект.Значение);
			
		ИначеЕсли (ИмяУзла = Имя) И (ТипУзла = ТипУзлаXML.КонецЭлемента) Тогда
			
			Прервать;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат XMLЗначение(Тип, Значение)
	
КонецФункции // одЗначениеЭлемента()

// Пропускает узлы xml до конца указанного элемента (по умолчанию текущего)
//
// Параметры:
//  Объект   - объект типа XMLЧтение
//  Имя      - имя узла, до конца которого пропускаем элементы
// 
Процедура одПропустить(Объект)
	
	КолвоВложений = 0; 
	
	Имя = Объект.ЛокальноеИмя;
	
	Пока Объект.Прочитать() Цикл
		
		ИмяУзла = Объект.ЛокальноеИмя;
		ТипУзла = Объект.ТипУзла;
		
		Если ИмяУзла = Имя Тогда
			
			Если ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				
				Если КолвоВложений = 0 Тогда
					Прервать;
				Иначе
					КолвоВложений = КолвоВложений - 1;
				КонецЕсли;
				
			ИначеЕсли ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				КолвоВложений = КолвоВложений + 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // одПропустить()

// Читает значение атрибута по имени из указанного объекта, приводит значение
// к указанному примитивному типу
//
// Параметры:
//  Объект      - объект типа XMLЧтение, спозиционированный на начале элемента,
//                атрибут которого требуется получить
//  Тип         - Значение типа Тип. Тип атрибута
//  Имя         - Строка. Имя атрибута
//
// Возвращаемое значение:
//  Значение атрибута полученное по имени и приведенное к указанному типу
// 
Функция одАтрибут(Объект, Имя, Знач Тип = Неопределено)
	Если Тип = Неопределено Тогда
		Тип = Тип("Строка");
	КонецЕсли;
	
	СтрЗначение = СокрП(Объект.ПолучитьАтрибут(Имя));
	
	Если Не ПустаяСтрока(СтрЗначение) Тогда
		
		Возврат XMLЗначение(Тип, СтрЗначение);
		
	Иначе
		Если Тип = Тип("Строка") Тогда
			Возврат "";
			
		ИначеЕсли Тип = Тип("Булево") Тогда
			Возврат Ложь;
			
		ИначеЕсли Тип = Тип("Число") Тогда
			Возврат 0;
			
		ИначеЕсли Тип = Тип("Дата") Тогда
			Возврат Дата('00010101');
			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // одАтрибут()

Функция ПолучитьЗначениеПеречисления(ИмяПеречисления, ЗначениеПеречисления)
	
	Если ПустаяСтрока(ЗначениеПеречисления) Тогда
		
		Возврат Перечисления[ИмяПеречисления].ПустаяСсылка();
		
	КонецЕсли;
	
	Попытка
		
		Значение = Перечисления[ИмяПеречисления][ЗначениеПеречисления];
		
	Исключение
		
		Значение = Перечисления[ИмяПеречисления].ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат Значение;
	
КонецФункции

Процедура ЗагрузитьПроцедурыИФункцииВТаблицы(ОбщиеПеременные)
	Стр = "";
	СтрАнализа = ПодготовитьСтруктуруДляАнализаТекстаМодуля();
	Для НомерСтроки = 1 По СтрЧислоСтрок(ОбщиеПеременные.ДанныеДляЗагрузки) Цикл
		Стр = СтрПолучитьСтроку(ОбщиеПеременные.ДанныеДляЗагрузки, НомерСтроки);
		ОбработатьСтрокуВПоискеИмениФункцииИлиПроцедуры(ОбщиеПеременные, Стр, СтрАнализа, НомерСтроки);
	КонецЦикла;
	Если СтрАнализа.Статус <> 0 Тогда
		ТекстСообщения = НСтр("ru='Ошибка : Не найдено окончание функции или процедуры'") + " " + СтрАнализа.ИмяПроцедурыФункции;
		ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + ТекстСообщения + Символы.ПС;
		ОбщиеПеременные.Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ПодготовитьСтруктуруДляАнализаТекстаМодуля()

	Стр = Новый Структура;
	Стр.Вставить("ЭтоФункция",  Ложь);
	// 0 - ищется Функция или Процедура.
	// 1 - ищется имя функции или процедуры.
	// 2 - ищется левая скобка.
	// 3 - ищется правая скобка.
	// 4 - ищется КонецФункции или КонецПроцедуры.
	Стр.Вставить("Статус",      0);
	Стр.Вставить("ИмяПроцедурыФункции","");
	Стр.Вставить("ТекстМодуля", 0);
	Стр.Вставить("ОткрытыеОбласти", Новый Массив);

	Возврат Стр;

КонецФункции // ПодготовитьСтруктуруДляАнализаТекстаМодуля()

Процедура ОбработатьСтрокуВПоискеИмениФункцииИлиПроцедуры(ОбщиеПеременные, Стр, СтрАнализа, НомерСтроки)
	Если Найти(Стр, "#Область") Тогда
		СтрАнализа.ОткрытыеОбласти.Добавить(СтрЗаменить(Стр, "#Область", ""));
	ИначеЕсли Найти(Стр, "#КонецОбласти") Тогда
		СтрАнализа.ОткрытыеОбласти.Удалить(СтрАнализа.ОткрытыеОбласти.Количество()-1);
	КонецЕсли;
	Если СтрАнализа.Статус <> 4 Тогда
		Если ПустаяСтрока(Стр) Тогда
			Возврат;
		КонецЕсли;
		Если Лев(СокрЛП(Стр),1) = "#" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 0 Тогда
		// 0 - ищется Функция или Процедура.
		ПроверитьТекущийТег(Стр, ОбщиеПеременные);
		ПС = ВРЕГ(ПервоеСлово(Стр));
		Если ПС = "ФУНКЦИЯ" Тогда
			СтрАнализа.Статус = 1;
		ИначеЕсли ПС = "ПРОЦЕДУРА" Тогда
			СтрАнализа.Статус = 1;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если СтрАнализа.Статус = 1 Тогда
		// 1 - ищется имя функции или процедуры.
		Поз = Найти(Стр, "(");
		Если Поз = 0 Тогда
			СтрАнализа.ИмяПроцедурыФункции = Стр;
			Стр = "";
		Иначе
			СтрАнализа.ИмяПроцедурыФункции = СокрЛП(Лев(Стр, Поз-1));
			Стр = СокрЛП(Сред(Стр, Поз));
		КонецЕсли;
		СтрАнализа.Статус = 2;
		
		Если ПустаяСтрока(Стр) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 2 Тогда
		// 2 - ищется левая скобка.
		Если Лев(Стр, 1) <> "(" Тогда
			СтрОшибка = НСтр("ru='В строке'") + " " + НомерСтроки + " " + НСтр("ru='ожидается символ'") + " '('";
			Возврат;
		КонецЕсли;
		
		СтрАнализа.Статус = 3;
		Стр = СокрЛП(Сред(Стр,2));
		Если ПустаяСтрока(Стр) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 3 Тогда
		// 3 - ищется правая скобка.
		Поз = Найти(Стр, ")");
		Если Поз=0 Тогда
			Возврат;
		КонецЕсли;

		СтрАнализа.Статус = 4;
		СтрАнализа.ТекстМодуля = "";
		Возврат;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 4 Тогда
		// 4 - ищется КонецФункции или КонецПроцедуры.
		КопияСтр = Стр;
		ПС = ВРЕГ(ПервоеСлово(КопияСтр));
		Если (ПС <> "КОНЕЦФУНКЦИИ") И (ПС <> "КОНЕЦПРОЦЕДУРЫ") Тогда
			
			Если СокрЛП(СтрАнализа.ТекстМодуля) <> "" Тогда
				СтрАнализа.ТекстМодуля = СтрАнализа.ТекстМодуля + Символы.ПС;
			КонецЕсли;
			// Убираем первый символ tab - он подставляется автоматически при выгрузке модуля.
			Если Лев(Стр, 1) = Символы.Таб Тогда
				Стр = Сред(Стр,2);
			КонецЕсли;
			СтрАнализа.ТекстМодуля = СтрАнализа.ТекстМодуля + Стр;
			Возврат;
		КонецЕсли;
		
		СтрАнализа.Статус = 0;
		
		новСтр = ОбщиеПеременные.ТаблицаРезультатов.Добавить();
		новСтр.ИмяПроцедурыФункции      = СтрАнализа.ИмяПроцедурыФункции;
		новСтр.ТекстМодуля = СтрАнализа.ТекстМодуля;
		НовСтр.ТекущийТег = СтрСоединить(ОбщиеПеременные.ТекущийТег, Символы.ПС);
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьТекущийТег(Стр, ОбщиеПеременные)
	Если Лев(Стр, 2) <> "//" Тогда
		Возврат;
	КонецЕсли;
	СтрБезПробелов = СокрЛП(Стр);
	Если Найти(СтрБезПробелов, "//++") > 0 Тогда
		ТегСтрокой = СокрЛП(СтрЗаменить(СтрБезПробелов, "//++", ""));
		Если ОбщиеПеременные.ТекущийТег.Найти(ТегСтрокой) = Неопределено Тогда
			ОбщиеПеременные.ТекущийТег.Добавить(ТегСтрокой);
		КонецЕсли;
	ИначеЕсли Найти(СтрБезПробелов, "//--") > 0 Тогда
		ТегСтрокой = СокрЛП(СтрЗаменить(СтрБезПробелов, "//--", ""));
		ИндексЗначения = ОбщиеПеременные.ТекущийТег.Найти(ТегСтрокой);
		Если ИндексЗначения <> Неопределено Тогда
			ОбщиеПеременные.ТекущийТег.Удалить(ИндексЗначения);
		КонецЕсли;  
	КонецЕсли;
КонецПроцедуры

Функция ПервоеСлово(Стр)

	Стр = СокрЛП(Стр);
	масСимволов = Новый Массив;
	масСимволов.Добавить(" ");
	масСимволов.Добавить("/");
	масСимволов.Добавить(";");
	масСимволов.Добавить(Символы.Таб);
	
	Поз = 0;
	Для Каждого Символ Из масСимволов Цикл
		ПозицияСимвола = Найти(Стр, Символ);
		Если ПозицияСимвола = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияСимвола = ?(Поз=0, ПозицияСимвола, Мин(Поз, ПозицияСимвола));
		Поз = ПозицияСимвола;
	КонецЦикла;
	
	Если Поз=0 Тогда
		Результат = Стр;
		Стр = "";
	Иначе
		Результат = СокрЛП(Лев(Стр,Поз-1));
		Стр = СокрЛП(Сред(Стр,Поз+1));
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

Функция ПолучитьТекстОбработчика(ОбщиеПеременные, ИмяПроцедурыОбработчика)
	СтруктураПоиска = Новый Структура("ИмяПроцедурыФункции", ИмяПроцедурыОбработчика);
	СтрокиПроцедуры = ОбщиеПеременные.ТаблицаРезультатов.НайтиСтроки(СтруктураПоиска);
	Если СтрокиПроцедуры.Количество() = 0 Тогда
		ОбщиеПеременные.Отказ = Истина;
		ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + НСтр("ru='Не удалось найти обработчик: '") + ИмяПроцедурыОбработчика + Символы.ПС; 
		Возврат "";
	КонецЕсли;
	Возврат СтрокиПроцедуры[0].ТекстМодуля;
КонецФункции

Процедура ЗаполнитьОтборы(ОбщиеПеременные, ПРООбъект, ИмяПроцедурыОтборПланОбмена, ИмяПроцедурыОтборОбъекта) 
	Если ЗначениеЗаполнено(ИмяПроцедурыОтборПланОбмена) Тогда
		ДеревоОтбор = ОбщиеПеременные.ОтборыПоСвойствамПланаОбмена.Получить(ИмяПроцедурыОтборПланОбмена);
		ОтборПоСвойствамПланаОбмена = ИнициализацияТаблицыОтборПоСвойствамПланаОбмена(Истина);
		ЗаполнитьДеревоОтбораПоСвойствамПланаОбмена(ОбщиеПеременные, ПРООбъект.ОбъектНастройки, ДеревоОтбор, ОтборПоСвойствамПланаОбмена);
		ПРООбъект.ОтборПоСвойствамПланаОбмена = Новый ХранилищеЗначения(ОтборПоСвойствамПланаОбмена);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ИмяПроцедурыОтборОбъекта) Тогда
		ДеревоОтбор = ОбщиеПеременные.ОтборыПоСвойствамОбъекта.Получить(ИмяПроцедурыОтборОбъекта);
		ОтборПоСвойствамОбъекта = ИнициализацияТаблицыОтборПоСвойствамОбъекта(Истина);
		ЗаполнитьДеревоОтбораПоСвойствамОбъекта(ОбщиеПеременные, ПРООбъект.ОбъектНастройки, ДеревоОтбор, ОтборПоСвойствамОбъекта);
		ПРООбъект.ОтборПоСвойствамОбъекта = Новый ХранилищеЗначения(ОтборПоСвойствамОбъекта);
	КонецЕсли;
КонецПроцедуры

Процедура ПрочитатьОтборПланаОбмена(ОбщиеПеременные, ИмяПроцедурыОтборПланОбмена)
	Если ОбщиеПеременные.ОтборыПоСвойствамПланаОбмена.Получить(ИмяПроцедурыОтборПланОбмена) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстПроцедурыОтборПланОбмена = ПолучитьТекстОтборовДляЗагрузки(ОбщиеПеременные, ИмяПроцедурыОтборПланОбмена); 
	ТекОтбор = ОбщиеПеременные.ШаблонДереваОтборПоСвойствамПланаОбмена.Скопировать();
	Если ЗначениеЗаполнено(ТекстПроцедурыОтборПланОбмена) Тогда
		ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
		ТХДок = Новый ТекстовыйДокумент;
		ТХДок.ДобавитьСтроку(ТекстПроцедурыОтборПланОбмена);
		ТХДок.Записать(ИмяВремФайла);
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяВремФайла);
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.ЛокальноеИмя = "ОтборПоСвойствамПланаОбмена" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(ЧтениеXML, ОбщиеПеременные, ТекОтбор);
		КонецЕсли;
		ЧтениеXML.Закрыть();
		Попытка
			УдалитьФайлы(ИмяВремФайла);
		Исключение
		КонецПопытки
	КонецЕсли;
	ОбщиеПеременные.ОтборыПоСвойствамПланаОбмена.Вставить(ИмяПроцедурыОтборПланОбмена, ТекОтбор);	
КонецПроцедуры

Процедура ПрочитатьОтборОбъекта(ОбщиеПеременные, ИмяПроцедурыОтборОбъекта)
	Если ОбщиеПеременные.ОтборыПоСвойствамОбъекта.Получить(ИмяПроцедурыОтборОбъекта) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстПроцедурыОтборОбъекта = ПолучитьТекстОтборовДляЗагрузки(ОбщиеПеременные, ИмяПроцедурыОтборОбъекта);
	ТекОтбор = ОбщиеПеременные.ШаблонДереваОтборПоСвойствамОбъекта.Скопировать();
	Если ЗначениеЗаполнено(ТекстПроцедурыОтборОбъекта) Тогда
		ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
		ТХДок = Новый ТекстовыйДокумент;
		ТХДок.ДобавитьСтроку(ТекстПроцедурыОтборОбъекта);
		ТХДок.Записать(ИмяВремФайла);
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяВремФайла);
		ЧтениеXML.Прочитать();
		Если ЧтениеXML.ЛокальноеИмя = "ОтборПоСвойствамОбъекта" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ЗагрузитьДеревоОтбораПоСвойствамОбъекта(ЧтениеXML, ОбщиеПеременные, ТекОтбор);
		КонецЕсли;
		ЧтениеXML.Закрыть();
		Попытка
			УдалитьФайлы(ИмяВремФайла);
		Исключение
		КонецПопытки
	КонецЕсли;
	ОбщиеПеременные.ОтборыПоСвойствамОбъекта.Вставить(ИмяПроцедурыОтборОбъекта, ТекОтбор);	
КонецПроцедуры 

Функция ПолучитьТекстОтборовДляЗагрузки(ОбщиеПеременные, ИмяПроцедурыОтбор)
	ТекстПроцедурыОтбор = СокрЛП(ПолучитьТекстОбработчика(ОбщиеПеременные, ИмяПроцедурыОтбор)); 
	Если ЗначениеЗаполнено(ТекстПроцедурыОтбор) Тогда
		ТекстПроцедурыОтбор = СокрЛП(СтрЗаменить(ТекстПроцедурыОтбор, "Возврат ", ""));
		ТекстПроцедурыОтбор = СокрЛП(СтрЗаменить(ТекстПроцедурыОтбор, "|", "")); 
		Если Прав(ТекстПроцедурыОтбор, 1) = ";" Тогда
			ТекстПроцедурыОтбор = СокрЛП(Лев(ТекстПроцедурыОтбор, СтрДлина(ТекстПроцедурыОтбор)-1));
		КонецЕсли;
		// Удаление первой и последней кавычки.
		ДлинаСтроки = СтрДлина(ТекстПроцедурыОтбор);
		ТекстПроцедурыОтбор = Сред(ТекстПроцедурыОтбор,2, ДлинаСтроки - 2);
	КонецЕсли;
	Возврат ТекстПроцедурыОтбор;
КонецФункции

Функция ТекстВнутриКавычек(Стр, НомерВхождения = 1)
	Позиция1 = СтрНайти(Стр, """",,,НомерВхождения);
	Позиция2 = СтрНайти(Стр, """",,,НомерВхождения + 1);
	Если Позиция1 = 0 Или Позиция2 = 0 Тогда
		Возврат Стр;
	КонецЕсли;
	Возврат СокрЛП(Сред(Стр,Позиция1+1,Позиция2-Позиция1-1)); 
КонецФункции

Функция ТекстПослеРавно(Стр)
	Позиция1 = СтрНайти(Стр, "=");
	Если Позиция1 = 0 Тогда
		Возврат "";
	КонецЕсли;
	Результат = СокрЛП(Сред(Стр, Позиция1 + 1));
	
	Результат = СтрЗаменить(Результат, ";", "");
	Если СтрНайти(Результат, """") > 0 Тогда
		Результат = ТекстВнутриКавычек(Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ПроверкаЗахвата(ОбщиеПеременные, ПравилоСсылка)
	Если НЕ ОбщиеПеременные.СовместнаяРабота Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ОбщиеПеременные.СоздатьНовуюРегистрацию Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если ОбщиеПеременные.ЗахваченныеПравила.Найти(ПравилоСсылка) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция НайтиСоздатьТег(ОбщиеПеременные, ТегСтрокой)
	Если ТегСтрокой = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТекТегСсылка = Справочники.Теги.НайтиПоНаименованию(СокрЛП(ТегСтрокой),,,ОбщиеПеременные.Регистрация);
	Если ЗначениеЗаполнено(ТекТегСсылка) Тогда 
		Возврат ТекТегСсылка;
	КонецЕсли;
	ТекТегОбъект = Справочники.Теги.СоздатьЭлемент();
	ТекТегОбъект.Наименование = СокрЛП(ТегСтрокой);
	ТекТегОбъект.Владелец = ОбщиеПеременные.Регистрация;
	ТекТегОбъект.ОбменДанными.загрузка = Истина; 
	ТекТегОбъект.Записать();
	Возврат ТекТегОбъект.Ссылка;
КонецФункции

Процедура УдалитьВременныеФайлы(ОбщиеПеременные)
	Если ОбщиеПеременные.Свойство("ПомещенныеФайлы") = Истина Тогда
		Для Каждого ПомещенныйФайл Из ОбщиеПеременные.ПомещенныеФайлы Цикл
			Попытка
				УдалитьФайлы(ПомещенныйФайл.Хранение);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли