#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
    ИмяНовойРегистрации = ВладелецФормы.ИмяНовойРегистрации;
	ИмяНовойКонфигурации = ВладелецФормы.ИмяНовойКонфигурации; 

	Если ЗначениеЗаполнено(Объект.Регистрация) Тогда
		ПереключательРегистрация = 1;
	ИначеЕсли Объект.СоздатьНовуюРегистрацию Тогда
		ПереключательРегистрация = 0;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Конфигурация) Тогда 
		ПереключательКонфигурация = 1;
	ИначеЕсли Объект.СоздатьНовуюКонфигурацию Тогда
		ПереключательКонфигурация = 0;
	КонецЕсли;
	УправлениеДоступностью();
КонецПроцедуры
#КонецОбласти 
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УправлениеДоступностью()
	Элементы.ГруппаКонфигурация.Доступность = Истина;
	Элементы.Регистрация.Доступность = (ПереключательРегистрация = 1);
	Элементы.Релиз.Доступность = (ПереключательКонфигурация = 1); 
	Элементы.ИмяНовойРегистрации.Доступность = (ПереключательРегистрация = 0);
	Элементы.ИмяНовойКонфигурации.Доступность = (ПереключательКонфигурация = 0 И ПереключательРегистрация = 0);
	Элементы.Группа4.Доступность = (ПереключательРегистрация = 0);
	Элементы.Группа2.Доступность = (ПереключательРегистрация = 0);
	Элементы.ОбновлятьМетаданные.Доступность = (ПереключательКонфигурация = 1);
КонецПроцедуры


&НаКлиенте
Процедура РегистрацияПриИзменении(Элемент)
	ОбновитьРелиз(); 
	ПереключательКонфигурация = 1; 
	ИмяНовойКонфигурации = "";
	УправлениеДоступностью();
КонецПроцедуры 

&НаСервере
Процедура ОбновитьРелиз() 
	Если ЗначениеЗаполнено(Объект.Регистрация) Тогда
		ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Регистрация, "Конфигурация, Наименование"); 
		Объект.Конфигурация = ДанныеРегистрации.Конфигурация; 
	Иначе
		Объект.Конфигурация = Справочники.Релизы.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РелизПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ДанныеЗаполнены = Ложь; 
	Объект.СоздатьНовуюКонфигурацию = (ПереключательКонфигурация = 0); 
	Объект.СоздатьНовуюРегистрацию = (ПереключательРегистрация = 0);

	ОписаниеРезультата = "";
	Если ЗначениеЗаполнено(Объект.Регистрация) Тогда
		ОписаниеРезультата = НСтр("ru='Существующая регистрация %1 (%2)'");
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%1", СокрЛП(Объект.Регистрация));
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", ?(Объект.ОбновлятьМетаданные, НСтр("ru='с обновлением метаданных'"), НСтр("ru='без обновления метаданных'")));
		ДанныеЗаполнены = Истина; 
	ИначеЕсли Объект.СоздатьНовуюРегистрацию Тогда
		ОписаниеРезультата = НСтр("ru='Новая регистрация %1, конфигурация %2'");
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%1", СокрЛП(ИмяНовойРегистрации));
		Если ЗначениеЗаполнено(Объект.Конфигурация) Тогда
			ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", СокрЛП(Объект.Конфигурация) + ?(Объект.ОбновлятьМетаданные, НСтр("ru=' (с обновлением метаданных)'"), НСтр("ru=' (без обновления метаданных)'")));  
			ДанныеЗаполнены = Истина; 
		ИначеЕсли Объект.СоздатьНовуюКонфигурацию Тогда
			ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "конфигурация", "новая конфигурация");  
			ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", СокрЛП(ИмяНовойКонфигурации));  
			ДанныеЗаполнены = Истина;
		КонецЕсли;
	КонецЕсли;  
	Если ДанныеЗаполнены = Ложь Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрана регистрация для загрузки'")); 
		Возврат;
	КонецЕсли;
	Результат = Новый Структура("Регистрация, Конфигурация, СоздатьНовуюРегистрацию, СоздатьНовуюКонфигурацию, ОбновлятьМетаданные");
	ЗаполнитьЗначенияСвойств(Результат, Объект);
	Результат.Вставить("ИмяНовойКонфигурации", ИмяНовойКонфигурации); 
    Результат.Вставить("ИмяНовойРегистрации", ИмяНовойРегистрации); 
	Результат.Вставить("ОписаниеРезультата", ОписаниеРезультата);
	Результат.Вставить("ЗагрузкаВСуществующуюРегистрацию", ЗначениеЗаполнено(Объект.Регистрация));
	Закрыть(Результат);

КонецПроцедуры


&НаКлиенте
Процедура ПереключателиПриИзменении(Элемент)
	Если ПереключательРегистрация = 0 Тогда
		Объект.Регистрация = ""; 
	Иначе
		ИмяНовойРегистрации = "";
	КонецЕсли;
	Если ПереключательКонфигурация = 0 Тогда
		Объект.Конфигурация = "";
	Иначе
		ИмяНовойКонфигурации = "";
	КонецЕсли;
	УправлениеДоступностью();
КонецПроцедуры

#КонецОбласти
