#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ВыполнитьЗагрузкуМодуляМенеджера(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	// Инициализация общих переменных необходимых для работы процедуры.
	ОбщиеПеременные.Вставить("НомерСтрокиНачалоАлгоритмов", 0);
	ОбщиеПеременные.Вставить("НомерСтрокиКонецАлгоритмов", 0);
	ОбщиеПеременные.Вставить("ТекущийТег", Новый Массив);
	ОбщиеПеременные.Вставить("ТекущийТегПКЗ", Новый Массив);

	ОбщиеПеременные.Вставить("ЭтоМодульМенеджера", Ложь);
	ОбщиеПеременные.Вставить("ТегОткрытие", "");
	ОбщиеПеременные.Вставить("ТегЗакрытие", "");
	ОбщиеПеременные.Вставить("ОбъектМетаданных_МодульМенеджера", Неопределено);
	ОбщиеПеременные.Вставить("ИспользоватьРазделениеМодуля", Ложь);
	ОбщиеПеременные.Вставить("Ошибки", ""); 
	ОбщиеПеременные.Вставить("Отказ", Ложь);
	ОбщиеПеременные.Вставить("СообщениеОРезультате", "");
	ОбщиеПеременные.Вставить("ИмяМодуляАлгоритмы",""); 
	ОбщиеПеременные.Вставить("КонфигурацияВладелец",Неопределено);
	ОбщиеПеременные.Вставить("СовместнаяРабота", Константы.СовместнаяРабота.Получить());
	
	КонфигурацияВладелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщиеПеременные.Конфигурация, "КонфигурацияВладелец");
	Если ЗначениеЗаполнено(КонфигурацияВладелец) И НЕ КонфигурацияВладелец.Предопределенный Тогда
		ОбщиеПеременные.Вставить("КонфигурацияВладелец",КонфигурацияВладелец);
	Иначе
		ИмяКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщиеПеременные.Конфигурация, "Имя");
		КонфигурацияВладелец = Справочники.Конфигурации.НайтиПоНаименованию(ИмяКонфигурации);
		Если НЕ ЗначениеЗаполнено(КонфигурацияВладелец) Тогда
			КонфигурацияВладелецОбъект = Справочники.Конфигурации.СоздатьЭлемент();
			КонфигурацияВладелецОбъект.Наименование = ИмяКонфигурации;
			КонфигурацияВладелецОбъект.ОбменДанными.Загрузка = Истина;
			КонфигурацияВладелецОбъект.Записать();
			КонфигурацияВладелец = КонфигурацияВладелецОбъект.Ссылка;
		КонецЕсли; 
		РелизОбъект = ОбщиеПеременные.Конфигурация.ПолучитьОбъект();
		РелизОбъект.КонфигурацияВладелец = КонфигурацияВладелец;
		РелизОбъект.ОбменДанными.Загрузка = Истина;
		РелизОбъект.Записать();
		ОбщиеПеременные.КонфигурацияВладелец = КонфигурацияВладелец;
	КонецЕсли;

	Если ОбщиеПеременные.ИтерацияЗагрузки = 2 Тогда 
		СтрокаПрогресса = НСтр("ru='Подготовка к загрузке: очистка временных данных от предыдущей загрузки'");
		ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
		// Удаление временных копий которые могли остаться с прошлых загрузок
		УдалитьВременныеКопии(ОбщиеПеременные, Неопределено);
	КонецЕсли;
	СтрокаПрогресса = НСтр("ru='Чтение модуля менеджера'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
	ДанныеДляЗагрузки = Новый Структура; 
	СтрокаКомментария = "";
	Если ОбщиеПеременные.ИсточникЗагрузки < 2 Тогда
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ОбщиеПеременные.ПомещенныеФайлы[0].Хранение, КодировкаТекста.UTF8);
		СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстДок, 1));
		Если Лев(СтрокаКомментария,3) <> "// " Тогда
			СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстДок, 2));
		КонецЕсли;

		ДанныеДляЗагрузки.Вставить("МенеджерОбменаЧерезУниверсальныйФормат", ТекстДок.ПолучитьТекст());
	Иначе
		ИмяМодуля = ОбщиеПеременные.ИмяМенеджераКонвертации; 
		СтрокаПоиска = "\CommonModules\" + ИмяМодуля + "\" + ?(ОбщиеПеременные.ИсточникЗагрузки = 3, "Ext\" , "") + "Module.bsl";
		Если ОбщиеПеременные.Свойство("ДанныеДляЗагрузки") = Истина Тогда
			ДанныеДляЗагрузки = ОбщиеПеременные.ДанныеДляЗагрузки;
		Иначе
			Для Каждого ПомещенныйФайл Из ОбщиеПеременные.ПомещенныеФайлы Цикл
				Если СтрНайти(ПомещенныйФайл.ПолноеИмя, СтрокаПоиска) > 0 Тогда
					ТекстДок = Новый ТекстовыйДокумент;
					ТекстДок.Прочитать(ПомещенныйФайл.Хранение, КодировкаТекста.UTF8);
					ТекстМодуля = ТекстДок.ПолучитьТекст();
					СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстМодуля, 1));
					Если Лев(СтрокаКомментария,3) <> "// " Тогда
						СтрокаКомментария = СокрЛП(СтрПолучитьСтроку(ТекстМодуля, 2));
					КонецЕсли;
					ДанныеДляЗагрузки.Вставить("МенеджерОбменаЧерезУниверсальныйФормат", ТекстМодуля);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ДанныеДляЗагрузки.Количество() = 0 Тогда
			ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки", Ложь, НСтр("ru='Не удалось найти общий модуль '") + ИмяМодуля);
			ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ОбщиеМодули = Новый Массив; 
	ПользовательскиеМодули = Новый Структура;
	// Создание конвертации если необходимо.
	Если ОбщиеПеременные.СоздатьНовуюКонвертацию Тогда
		СтрокаПрогресса = НСтр("ru='Создание конвертации'");
		ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
		Если НЕ ЗначениеЗаполнено(ОбщиеПеременные.ИмяНовойКонвертации) И ЗначениеЗаполнено(СтрокаКомментария) Тогда
			// Прочитаем имя из текста модуля.
			Если Лев(СтрокаКомментария,15) = "// Конвертация " Тогда
				ПозицияКонецИмени = Найти(СтрокаКомментария, " от ");
				Если ПозицияКонецИмени > 0 Тогда
					ОбщиеПеременные.ИмяНовойКонвертации = Сред(СтрокаКомментария,16, ПозицияКонецИмени - 16);
				Иначе
					ОбщиеПеременные.ИмяНовойКонвертации = Прав(СтрокаКомментария,СтрДлина(СтрокаКомментария) - 15);
				КонецЕсли;
			ИначеЕсли Лев(СтрокаКомментария,19) = "// Менеджер обмена " Тогда
				ПозицияНачалоИмени = Найти(СтрокаКомментария, "(");
				ПозицияКонецИмени = Найти(СтрокаКомментария, " от ");
				Если ПозицияКонецИмени > 0 И ПозицияНачалоИмени > 0 Тогда
					ОбщиеПеременные.ИмяНовойКонвертации = Сред(СтрокаКомментария,ПозицияНачалоИмени + 1, ПозицияКонецИмени - ПозицияНачалоИмени - 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		КонвертацияОбъект = Справочники.Конвертации.СоздатьЭлемент();
		КонвертацияОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO;
		КонвертацияОбъект.Наименование = ОбщиеПеременные.ИмяНовойКонвертации;
		КонвертацияОбъект.Конфигурация = ОбщиеПеременные.Конфигурация; 
		КонвертацияОбъект.ВерсияФорматаМенеджера = "2";
		КонвертацияОбъект.Статус = Перечисления.СостоянияПравил.ВРаботе;
		
		// Версии формата.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ Справочник.ВерсииФормата
		|ГДЕ ПометкаУдаления = Ложь И Расширение = Ложь И ЭтоГруппа = Ложь
		|УПОРЯДОЧИТЬ ПО Наименование УБЫВ";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки", Ложь, НСтр("ru='Не найдено ни одной версии формата. Загрузка не может быть выполнена.'"));
			ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
			Возврат;
		КонецЕсли; 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтрВерсия = КонвертацияОбъект.ВерсииФормата.Добавить();
		СтрВерсия.ВерсияФормата = Выборка.Ссылка;
		КонвертацияОбъект.Записать();
		ОбщиеПеременные.Конвертация = КонвертацияОбъект.Ссылка;
		ПроверитьНаличиеДополнительныхМодулей(ОбщиеПеременные, ТекстДок, ОбщиеМодули);
	Иначе
		ОбщиеПеременные.ИспользоватьРазделениеМодуля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщиеПеременные.Конвертация, "ИспользоватьРазделениеМодуля");
		// Несколько модулей. Надо вычислить модуль алгоритмов.
		Если ОбщиеПеременные.ИспользоватьРазделениеМодуля Тогда
			СтрокаПрогресса = НСтр("ru='Чтение дополнительных модулей'");
			ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Наименование, Раздел, Ссылка
			|ИЗ Справочник.ДополнительныеМодули
			|ГДЕ Владелец = &Конвертация";
			Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.Раздел = Перечисления.РазделыДополнительныхМодулей.Алгоритмы Тогда
					ОбщиеПеременные.ИмяМодуляАлгоритмы = Выборка.Наименование;
				ИначеЕсли Выборка.Раздел = Перечисления.РазделыДополнительныхМодулей.Пользовательский Тогда
					ПользовательскиеМодули.Вставить(СокрЛП(Выборка.Наименование), Выборка.Ссылка);
				КонецЕсли;
				ОбщиеМодули.Добавить(СокрЛП(Выборка.Наименование));
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	ТегиМодуляМенеджера = КонвертацияДанныхXDTOСервер.ТегиДляМодуляМенеджераОбъекта();
	ОбщиеПеременные.ТегОткрытие = ТегиМодуляМенеджера.ТегОткрытие;
	ОбщиеПеременные.ТегЗакрытие = ТегиМодуляМенеджера.ТегЗакрытие;
	ОбщиеПеременные.Вставить("ПользовательскиеМодули", ПользовательскиеМодули);
	ОбщиеПеременные.Вставить("ТаблицаРезультатов", ПодготовитьСтруктуруТаблицыРезультат());

	Конфигурация = ОбщиеПеременные.Конфигурация;
	СтрокаПрогресса = НСтр("ru='Анализ модуля'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
	Если ОбщиеПеременные.ИспользоватьРазделениеМодуля Тогда
		Если ОбщиеПеременные.Свойство("ДанныеДляЗагрузки") = Истина Тогда
			Для Каждого ТекМодуль Из ДанныеДляЗагрузки Цикл 
				ОбщиеПеременные.Вставить("ТекущийЗагружаемыйМодуль",ТекМодуль.Ключ);
				ОбщиеПеременные.ЭтоМодульМенеджера = Ложь;
				ВыполнитьЗагрузкуМодуля(ОбщиеПеременные, ТекМодуль.Значение);
			КонецЦикла;
		Иначе
			// Загружаем базовый модуль.
			ТХДок = ДанныеДляЗагрузки.МенеджерОбменаЧерезУниверсальныйФормат;
			ОбщиеПеременные.Вставить("ТекущийЗагружаемыйМодуль","МенеджерОбменаЧерезУниверсальныйФормат");
			ВыполнитьЗагрузкуМодуля(ОбщиеПеременные, ТХДок); 
			// Другие модули.
			СтрокаПоиска = "\CommonModules\%ИмяМодуля%\" + ?(ОбщиеПеременные.ИсточникЗагрузки = 3, "Ext\" , "") + "Module.bsl";
			Для Каждого ПомещенныйФайл Из ОбщиеПеременные.ПомещенныеФайлы Цикл
				ПолноеИмяФайла = ПомещенныйФайл.ПолноеИмя;
				МодульНайден = Ложь;
				Для Каждого ОбщийМодуль Из ОбщиеМодули Цикл
					Если ОбщийМодуль = "МенеджерОбменаЧерезУниверсальныйФормат" Тогда
						Продолжить;
					КонецЕсли;
					СтрокаПоискаЛок = СтрЗаменить(СтрокаПоиска, "%ИмяМодуля%", ОбщийМодуль);
					Если СтрНайти(ПомещенныйФайл.ПолноеИмя, СтрокаПоискаЛок) > 0 Тогда
						ТХДок = Новый ТекстовыйДокумент;
						ТХДок.Прочитать(ПомещенныйФайл.Хранение, КодировкаТекста.UTF8);  
						ОбщиеПеременные.Вставить("ТекущийЗагружаемыйМодуль",ОбщийМодуль);
						ОбщиеПеременные.ЭтоМодульМенеджера = Ложь;
						ВыполнитьЗагрузкуМодуля(ОбщиеПеременные, ТХДок.ПолучитьТекст());
						МодульНайден = Истина;
					КонецЕсли;
				КонецЦикла;
				Если МодульНайден Тогда
					Продолжить;
				КонецЕсли;
				// Поиск модулей менеджера (для любой конвертации) и модуля алгоритмов для новой конвертации. 
				Если СтрНайти(ПомещенныйФайл.ПолноеИмя, "ManagerModule.bsl")>0 Тогда
					ТХДок = Новый ТекстовыйДокумент;
					ТХДок.Прочитать(ПомещенныйФайл.Хранение, КодировкаТекста.UTF8);
					ТекстМодуля = ТХДок.ПолучитьТекст();
					ЕстьПравила = ПроверитьНаличиеПредопределеннойОбласти(ТекстМодуля, ОбщиеПеременные.ТегОткрытие); 
					Если НЕ ЕстьПравила Тогда
						Продолжить;
					КонецЕсли;
					ОбщиеПеременные.ЭтоМодульМенеджера = Истина; 
					ОбщиеПеременные.Вставить("ТекущийЗагружаемыйМодуль","МодульМенеджера_" + ОпределитьИмяМодуля(ПомещенныйФайл.ПолноеИмя));
					ВыполнитьЗагрузкуМодуля(ОбщиеПеременные, ТекстМодуля); 
					ОбщиеПеременные.ЭтоМодульМенеджера = Ложь;
				ИначеЕсли НЕ ЗНачениеЗаполнено(ОбщиеПеременные.ИмяМодуляАлгоритмы) И СтрНайти(ПомещенныйФайл.ПолноеИмя, "\CommonModules\") И СтрНайти(ПомещенныйФайл.ПолноеИмя, "Module.bsl")>0 Тогда
					ТХДок = Новый ТекстовыйДокумент;
					ТХДок.Прочитать(ПомещенныйФайл.Хранение, КодировкаТекста.UTF8);
					ТекстМодуля = ТХДок.ПолучитьТекст();
					ЭтоМодульАлгоритмы = ПроверитьНаличиеПредопределеннойОбласти(ТекстМодуля, "#Область Алгоритмы");
					Если НЕ ЭтоМодульАлгоритмы Тогда
						Продолжить;
					КонецЕсли;
					ИмяМодуляАлгоритмы = ОпределитьИмяМодуля(ПомещенныйФайл.ПолноеИмя);   
					ОбщиеПеременные.ИмяМодуляАлгоритмы = ИмяМодуляАлгоритмы;
					// Добавить Алгоритмы в справочник доп модулей.
					СпрМодули = Справочники.ДополнительныеМодули.СоздатьЭлемент();
					СпрМодули.Владелец = ОбщиеПеременные.Конвертация;
					СпрМодули.Наименование = ИмяМодуляАлгоритмы;
					СпрМодули.Раздел = Перечисления.РазделыДополнительныхМодулей.Алгоритмы;
					СпрМодули.ОбменДанными.Загрузка = Истина;
					СпрМодули.Записать();
					
					ОбщиеПеременные.Вставить("ТекущийЗагружаемыйМодуль",ИмяМодуляАлгоритмы);
					ВыполнитьЗагрузкуМодуля(ОбщиеПеременные, ТекстМодуля);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	Иначе
		ТХДок = ДанныеДляЗагрузки.МенеджерОбменаЧерезУниверсальныйФормат;
		ОбщиеПеременные.Вставить("ТекущийЗагружаемыйМодуль", "");
		ОбщиеПеременные.ЭтоМодульМенеджера = Ложь;
		ВыполнитьЗагрузкуМодуля(ОбщиеПеременные, ТХДок);
	КонецЕсли;
	СтрокаПрогресса = НСтр("ru='Заполнение правил'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
	
	ЗагрузитьПроцедурыИФункцииВОбъектыМетаданных(ОбщиеПеременные);
	
	Если ОбщиеПеременные.ИспользоватьРазделениеМодуля И ОбщиеПеременные.СоздатьНовуюКонвертацию Тогда
		ОбработатьДополнительныеМодули(ОбщиеПеременные);
	КонецЕсли;
	
	СтрокаПрогресса = НСтр("ru='Удаление временных файлов'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
	// Удаление временных файлов.
	Если ОбщиеПеременные.Свойство("ПомещенныеФайлы") = Истина Тогда
		Для Каждого ПомещенныйФайл Из ОбщиеПеременные.ПомещенныеФайлы Цикл
			Попытка
				УдалитьФайлы(ПомещенныйФайл.Хранение);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Если АдресВременногоХранилища <> Неопределено Тогда
		ВозвращаемоеЗначение = Новый Структура("Конвертация, Успешно, Ошибки", ОбщиеПеременные.Конвертация, НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.Ошибки); 
		Если ЗначениеЗаполнено(ОбщиеПеременные.СообщениеОРезультате) Тогда 
			ВозвращаемоеЗначение.Вставить("СообщениеОРезультате", ОбщиеПеременные.СообщениеОРезультате);
		КонецЕсли;
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
	КонецЕсли; 
КонецПроцедуры 

Процедура СравнитьПравилаКонвертации(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	ОбщиеПеременные.Вставить("Ошибки", ""); 
	ОбщиеПеременные.Вставить("Отказ", Ложь); 
	ОбщиеПеременные.Вставить("СовместнаяРабота", Константы.СовместнаяРабота.Получить());
	ТаблицаРасхождений = Новый ДеревоЗначений;
	ТаблицаРасхождений.Колонки.Добавить("Правило1");
	ТаблицаРасхождений.Колонки.Добавить("Правило2");
	ТаблицаРасхождений.Колонки.Добавить("ИнформацияЗагрузки");
	ТаблицаРасхождений.Колонки.Добавить("ПравилоРазделенное");
	ТаблицаРасхождений.Колонки.Добавить("ПравилоЗахвачено");
	
	Уровень0 = ТаблицаРасхождений.Строки;
	// Правила обработки данных
	СтрокаПрогресса = НСтр("ru='Поиск расхождений в параметрах конвертации'");
	Уровень0_строка = Уровень0.Добавить();
	Уровень0_строка.Правило1 = "Параметры конвертации"; 
	Уровень1 = Уровень0_строка.Строки;
	НайтиРасхожденияВПараметрахКонвертации(ОбщиеПеременные, Уровень1);
	
	// Правила обработки данных
	Уровень0_строка = Уровень0.Добавить();
	Уровень0_строка.Правило1 = "Правила обработки данных"; 
	Уровень1 = Уровень0_строка.Строки;

	СтрокаПрогресса = НСтр("ru='Поиск расхождений в правилах обработки данных'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);

	СписокРеквизитов = "АлгоритмПриОбработке, АлгоритмВыборкаДанных, ИспользоватьДляОтправки, ИспользоватьДляПолучения, ОбъектВыборки, ОчисткаДанных, СпособВыборки, ПравилоКонвертацииОбъекта";
	СписокРеквизитовОтправка = "#АлгоритмВыборкаДанных#";
	НайтиРасхожденияВПравилах(ОбщиеПеременные, "ПравилаОбработкиДанных", "Наименование", СписокРеквизитов, Уровень1, СписокРеквизитовОтправка);
	
	Если Уровень1.Количество() = 0 Тогда
		Уровень0.Удалить(Уровень0_строка);
	КонецЕсли;
	
	// Правила конвертации объектов
	Уровень0_строка = Уровень0.Добавить();
	Уровень0_строка.Правило1 = "Правила конвертации объектов"; 
	Уровень1 = Уровень0_строка.Строки;
	СписокРеквизитов = "АлгоритмПриОтправкеДанных, АлгоритмПередПолучениемДанных, АлгоритмПриПолученииДанных, АлгоритмПослеЗагрузкиВсехДанных," +
		"ВариантИдентификации, ИспользоватьДляОтправки, ИспользоватьДляПолучения, ОбъектКонфигурации, ОбъектСДвижениями, ОбъектФормата," +
		"ПравилоДляГруппыСправочника";
	СписокРеквизитовОтправка = "#АлгоритмПриОтправкеДанных#";
	СписокРеквизитовПолучение = "#АлгоритмПередПолучениемДанных#АлгоритмПриПолученииДанных#АлгоритмПослеЗагрузкиВсехДанных#ВариантИдентификации#";
	СтрокаПрогресса = НСтр("ru='Поиск расхождений в правилах конвертации объектов'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);

	НайтиРасхожденияВПравилах(ОбщиеПеременные, "ПравилаКонвертацииОбъектов", "Код", СписокРеквизитов, Уровень1, СписокРеквизитовОтправка, СписокРеквизитовПолучение);

	Если Уровень1.Количество() = 0 Тогда
		Уровень0.Удалить(Уровень0_строка);
	КонецЕсли;
	
	
	// Правила конвертации предопределенных данных
	Уровень0_строка = Уровень0.Добавить();
	Уровень0_строка.Правило1 = "Правила конвертации предопределенных данных"; 
	Уровень1 = Уровень0_строка.Строки;
	СписокРеквизитов = "ОбъектКонфигурации, ОбъектФормата,ИспользоватьДляОтправки, ИспользоватьДляПолучения";
	СтрокаПрогресса = НСтр("ru='Поиск расхождений в правилах конвертации предопределенных данных'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
	НайтиРасхожденияВПравилах(ОбщиеПеременные, "ПравилаКонвертацииПредопределенныхДанных", "Код", СписокРеквизитов, Уровень1);

	Если Уровень1.Количество() = 0 Тогда
		Уровень0.Удалить(Уровень0_строка);
	КонецЕсли;

	
	// Алгоритмы
	Уровень0_строка = Уровень0.Добавить();
	Уровень0_строка.Правило1 = "Алгоритмы"; 
	Уровень1 = Уровень0_строка.Строки;
	СписокРеквизитов = "Алгоритм, ИспользуетсяПриЗагрузке, Параметры, Экспортный, ЭтоФункция, Комментарий";
	СтрокаПрогресса = НСтр("ru='Поиск расхождений в алгоритмах'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
	НайтиРасхожденияВПравилах(ОбщиеПеременные, "Алгоритмы", "Код", СписокРеквизитов, Уровень1);
	Если Уровень1.Количество() = 0 Тогда
		Уровень0.Удалить(Уровень0_строка);
	КонецЕсли;
	
	Если АдресВременногоХранилища <> Неопределено Тогда
		ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки, ТаблицаРасхождений", НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.Ошибки, Новый ХранилищеЗначения(ТаблицаРасхождений)); 
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
	КонецЕсли; 
КонецПроцедуры

Процедура ПеренестиИзмененияВПравилах(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	СтрокаПрогресса = НСтр("ru='Перенос изменений в правилах'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);
	ОбщиеПеременные.Вставить("Ошибки", ""); 
	ОбщиеПеременные.Вставить("Отказ", Ложь);
	ТаблицаРасхождений = ОбщиеПеременные.ВыбранныеРасхождения.Получить();
	Для Каждого СтрокаТаб Из ТаблицаРасхождений Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаб.Правило2) И ЗначениеЗаполнено(СтрокаТаб.Правило1) Тогда
			// Удаление правила.
			ОбработатьСтроку_Удаление(СтрокаТаб, ОбщиеПеременные);
		Иначе
			ОбработатьСтроку_Изменение(СтрокаТаб, ОбщиеПеременные);
		КонецЕсли;
	КонецЦикла;
	
	Если АдресВременногоХранилища <> Неопределено Тогда
		ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки", НЕ ОбщиеПеременные.Отказ, ОбщиеПеременные.Ошибки); 
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьВременныеКопии(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	КоличествоОбъектов = 0;
	Ошибки = "";
	// Параметры
	КонвертацияОбъект = ОбщиеПеременные.Конвертация.ПолучитьОбъект();
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого СтрТЧ Из КонвертацияОбъект.Параметры Цикл
		Если СтрТЧ.ВременнаяКопия Тогда
			МассивСтрокКУдалению.Добавить(СтрТЧ);
		КонецЕсли;
	КонецЦикла;
	Если МассивСтрокКУдалению.Количество() > 0 Тогда
		Для Каждого СтрТЧ Из МассивСтрокКУдалению Цикл
			КонвертацияОбъект.Параметры.Удалить(СтрТЧ);
		КонецЦикла;
		КонвертацияОбъект.Записать();
	КонецЕсли;
	Обработки.УдалениеКонвертации.ВыполнитьУдалениеПравил(ОбщиеПеременные.Конвертация, Истина, Истина, КоличествоОбъектов, Ошибки);
	Если АдресВременногоХранилища <> Неопределено Тогда
		ВозвращаемоеЗначение = Новый Структура("Успешно, Ошибки", Ошибки = "", Ошибки);
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
	КонецЕсли;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеДополнительныхМодулей(ОбщиеПеременные, ТХДок, ОбщиеМодули)
	Стр = "";
	НайденаПроцедура = Ложь;
	Для НомерСтроки = 1 По ТХДок.КоличествоСтрок() Цикл
		Стр = СокрЛП(ТХДок.ПолучитьСтроку(НомерСтроки));
		Если СтрНайти(Стр, "Процедура ЗаполнитьПравилаОбработкиДанных(") > 0
			Или СтрНайти(Стр, "Процедура ЗаполнитьПравилаКонвертацииОбъектов(") > 0 Тогда
			НайденаПроцедура = Истина;
			Продолжить;
		ИначеЕсли НайденаПроцедура И СтрНайти(Стр, "КонецПроцедуры") > 0 Тогда
			НайденаПроцедура = Ложь;
			Продолжить; 
		ИначеЕсли НЕ НайденаПроцедура Тогда
			Продолжить;
		КонецЕсли;     
		Если СтрНайти(Стр, "//") > 0 Тогда
			Продолжить;
		КонецЕсли;
		Стр = СтрЗаменить(Стр,Символы.Таб, "");
		ПозицияТочки = СтрНайти(Стр, ".");
		ПозицияВызова1 = СтрНайти(Стр, "ДобавитьПОД_");
		ПозицияВызова2 = СтрНайти(Стр, "ДобавитьПКО_");
		Если ПозицияТочки > 0 И (ПозицияВызова1 > 0 Или ПозицияВызова2 > 0) Тогда
			ИмяМодуля = Лев(Стр, ПозицияТочки - 1);
			// Исключить имя модуля, совпадающее с коллекцией метаданных.
			Если ИмяМодуля = "Документы" Или  ИмяМодуля = "Справочники"
				Или ИмяМодуля = "РегистрыСведений" Или ИмяМодуля = "ПланыВидовХарактеристик" 
				Или ИмяМодуля = "РегистрыРасчета" Или ИмяМодуля = "ПланыВидовРасчета" 
				Или ИмяМодуля = "ПланыСчетов" Или ИмяМодуля = "РегистрыНакопления" Тогда
                Продолжить;
			КонецЕсли;
			Если ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
				ОбщиеМодули.Добавить(ИмяМодуля);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ОбщиеМодули.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	ОбщиеПеременные.ИспользоватьРазделениеМодуля = Истина;
	КонвертацияОбъект = ОбщиеПеременные.Конвертация.ПолучитьОбъект();
	КонвертацияОбъект.ИспользоватьРазделениеМодуля = Истина;
	КонвертацияОбъект.ОбменДанными.Загрузка = Истина;
	КонвертацияОбъект.Записать();
	Для Каждого ИмяМодуля Из ОбщиеМодули Цикл
		НовМодуль = Справочники.ДополнительныеМодули.СоздатьЭлемент();
		НовМодуль.Владелец = ОбщиеПеременные.Конвертация;
		НовМодуль.Наименование = ИмяМодуля;
		НовМодуль.ОбменДанными.Загрузка = Истина;
		НовМодуль.Записать();
	КонецЦикла;
КонецПроцедуры

Функция ПроверитьНаличиеПредопределеннойОбласти(ТХДок, ПодстрокаПоиска)
	Для НомерСтроки = 1 По СтрЧислоСтрок(ТХДок) Цикл
		Стр = СокрЛП(СтрПолучитьСтроку(ТХДок, НомерСтроки));
		Если СтрНайти(Стр, ПодстрокаПоиска) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Процедура ВыполнитьЗагрузкуМодуля(ОбщиеПеременные, ТХДок)
	ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов = 0; 
	ОбщиеПеременные.НомерСтрокиКонецАлгоритмов = 0;
	ОбщиеПеременные.ТекущийТег = Новый Массив;  
	ЗагрузитьПроцедурыИФункцииВТаблицы(ОбщиеПеременные, ТХДок);
	Если ОбщиеПеременные.Свойство("СтрокаЗаполнитьПКО") = Ложь Тогда
		Для Каждого СтрокаРезультат Из ОбщиеПеременные.ТаблицаРезультатов Цикл
			Если СтрНайти(СтрокаРезультат.ИмяПроцедурыФункции, "ЗаполнитьПравилаКонвертацииОбъектов") Тогда
				ОбщиеПеременные.Вставить("СтрокаЗаполнитьПКО", СтрокаРезультат);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ОпределитьИмяМодуля(ПолноеИмяФайла)
	ПозицияРазделителя2 = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПОиска.СКонца,,1);
	ПозицияРазделителя1 = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПОиска.СКонца,,2);
	ИмяКаталога = Сред(ПолноеИмяФайла, ПозицияРазделителя1 + 1, ПозицияРазделителя2 - ПозицияРазделителя1 - 1);
	Если ИмяКаталога <> "Ext" Тогда
		Возврат ИмяКаталога;
	КонецЕсли;
	ПозицияРазделителя2 = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПОиска.СКонца,,2);
	ПозицияРазделителя1 = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПОиска.СКонца,,3); 
	ИмяКаталога = Сред(ПолноеИмяФайла, ПозицияРазделителя1 + 1, ПозицияРазделителя2 - ПозицияРазделителя1 - 1);
	Возврат ИмяКаталога;
КонецФункции

Функция ЗаполнитьОбъектКонфигурацииДляВыгрузкиМодуля(ОбщиеПеременные, СтрокаРезультат, ОбъектКонфигурации)
	ИмяОбъектаМодульМенеджера = СтрЗаменить(СтрокаРезультат.ИмяМодуля, "МодульМенеджера_", "");
	Если ТипЗнч(ОбъектКонфигурации) = Тип("Строка") Тогда
		Возврат Неопределено;
	Иначе
		ИмяОбъектаКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектКонфигурации, "Имя");
	КонецЕсли;
	Если ИмяОбъектаМодульМенеджера = ИмяОбъектаКонфигурации Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЗапросОбъект = Новый Запрос;
	ЗАпросОбъект.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ Справочник.Объекты
	|ГДЕ ПОметкаУдаления = ЛОЖЬ И Владелец = &Конфигурация И Имя = &Имя";
	ЗапросОбъект.УстановитьПараметр("Конфигурация", ОбщиеПеременные.Конфигурация); 
	ЗапросОбъект.УстановитьПараметр("Имя", ИмяОбъектаМодульМенеджера);
    Выборка = ЗапросОбъект.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Процедура ОбработатьДополнительныеМодули(ОбщиеПеременные)
	МассивВсехМодулей = Новый Соответствие;
	Для Каждого СтрТаб Из ОбщиеПеременные.ТаблицаРезультатов Цикл
		Если СтрТаб.ИмяМодуля = ОбщиеПеременные.ИмяМодуляАлгоритмы
			Или СтрНайти(СтрТаб.ИмяМодуля, "МодульМенеджера_") Тогда
			Продолжить;
		КонецЕсли;
		Если МассивВсехМодулей.Получить(СтрТаб.ИмяМодуля) = Неопределено Тогда
			МассивВсехМодулей.Вставить(СтрТаб.ИмяМодуля);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ИмяМодуля Из МассивВсехМодулей Цикл
		ДопМодульСсылка = Справочники.ДополнительныеМодули.НайтиПоНаименованию(ИмяМодуля.Ключ,,,ОбщиеПеременные.КОнвертация);
		Если ДопМодульСсылка = Справочники.ДополнительныеМодули.ПустаяСсылка() Тогда
			МассивВсехМодулей.Удалить(ИмяМодуля.Ключ); 
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДопМодульСсылка.Раздел) Тогда
			МассивВсехМодулей.Удалить(ИмяМодуля.Ключ);
			Продолжить;
		КонецЕсли;
		// Предопределенные имена модуля можно заполнить без анализа.
		Если ИмяМодуля.Ключ = "МенеджерОбменаДокументыОтправка" Тогда
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка;
			Продолжить;
		ИначеЕсли ИмяМодуля.Ключ = "МенеджерОбменаДокументыПолучение" Тогда
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение;
			Продолжить;
		ИначеЕсли ИмяМодуля.Ключ = "МенеджерОбменаПрочееОтправка" Тогда
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка; 
			Продолжить;
		ИначеЕсли ИмяМодуля.Ключ = "МенеджерОбменаПрочееПолучение" Тогда
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ПрочееПолучение; 
			Продолжить;
		КонецЕсли;
		СтрокиТаблицы = ОбщиеПеременные.ТаблицаРезультатов.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля.Ключ));
		ЕстьДокументы = Ложь;
		ЕстьОтправка = Ложь;
		ЕстьПолучение = Ложь;
		ЕстьПрочие = Ложь;
		Для Каждого СтрокаПравила Из СтрокиТаблицы Цикл
			Если НЕ (СтрокаПравила.ИмяОбъектаМетаданных = "ПравилаОбработкиДанных"
				Или СтрокаПравила.ИмяОбъектаМетаданных = "ПравилаКонвертацииОбъектов") Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаПравила.Отправка Тогда
				ЕстьОтправка = Истина;
			КонецЕсли;
			Если СтрокаПравила.Получение Тогда
				ЕстьПолучение = Истина;
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(СтрокаПравила.СсылкаНаПравило) Тогда
				Продолжить;
			КонецЕсли;
			ЭтоПрочее = Истина;
			Если СтрокаПравила.ИмяОбъектаМетаданных = "ПравилаОбработкиДанных" Тогда
				ОбъектКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПравила.СсылкаНаПравило, "ОбъектВыборки");
				Если СтрНайти(СтрокаПравила.НаименованиеОбъекта, "Документ") > 0 Тогда
					ЭтоПрочее = Ложь;
				КонецЕсли;
			Иначе
				ОбъектКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПравила.СсылкаНаПравило, "ОбъектКонфигурации");
			КонецЕсли;
			Если ЗначениеЗаполнено(ОбъектКонфигурации) Тогда
				Если ТипЗнч(ОбъектКонфигурации) = Тип("Строка") И СтрНайти(ОбъектКонфигурации, "Документ.") > 0 Тогда
					ЭтоПрочее = Ложь;
				КонецЕсли;
				Если ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Объекты") 
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектКонфигурации, "Тип") = Перечисления.ТипыОбъектов.Документ Тогда
					ЭтоПрочее = Ложь;
				КонецЕсли;
			Иначе
				Продолжить;
			КонецЕсли;
			Если ЭтоПрочее Тогда
				ЕстьПрочие = Истина;
			Иначе
				ЕстьДокументы = Истина;
			КонецЕсли;
			Если ЕстьДокументы И ЕстьОтправка И ЕстьПолучение И ЕстьПрочие Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		// Попытка вычислить тип модуля.
		Если ЕстьДокументы И НЕ ЕстьПрочие И ЕстьОтправка Тогда
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка;
		ИначеЕсли ЕстьДокументы И НЕ ЕстьПрочие И ЕстьПолучение Тогда
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение; 
		ИначеЕсли НЕ ЕстьДокументы И ЕстьПрочие И ЕстьОтправка Тогда
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка;
        ИначеЕсли НЕ ЕстьДокументы И ЕстьПрочие И ЕстьПолучение Тогда
            МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.ПрочееПолучение;
		Иначе
			МассивВсехМодулей[ИмяМодуля.Ключ] = Перечисления.РазделыДополнительныхМодулей.Пользовательский;
		КонецЕсли;
	КонецЦикла;
	// Есть ли дубли разделов.
	НайденныеРазделы = Новый Массив;
	ДублиРазделов = Новый Массив;
	Для Каждого ИмяМодуля Из МассивВсехМодулей Цикл
		Если ИмяМодуля.Значение = Перечисления.РазделыДополнительныхМодулей.Пользовательский Тогда
			Продолжить;
		КонецЕсли;
		Если НАйденныеРазделы.Найти(ИмяМодуля.Значение) = Неопределено Тогда
			НайденныеРазделы.Добавить(ИмяМодуля.Значение);
			Продолжить;
		КонецЕсли; 
		ДублиРазделов.Добавить(ИмяМодуля.Значение);
	КонецЦикла; 
	КоличествоСтрокДублейМодулей = Новый ТаблицаЗначений;
	КоличествоСтрокДублейМодулей.Колонки.Добавить("ИмяМодуля");
	КоличествоСтрокДублейМодулей.Колонки.Добавить("РазделМодуля"); 
	КоличествоСтрокДублейМодулей.Колонки.Добавить("КоличествоСтрок");

	Для Каждого ИмяМодуля Из МассивВсехМодулей Цикл
		Если ДублиРазделов.Найти(ИмяМодуля.Значение) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДубля = КоличествоСтрокДублейМодулей.Добавить();
		СтрокаДубля.ИмяМодуля = ИмяМодуля.Ключ;
		СтрокаДубля.РазделМодуля = ИмяМодуля.Значение;
		СтрокиТаблицы = ОбщиеПеременные.ТаблицаРезультатов.НайтиСтроки(Новый Структура("ИмяМодуля", СтрокаДубля.ИмяМодуля));
		СтрокаДубля.КоличествоСтрок = СтрокиТаблицы.Количество();
	КонецЦикла;
	// Для дублей с наименьшим количеством строк присвоим пользовательский модуль.
	Для Каждого Дубль Из ДублиРазделов Цикл
		СтрокиДубля = КоличествоСтрокДублейМодулей.НайтиСтроки(Новый Структура("РазделМодуля", Дубль));
		МинЧисло = 0;
		Для Каждого СтрокаДубля Из СтрокиДубля Цикл 
			Если МинЧисло = 0 Тогда
				МинЧисло = СтрокаДубля.КоличествоСтрок;
			ИначеЕсли СтрокаДубля.КоличествоСтрок < МинЧисло Тогда
				МинЧисло = СтрокаДубля.КоличествоСтрок;
			КонецЕсли;
		КонецЦикла; 
		Для Каждого СтрокаДубля Из СтрокиДубля Цикл
			Если СтрокаДубля.КоличествоСтрок = МинЧисло Тогда
				СтрокаДубля.РазделМодуля = Перечисления.РазделыДополнительныхМодулей.Пользовательский;
				МассивВсехМодулей[СтрокаДубля.ИмяМодуля] = Перечисления.РазделыДополнительныхМодулей.Пользовательский;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	// Записываем разделы модулей в справочник.
	// Прописываем ссылки на пользовательские модули в правила.
	Для Каждого ИмяМодуля Из МассивВсехМодулей Цикл
		ДопМодульСсылка = Справочники.ДополнительныеМодули.НайтиПоНаименованию(ИмяМодуля.Ключ,,,ОбщиеПеременные.КОнвертация);
		ДопМодульОбъект = ДопМодульСсылка.ПолучитьОбъект();
		ДопМодульОбъект.Раздел = ИмяМодуля.Значение;
		ДопМодульОбъект.ОбменДанными.Загрузка = Истина;
		ДопМодульОбъект.Записать();
		Если ИмяМодуля.Значение = Перечисления.РазделыДополнительныхМодулей.Пользовательский Тогда
			СтрокиТаблицы = ОбщиеПеременные.ТаблицаРезультатов.НайтиСтроки(Новый Структура("ИмяМодуля", ИмяМодуля.Ключ));
			Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
				Если НЕ (СтрокаТаблицы.ИмяОбъектаМетаданных = "ПравилаОбработкиДанных"
					Или СтрокаТаблицы.ИмяОбъектаМетаданных = "ПравилаКонвертацииОбъектов") Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СсылкаНаПравило) Тогда 
					Продолжить;
				КонецЕсли;
				ДопМодульПравила = ОБщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.СсылкаНаПравило, "ДополнительныйМодуль");
				Если ЗначениеЗаполнено(ДопМодульПравила) Тогда
					Продолжить;
				КонецЕсли;
				ПравилоОбъект = СтрокаТаблицы.СсылкаНаПравило.ПолучитьОбъект();
				ПравилоОбъект.ДополнительныйМодуль = ДопМодульСсылка;
				ПравилоОбъект.ОбменДанными.Загрузка = Истина;
				ПравилоОбъект.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьПроцедурыИФункцииВТаблицы(ОбщиеПеременные, ТХДок)
	ТХДокВрем = Новый ТекстовыйДокумент;
	ТХДокВрем.ДобавитьСтроку(ТХДок);
	Стр = "";
	СтрАнализа = ПодготовитьСтруктуруДляАнализаТекстаМодуля();
	ТекстКомментария = "";
	ИмяАлгоритмаКомментария = "";
	НомерСтрокиНачалоТекАлгоритма = 0;
	Для НомерСтроки = 1 По ТХДокВрем.КоличествоСтрок() Цикл
		Стр = ТХДокВрем.ПолучитьСтроку(НомерСтроки);
		Если СтрАнализа.Статус = 0 И ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов > 0 Тогда
			// запишем полученный на предыдущем этапе комментарий.
			Если ЗначениеЗаполнено(ТекстКомментария) Тогда
				СтрТаб = ОбщиеПеременные.ТаблицаРезультатов.Найти(ИмяАлгоритмаКомментария, "ИмяПроцедурыФункции");
				Если СтрТаб <> Неопределено Тогда
					СтрТаб.КомментарийАлгоритма = ТекстКомментария;
				КонецЕсли;
				ТекстКомментария = "";
			КонецЕсли;
			НомерСтрокиНачалоТекАлгоритма = НомерСтроки;
		КонецЕсли;
		ОбработатьСтрокуВПоискеИмениФункцииИлиПроцедуры(ОбщиеПеременные, Стр, СтрАнализа, НомерСтроки);
		// Для алгоритмов надо прочитать комментарий если он есть.
		Если ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов > 0 И СтрАнализа.Статус = 4 И НомерСтроки = НомерСтрокиНачалоТекАлгоритма Тогда
			ТекстКомментария = "";
			ИмяАлгоритмаКомментария = СтрАнализа.ИмяПроцедурыФункции;
			Для ОбратныйСчетчик = 1 По НомерСтроки Цикл
				НомерСтрокиЛок = НомерСтроки - ОбратныйСчетчик;
				СтрЛок = ТХДокВрем.ПолучитьСтроку(НомерСтрокиЛок);
				Если Лев(СтрЛок, 2) = "//" И СтрНайти(СтрЛок, "++") = 0 И СтрНайти(СтрЛок, "--") = 0 Тогда
					ТекстКомментария = СтрЛок + ?(ТекстКомментария = "", "", Символы.ПС) + ТекстКомментария;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если СтрАнализа.Статус <> 0 Тогда
		ТекстСообщения = НСтр("ru='Ошибка : Не найдено окончание функции или процедуры'") + " " + СтрАнализа.ИмяПроцедурыФункции;
		ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + ТекстСообщения + Символы.ПС;
		ОбщиеПеременные.Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьПроцедурыИФункцииВОбъектыМетаданных(ОбщиеПеременные)
	ЕстьИзменения = Ложь;
	Конфигурация = ОбщиеПеременные.Конфигурация;
	СчетчикПОД = 1;
	СчетчикПКО = 1;
	СчетчикПКПД = 1;
	РодственныеКонвертации = Новый Соответствие;
	Если НЕ ОбщиеПеременные.ТолькоОбработчики И ОбщиеПеременные.ИтерацияЗагрузки = 1 Тогда
		СуществующиеПОД = ЗаполнитьСписокПравил(ОбщиеПеременные, "ПравилаОбработкиДанных", РодственныеКонвертации);
		СуществующиеПКО = ЗаполнитьСписокПравил(ОбщиеПеременные, "ПравилаКонвертацииОбъектов", РодственныеКонвертации);
		СуществующиеПКПД = ЗаполнитьСписокПравил(ОбщиеПеременные, "ПравилаКонвертацииПредопределенныхДанных", РодственныеКонвертации);
	КонецЕсли;
	РодственныеКонфигурации = Новый Массив;
	Для Каждого Родственник Из РодственныеКонвертации Цикл
		РодственныеКонфигурации.Добавить(Родственник.Значение);
	КонецЦикла;
	НовыеПОДЗагрузки = Новый Массив;
	Для Каждого СтрокаРезультат Из ОбщиеПеременные.ТаблицаРезультатов Цикл
		// Служебные процедуры которые добавляются автоматически.
		Если СтрокаРезультат.ИмяПроцедурыФункции = "ДобавитьПКС" Или СтрокаРезультат.ИмяПроцедурыФункции = "ДобавитьПКТЧ" Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ОбщиеПеременные.ТолькоОбработчики И СтрНайти(СтрокаРезультат.ИмяПроцедурыФункции, "ЗаполнитьПравилаКонвертацииПредопределенныхДанных") Тогда
			ЗагрузитьПКПД(ОбщиеПеременные, СтрокаРезультат, СчетчикПКПД, СуществующиеПКПД, РодственныеКонвертации, РодственныеКонфигурации);
		КонецЕсли;
		Если СтрНайти(СтрокаРезультат.ИмяПроцедурыФункции, "ЗаполнитьПравилаКонвертацииОбъектов") Тогда
			ОбщиеПеременные.Вставить("СтрокаЗаполнитьПКО", СтрокаРезультат);
		КонецЕсли;
		Если НЕ ОбщиеПеременные.ТолькоОбработчики И СтрНайти(СтрокаРезультат.ИмяПроцедурыФункции, "ЗаполнитьПараметрыКонвертации") Тогда
			ЗагрузитьПараметры(ОбщиеПеременные, СтрокаРезультат);
		КонецЕсли;
		ОпределитьИмяОбъектаМетаданных(СтрокаРезультат);
		Если НЕ ЗначениеЗаполнено(СтрокаРезультат.ИмяОбъектаМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ОбщиеПеременные.ТолькоОбработчики И СтрокаРезультат.ИмяОбъектаМетаданных = "ПравилаОбработкиДанных" 
			И Лев(СтрокаРезультат.ИмяПроцедурыФункции, 12) = "ДобавитьПОД_" Тогда
			ЗагрузитьПОД(ОбщиеПеременные, СтрокаРезультат, СчетчикПОД, СуществующиеПОД, РодственныеКонвертации, РодственныеКонфигурации, НовыеПОДЗагрузки);
		КонецЕсли;
		Если НЕ ОбщиеПеременные.ТолькоОбработчики И СтрокаРезультат.ИмяОбъектаМетаданных = "ПравилаКонвертацииОбъектов" 
			И Лев(СтрокаРезультат.ИмяПроцедурыФункции, 12) = "ДобавитьПКО_" Тогда
			ЗагрузитьПКО(ОбщиеПеременные, СтрокаРезультат, СчетчикПКО, СуществующиеПКО, РодственныеКонвертации, РодственныеКонфигурации);
		КонецЕсли;
		ЗагрузитьОбработчикВОбъектМетаданных(ОбщиеПеременные, СтрокаРезультат, ЕстьИзменения);
	КонецЦикла;
	Если РодственныеКонвертации.Количество() > 0 И НовыеПОДЗагрузки.Количество() > 0 Тогда
		ДополнитьРодственныеКонвертации_ПОДЗагрузки(ОбщиеПеременные, НовыеПОДЗагрузки, РодственныеКонвертации)
	КонецЕсли;
	СтрокаПрогресса = НСтр("ru='Удаление неактуальных правил и алгоритмов'");
	ДлительныеОперации.СообщитьПрогресс(0,СтрокаПрогресса);

	Если НЕ ОбщиеПеременные.ТолькоОбработчики И ОбщиеПеременные.ИтерацияЗагрузки = 1 Тогда
		УдалитьЛишниеПравила(ОбщиеПеременные, СуществующиеПОД, "ПравилаОбработкиДанных");
		УдалитьЛишниеПравила(ОбщиеПеременные, СуществующиеПКО, "ПравилаКонвертацииОбъектов");
		УдалитьЛишниеПравила(ОбщиеПеременные, СуществующиеПКПД, "ПравилаКонвертацииПредопределенныхДанных");
	КонецЕсли;
	ТекстСообщения = НСтр("ru='Обработка модуля менеджера для конвертации'") + " " + ОбщиеПеременные.Конвертация + " " + НСтр("ru='завершена.'");
	Если СчетчикПОД > 1 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru='Загружено правил обработки данных'") + ": " + СчетчикПОД; 
	КонецЕсли;
	Если СчетчикПКО > 1 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru='Загружено правил конвертации объектов'") + ": " + СчетчикПКО; 
	КонецЕсли;
	Если СчетчикПКПД > 1 Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru='Загружено правил конвертации предопределенных данных'") + ": " + СчетчикПКПД; 
	КонецЕсли; 
	Если ЕстьИзменения Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru='Изменения алгоритмов загружены.'");
	Иначе
		ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru='Изменений алгоритмов не обнаружено.'");
	КонецЕсли;  
	ОбщиеПеременные.СообщениеОРезультате = ТекстСообщения;
КонецПроцедуры

Функция ПодготовитьСтруктуруТаблицыРезультат()
	ТабЗнач = Новый ТаблицаЗначений;
	ТабЗнач.Колонки.Добавить("ИмяПроцедурыФункции");
	ТабЗнач.Колонки.Добавить("ЭтоФункция");
	ТабЗнач.Колонки.Добавить("ТекстМодуля");
	ТабЗнач.Колонки.Добавить("Параметры");
	ТабЗнач.Колонки.Добавить("ИмяРеквизитаОбъекта");
	ТабЗнач.Колонки.Добавить("НаименованиеОбъекта");
	ТабЗнач.Колонки.Добавить("ИмяОбъектаМетаданных");
	ТабЗнач.Колонки.Добавить("ЭтоАлгоритм");
	ТабЗнач.Колонки.Добавить("Экспортный");
	ТабЗнач.Колонки.Добавить("Область");
	ТабЗнач.Колонки.Добавить("Отправка", Новый ОписаниеТипов("Булево"));
	ТабЗнач.Колонки.Добавить("Получение", Новый ОписаниеТипов("Булево"));
	ТабЗнач.Колонки.Добавить("ТекущийТег");  
	ТабЗнач.Колонки.Добавить("ВыгружатьВМодульМенеджера");
	ТабЗнач.Колонки.Добавить("ИмяМодуля"); 
	ТабЗнач.Колонки.Добавить("СсылкаНаПравило");
	ТабЗнач.Колонки.Добавить("КомментарийАлгоритма");
	
	Возврат ТабЗнач;
КонецФункции

Процедура ОпределитьИмяОбъектаМетаданных(СтрокаРезультат)
	Если СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции) = "" Тогда
		Возврат;
	КонецЕсли;
	Если СтрокаРезультат.ЭтоАлгоритм Тогда
		СтрокаРезультат.ИмяРеквизитаОбъекта = "Алгоритм";
		СтрокаРезультат.НаименованиеОбъекта = СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции);
		СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы";
	ИначеЕсли СтрНачинаетсяС(СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции), "ПОД_")
		Или Найти(СтрокаРезультат.ИмяПроцедурыФункции, "ДобавитьПОД_") Тогда
		СтрокаРезультат.ИмяОбъектаМетаданных = "ПравилаОбработкиДанных";
		СтрокаРезультат.НаименованиеОбъекта = Сред(СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции), 5);
		Если Найти(СтрокаРезультат.ИмяПроцедурыФункции, "_ПриОбработке") Тогда
			СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПриОбработке";
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.НаименованиеОбъекта, "_ПриОбработке", "");
		ИначеЕсли Найти(СтрокаРезультат.ИмяПроцедурыФункции, "_ВыборкаДанных") Тогда
			СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмВыборкаДанных";
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.НаименованиеОбъекта, "_ВыборкаДанных", "");
		ИначеЕсли Найти(СтрокаРезультат.ИмяПроцедурыФункции, "ДобавитьПОД_") Тогда
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.ИмяПроцедурыФункции, "ДобавитьПОД_", ""); 
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции), "ПКО_")
		Или Найти(СтрокаРезультат.ИмяПроцедурыФункции, "ДобавитьПКО_") Тогда
		СтрокаРезультат.НаименованиеОбъекта = Сред(СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции), 5);
		СтрокаРезультат.ИмяОбъектаМетаданных = "ПравилаКонвертацииОбъектов";
		Если Найти(СтрокаРезультат.ИмяПроцедурыФункции, "_ПриОтправкеДанных") Тогда
			СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПриОтправкеДанных";
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.НаименованиеОбъекта, "_ПриОтправкеДанных", "");
		ИначеЕсли Найти(СтрокаРезультат.ИмяПроцедурыФункции, "_ПриКонвертацииДанныхXDTO") Тогда
			СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПередПолучениемДанных";
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.НаименованиеОбъекта, "_ПриКонвертацииДанныхXDTO", "");
		ИначеЕсли Найти(СтрокаРезультат.ИмяПроцедурыФункции, "_ПередЗаписьюПолученныхДанных") Тогда
			СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПриПолученииДанных";
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.НаименованиеОбъекта, "_ПередЗаписьюПолученныхДанных", "");
		ИначеЕсли Найти(СтрокаРезультат.ИмяПроцедурыФункции, "_ВыборкаДанных") Тогда
			СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПриПолученииДанных";
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.НаименованиеОбъекта, "_ПередЗаписьюПолученныхДанных", "");
		ИначеЕсли Найти(СтрокаРезультат.ИмяПроцедурыФункции, "ДобавитьПКО_") Тогда
			СтрокаРезультат.НаименованиеОбъекта = СтрЗаменить(СтрокаРезультат.ИмяПроцедурыФункции, "ДобавитьПКО_", "");
		КонецЕсли;
		
	ИначеЕсли СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции) = "ПередКонвертацией" Тогда
		СтрокаРезультат.ИмяОбъектаМетаданных = "Конвертации";
		СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПередКонвертацией";
	ИначеЕсли СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции) = "ПослеКонвертации" Тогда
		СтрокаРезультат.ИмяОбъектаМетаданных = "Конвертации";
		СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПослеКонвертации";
	ИначеЕсли СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции) = "ПередОтложеннымЗаполнением" Тогда
		СтрокаРезультат.ИмяОбъектаМетаданных = "Конвертации";
		СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПередОтложеннымЗаполнением"; 
	ИначеЕсли СокрЛП(СтрокаРезультат.ИмяПроцедурыФункции) = "ПередОбработкойУдаляемогоОбъекта" Тогда
		СтрокаРезультат.ИмяОбъектаМетаданных = "Конвертации";
		СтрокаРезультат.ИмяРеквизитаОбъекта = "АлгоритмПередОбработкойУдаления";
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьОбработчикВОбъектМетаданных(ОбщиеПеременные, СтрокаРезультат, ЕстьИзменения)
	Если НЕ ЗначениеЗаполнено(СтрокаРезультат.ИмяРеквизитаОбъекта) 
		И (СтрокаРезультат.ИмяОбъектаМетаданных = "Конвертации" ИЛИ НЕ ЗначениеЗаполнено(СтрокаРезультат.Область)) Тогда
		Возврат;
	КонецЕсли;
	Если СтрокаРезультат.ИмяОбъектаМетаданных = "Конвертации" Тогда
		// Меняется сам элемент конвертации.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 " + СтрокаРезультат.ИмяРеквизитаОбъекта + "  КАК ТекстОбработчика
		|	ИЗ Справочник.Конвертации
		|ГДЕ Ссылка = &Конвертация ";
		Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если СокрЛП(Выборка.ТекстОбработчика) <> СокрЛП(СтрокаРезультат.ТекстМодуля) Тогда
				ОбъектМД = ОбщиеПеременные.Конвертация.ПолучитьОбъект();
				ОбъектМД[СтрокаРезультат.ИмяРеквизитаОбъекта] = СокрЛП(СтрокаРезультат.ТекстМодуля);
				ОбъектМД.Записать();
				Если НЕ ЕстьИзменения Тогда
					ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	ИмяРеквизитаПоиска = "Код";
	Если СтрокаРезультат.ИмяОбъектаМетаданных = "ПравилаОбработкиДанных" Тогда
		ИмяРеквизитаПоиска = "Наименование";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МДСправочник.Ссылка КАК Ссылка,
	|	МДСправочник.ГруппаПравил КАК ГруппаПравил,
	|	МДСправочник.ТипКонвертации КАК ТипКонвертации,
	|	#ПользовательскийМодуль#
	|	#РеквизитОбъекта#
	|	"+?(СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы", "МДСправочник.Параметры", "NULL") + " КАК Параметры,
	|	"+?(СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы", "МДСправочник.Экспортный", "NULL") + " КАК Экспортный,
	|	"+?(СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы", "МДСправочник.Комментарий", "NULL") + " КАК Комментарий,
	|	"+?(СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы", "МДСправочник.ЭтоФункция", "NULL") + " КАК ЭтоФункция
	|ИЗ Справочник." + СтрокаРезультат.ИмяОбъектаМетаданных + " КАК МДСправочник
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК СоставМД
	|ПО СоставМД.Владелец = &Конвертация
	|	И СоставМД.ЭлементКонвертации = МДСправочник.Ссылка
	|	И СоставМД.Отключить = ЛОЖЬ
	|ГДЕ МДСправочник." + ИмяРеквизитаПоиска + " = &НаименованиеЭлементаКонвертации
	|	И МДСправочник.ВременнаяКопия = &ВременнаяКопия
	|	И МДСправочник.Копия = ЛОЖЬ";
	Если ЗначениеЗаполнено(СтрокаРезультат.ИмяРеквизитаОбъекта) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#РеквизитОбъекта#", "МДСправочник." + СтрокаРезультат.ИмяРеквизитаОбъекта + " КАК ТекстОбработчика,");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#РеквизитОбъекта#", "");
	КонецЕсли; 
	Если СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПользовательскийМодуль#", "МДСправочник.ДополнительныйМодуль.Наименование КАК ПользовательскийМодуль,");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПользовательскийМодуль#", """"" КАК ПользовательскийМодуль,");
	КонецЕсли; 
	ТекстПроверкаЗахвата = "";
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		ТекстПроверкаЗахвата = "ВЫБРАТЬ
		|	Правило.Ссылка КАК СсылкаПравило
		|ИЗ Справочник."+ СтрокаРезультат.ИмяОбъектаМетаданных +" КАК Правило
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правило.Ссылка
		|	И Состав.Владелец = &Конвертация
		|	И Состав.Отключить = ЛОЖЬ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник."+ СтрокаРезультат.ИмяОбъектаМетаданных +"
		|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
		|ПО ДанныеЗахвата.РабочаяКопия = Правило.Ссылка
		|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
		|ГДЕ Правило.ВременнаяКопия = ЛОЖЬ И Правило." + ИмяРеквизитаПоиска + " = &Имя";
	КонецЕсли;

	
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Запрос.УстановитьПараметр("НаименованиеЭлементаКонвертации", СтрокаРезультат.НаименованиеОбъекта); 
	Запрос.УстановитьПараметр("ВременнаяКопия", ?(ОбщиеПеременные.ИтерацияЗагрузки = 1, Ложь, Истина));

	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Если СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы" 
			И НЕ ОбщиеПеременные.ТолькоОбработчики Тогда
			СоздатьНовыйАлгоритм(ОбщиеПеременные, СтрокаРезультат);
			ЕстьИзменения = Истина;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЕстьИзмененияЛокально = Ложь;
	Если СокрЛП(Выборка.ГруппаПравил) = "" И СокрЛП(СтрокаРезультат.Область) <> "" Тогда
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаРезультат.ИмяРеквизитаОбъекта) И СокрЛП(Выборка.ТекстОбработчика) <> СокрЛП(СтрокаРезультат.ТекстМодуля) Тогда
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;
	Если ТипЗнч(Выборка.ЭтоФункция) = Тип("Булево") И Выборка.ЭтоФункция <> СтрокаРезультат.ЭтоФункция Тогда
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;
	Если ТипЗнч(Выборка.Экспортный) = Тип("Булево") И Выборка.Экспортный <> СтрокаРезультат.Экспортный Тогда
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;
	Если ТипЗнч(Выборка.Параметры) = Тип("Строка") И Выборка.Параметры <> СтрокаРезультат.Параметры Тогда
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;
	Если ТипЗнч(Выборка.Комментарий) = Тип("Строка") И Выборка.Комментарий <> СтрокаРезультат.КомментарийАлгоритма Тогда
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;
	ТекущиеТеги = Выборка.Ссылка.Теги.Выгрузить().ВыгрузитьКолонку("Тег");
	НеободимоОбновитьТеги = Ложь;
	МассивТеговДляЗагрузки = Новый Массив;
	
	Если (ЗначениеЗаполнено(СтрокаРезультат.ТекущийТег) Или ТекущиеТеги.Количество() > 0) Тогда
		ТекущийТегМассив = СтрРазделить(СтрокаРезультат.ТекущийТег, ",");
		Для Каждого ТекТег Из ТекущийТегМассив Цикл
			ТекТегСсылка = НайтиСоздатьТег(ОбщиеПеременные, ТекТег);
			МассивТеговДляЗагрузки.Добавить(ТекТегСсылка);
			Если ТекущиеТеги.Найти(ТекТегСсылка) = Неопределено Тогда
				НеободимоОбновитьТеги = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ НеободимоОбновитьТеги Тогда
			Для Каждого ТекТегСсылка Из ТекущиеТеги Цикл
				Если МассивТеговДляЗагрузки.Найти(ТекТегСсылка) = Неопределено Тогда
					НеободимоОбновитьТеги = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли; 
	ЕстьИзмененияЛокально = ЕстьИзмененияЛокально Или НеободимоОбновитьТеги;
	Если СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы" И Выборка.ПользовательскийМодуль <> СтрокаРезультат.ИмяМодуля Тогда 
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Выборка.ТипКонвертации) Тогда
		ЕстьИзмененияЛокально = Истина;
	КонецЕсли;
	СтрокаРезультат.СсылкаНаПравило = Выборка.Ссылка;

	Если НЕ ЕстьИзмененияЛокально Тогда
		Возврат;
	КонецЕсли; 
	
	// Проверка возможности загрузки при совместной работе.
	ОбъектЗанят = ПроверкаЗахвата(ОбщиеПеременные, СтрокаРезультат.НаименованиеОбъекта, ТекстПроверкаЗахвата);
	Если ОбъектЗанят Тогда
		Если СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы" Тогда
			// Уведомление надо добавить только для алгоритмов, для других правил ошибка уже отображена.
			УведомитьОЗахвате(Метаданные.Справочники.Алгоритмы, СтрокаРезультат.НаименованиеОбъекта)
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ЕстьИзменения = Истина;
	ОбъектМД = Выборка.Ссылка.ПолучитьОбъект();
	Если ЗначениеЗаполнено(СтрокаРезультат.ИмяРеквизитаОбъекта) Тогда
		ОбъектМД[СтрокаРезультат.ИмяРеквизитаОбъекта] = СокрЛП(СтрокаРезультат.ТекстМодуля);
	КонецЕсли;
	Если СокрЛП(Выборка.ГруппаПравил) = "" И СокрЛП(СтрокаРезультат.Область) <> "" Тогда
		ОбъектМД.ГруппаПравил = СтрокаРезультат.Область;
	КонецЕсли; 
	Если НеободимоОбновитьТеги Тогда
		ОбъектМД.Теги.Очистить();
		Для Каждого ТекТегСсылка Из МассивТеговДляЗагрузки Цикл
			СтрокаТег = ОбъектМД.Теги.Добавить();
			СтрокаТег.Тег = ТекТегСсылка; 
		КонецЦикла;
	КонецЕсли;
	Если СтрокаРезультат.ИмяОбъектаМетаданных = "Алгоритмы" Тогда
		Если ЗначениеЗаполнено(СтрокаРезультат.ИмяМодуля) Тогда
			ТекПользовательскийМодуль = Неопределено;
			ОбщиеПеременные.ПользовательскиеМодули.Свойство(СтрокаРезультат.ИмяМодуля, ТекПользовательскийМодуль);
			ОбъектМД.ДополнительныйМодуль = ТекПользовательскийМодуль;
		КонецЕсли;
		ОбъектМД.ЭтоФункция = СтрокаРезультат.ЭтоФункция;
		ОбъектМД.Параметры = СтрокаРезультат.Параметры;
		ОбъектМД.Экспортный = СтрокаРезультат.Экспортный;
		ОбъектМД.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO;
		ОбъектМД.Комментарий = СтрокаРезультат.КомментарийАлгоритма;
	КонецЕсли;
	ОбъектМД.Записать();
КонецПроцедуры

Процедура СоздатьНовыйАлгоритм(ОбщиеПеременные, СтрокаРезультат)
	ПользовательскийМодульСсылка = Неопределено;
	Если ЗначениеЗаполнено(СтрокаРезультат.ИмяМодуля) Тогда
		ОбщиеПеременные.ПользовательскиеМодули.Свойство(СтрокаРезультат.ИмяМодуля, ПользовательскийМодульСсылка);
	КонецЕсли;
	АлгоритмОбъект = Справочники.Алгоритмы.СоздатьЭлемент();
	АлгоритмОбъект.Код = СокрЛП(СтрокаРезультат.НаименованиеОбъекта);
	АлгоритмОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO;
	АлгоритмОбъект.ЭтоФункция = СтрокаРезультат.ЭтоФункция;
	АлгоритмОбъект.Параметры = СтрокаРезультат.Параметры;
	АлгоритмОбъект.Алгоритм = СокрЛП(СтрокаРезультат.ТекстМодуля);
	АлгоритмОбъект.Экспортный = СтрокаРезультат.Экспортный;
	АлгоритмОбъект.ДополнительныйМодуль = ПользовательскийМодульСсылка;
	АлгоритмОбъект.Комментарий = СтрокаРезультат.КомментарийАлгоритма;
	АлгоритмОбъект.ВременнаяКопия = (ОбщиеПеременные.ИтерацияЗагрузки = 2);
	Если ЗначениеЗаполнено(СтрокаРезультат.ТекущийТег) Тогда
		ТекущийТегМассив = СтрРазделить(СтрокаРезультат.ТекущийТег, ",");
		Для Каждого ТекТег Из ТекущийТегМассив Цикл
			ТекТегСсылка = НайтиСоздатьТег(ОбщиеПеременные, ТекТег);
			СтрокаТег = АлгоритмОбъект.Теги.Добавить();
			СтрокаТег.Тег = ТекТегСсылка;
		КонецЦикла;
	КонецЕсли;
	АлгоритмОбъект.Записать();  
	СтрокаРезультат.СсылкаНаПравило = АлгоритмОбъект.Ссылка;
	СоставКонвертаций = Справочники.СоставыКонвертаций.СоздатьЭлемент();
	СоставКонвертаций.Владелец = ОбщиеПеременные.Конвертация;
	СоставКонвертаций.Наименование = СокрЛП(АлгоритмОбъект)+" "+СокрЛП(ОбщиеПеременные.Конвертация);
	СоставКонвертаций.ЭлементКонвертации = АлгоритмОбъект.Ссылка;
	СоставКонвертаций.Записать();
КонецПроцедуры

Процедура ЗагрузитьПОД(ОбщиеПеременные, СтрокаРезультат, СчетчикПОД, СуществующиеПОД, РодственныеКонвертации, РодственныеКонфигурации, НовыеПОДЗагрузки)
	ЧислоСтрок = СтрЧислоСтрок(СтрокаРезультат.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	ПОДОбъект = Справочники.ПравилаОбработкиДанных.СоздатьЭлемент();
	ПОДОбъект.ОбменДанными.Загрузка = Истина;
	ПравилоСоздано = Истина; 
	ТекстПроверкаЗахвата = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПОД.Ссылка КАК СсылкаПравило,
	|	Состав.Ссылка КАК СсылкаСостав,
	|	ПОД.ПометкаУдаления
	|ИЗ Справочник.ПравилаОбработкиДанных КАК ПОД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.ЭлементКонвертации = ПОД.Ссылка
	|	И Состав.Владелец = &Конвертация
	|	И Состав.Отключить = ЛОЖЬ
	|ГДЕ ПОД.Наименование = &Имя И ПОД.ВременнаяКопия = &ВременнаяКопия
	|	И ПОД.Копия = ЛОЖЬ";  
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		ТекстПроверкаЗахвата = "ВЫБРАТЬ
		|	Правило.Ссылка КАК СсылкаПравило
		|ИЗ Справочник.ПравилаОбработкиДанных КАК Правило
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правило.Ссылка
		|	И Состав.Владелец = &Конвертация
		|	И Состав.Отключить = ЛОЖЬ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник.ПравилаОбработкиДанных
		|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
		|ПО ДанныеЗахвата.РабочаяКопия = Правило.Ссылка
		|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
		|ГДЕ Правило.ВременнаяКопия = ЛОЖЬ И Правило.Наименование = &Имя";
		ОбъектЗанят = ПроверкаЗахвата(ОбщиеПеременные, СтрокаРезультат.НаименованиеОбъекта, ТекстПроверкаЗахвата);
		Если ОбъектЗанят Тогда
			УведомитьОЗахвате(Метаданные.Справочники.ПравилаОбработкиДанных, СтрокаРезультат.НаименованиеОбъекта);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Запрос.УстановитьПараметр("Имя", СтрокаРезультат.НаименованиеОбъекта);
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Запрос.УстановитьПараметр("ВременнаяКопия", (ОбщиеПеременные.ИтерацияЗагрузки <> 1));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда

		ПравилоСоздано = Ложь;
		ПОДОбъект = Выборка.СсылкаПравило.ПолучитьОбъект();
		ПОДОбъект.ОбменДанными.Загрузка = Истина;
		Если ОбщиеПеременные.ИтерацияЗагрузки = 1 Тогда
			ИндексПОД = СуществующиеПОД.Найти(Выборка.СсылкаПравило);
			Если ИндексПОД <> Неопределено Тогда
				СуществующиеПОД.Удалить(ИндексПОД);
			КонецЕсли;
		КонецЕсли;
		ПОДОбъект.ПравилаКонвертацииОбъектов.Очистить();
		Если Выборка.ПометкаУдаления Тогда
			ПОДОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ПравилоСоздано Тогда
		ПОДОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO;
		ПОДОбъект.Наименование = СтрокаРезультат.НаименованиеОбъекта;
		ПОДОбъект.ВременнаяКопия = (ОбщиеПеременные.ИтерацияЗагрузки <> 1);
	КонецЕсли;
	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, Сч);
		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, ".ОбъектВыборкиМетаданные") > 0 Тогда
			ИмяОбъектаВыборки = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(ИмяОбъектаВыборки) И ИмяОбъектаВыборки <> "Неопределено" Тогда
				ПОДОбъект.ОбъектВыборки = ОбъектКонфигурацииПоСтроке(ИмяОбъектаВыборки, ОбщиеПеременные.Конфигурация); 
				Если НЕ ЗначениеЗаполнено(ПОДОбъект.ОбъектВыборки) Тогда
					ТекстОшибки = НСтр("ru='Не обнаружен объект конфигурации %1, правило %2'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", ИмяОбъектаВыборки);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%2", ПОДОбъект.Наименование);
					ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + Символы.ПС + ТекстОшибки; 
					ОбщиеПеременные.Отказ = Истина;
				КонецЕсли;
			Иначе
				ПОДОбъект.ОбъектВыборки = Справочники.Объекты.ПустаяСсылка();
			КонецЕсли;
			ПОДОбъект.ИспользоватьДляОтправки = Истина;
			ПОДОбъект.ИспользоватьДляПолучения = Ложь;
		ИначеЕсли СтрНайти(ТекСтрока, ".ОбъектВыборкиФормат") > 0 Тогда
			ИмяОбъектаВыборки = ТекстПослеРавно(ТекСтрока);
			Если НЕ ЗначениеЗаполнено(ИмяОбъектаВыборки) Тогда
				Возврат;
			КонецЕсли;
			ПОДОбъект.ОбъектВыборки = ИмяОбъектаВыборки;
			ПОДОбъект.ИспользоватьДляОтправки = Ложь;
			ПОДОбъект.ИспользоватьДляПолучения = Истина;
		ИначеЕсли СтрНайти(ТекСтрока, ".ИспользуемыеПКО.") > 0 Тогда
			ИспользуемоеПКО = ТекстВнутриКавычек(ТекСтрока);
			Если НЕ ЗначениеЗаполнено(ИспользуемоеПКО) Тогда
				Продолжить;
			КонецЕсли;
			СтрПКО = ПОДОбъект.ПравилаКонвертацииОбъектов.Добавить();
			СтрПКО.ПравилоКонвертацииОбъекта = ИспользуемоеПКО;
		ИначеЕсли СтрНайти(ТекСтрока, ".ОчисткаДанных") > 0 Тогда
			ОчисткаДанныхСтрокой = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(ОчисткаДанныхСтрокой) Тогда
				ПОДОбъект.ОчисткаДанных = Булево(ОчисткаДанныхСтрокой);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	Если СтрокаРезультат.ВыгружатьВМодульМенеджера = Истина Тогда
		ПОДОбъект.ВыгружатьВМодульМенеджера = Истина;
		ПОДОбъект.ОбъектКонфигурацииДляВыгрузкиМодуля = ЗаполнитьОбъектКонфигурацииДляВыгрузкиМодуля(ОбщиеПеременные, СтрокаРезультат, ПОДОбъект.ОбъектВыборки);
	Иначе
		ПОДОбъект.ВыгружатьВМодульМенеджера = Ложь; 
		Если ЗначениеЗаполнено(СтрокаРезультат.ИмяМодуля) Тогда
			ПользовательскийМодульСсылка = Неопределено;
			ОбщиеПеременные.ПользовательскиеМодули.Свойство(СтрокаРезультат.ИмяМодуля, ПользовательскийМодульСсылка);
			ПОДОбъект.ДополнительныйМодуль = ПользовательскийМодульСсылка;
		КонецЕсли;
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтрокаРезультат.Область) Тогда
		ПОДОбъект.ГруппаПравил = СтрокаРезультат.Область;
	ИначеЕсли ПОДОбъект.ИспользоватьДляОтправки Тогда
		ПОДОбъект.ГруппаПравил = "Отправка";
	Иначе
		ПОДОбъект.ГруппаПравил = "Получение";
	КонецЕсли;
	ПОДОбъект.Порядок = СчетчикПОД * 10;
	Если ПОДОбъект.ПравилаКонвертацииОбъектов.Количество() = 1 Тогда
		ПОДОбъект.ПравилоКонвертацииОбъекта = ПОДОбъект.ПравилаКонвертацииОбъектов[0].ПравилоКонвертацииОбъекта;
		ПОДОбъект.ПравилаКонвертацииОбъектов.Очистить();
	КонецЕсли;
	ЗагрузитьТегиВПравиле(СтрокаРезультат.ТекущийТег, ПОДОбъект, ОбщиеПеременные);
	СчетчикПОД = СчетчикПОД + 1; 
	ПОДОбъект.Записать(); 
	СтрокаРезультат.СсылкаНаПравило = ПОДОбъект.Ссылка;
	Если ПравилоСоздано Тогда
		Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ОбщиеПеременные.Конвертация, ПОДОбъект.Ссылка);
		Если ПодОбъект.ИспользоватьДляОтправки Тогда
			ДополнитьРодственныеКонвертации(ПОДОбъект.Ссылка, ПОДОбъект.ОбъектВыборки, РодственныеКонвертации, РодственныеКонфигурации);
		Иначе
			// Ориентация по ПКО после загрузки всех правил.
			НовыеПОДЗагрузки.Добавить(ПОДОбъект.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьПКО(ОбщиеПеременные, СтрокаРезультат, СчетчикПКО, СуществующиеПКО, РодственныеКонвертации, РодственныеКонфигурации)
	
	ЧислоСтрок = СтрЧислоСтрок(СтрокаРезультат.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	ПКООбъект = Справочники.ПравилаКонвертацииОбъектов.СоздатьЭлемент();
	ПКООбъект.ОбменДанными.Загрузка = Истина;
	ПКОСсылка = Неопределено;
	ПравилоСоздано = Истина;
	СуществующиеПКС = Новый Массив;
	СчетчикПКС = 0;
	ДанныеГруппы = Новый Структура("ТекущаяГруппаПКС, ТекущийРодительСвойства, СвойствоКонфигурации, СвойствоКонфигурацииСтрокой, СвойствоФормата", Справочники.ПравилаКонвертацииСвойств.ПустаяСсылка(), "", "","", "");
	ТекстПроверкаЗахвата = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПКО.Ссылка КАК СсылкаПравило,
	|	Состав.Ссылка КАК СсылкаСостав,
	|	ПКО.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК ПКО
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.ЭлементКонвертации = ПКО.Ссылка
	|	И Состав.Владелец = &Конвертация
	|	И Состав.Отключить = ЛОЖЬ
	|ГДЕ ПКО.Код = &Имя И ПКО.ВременнаяКопия = &ВременнаяКопия
	|	И ПКО.Копия = ЛОЖЬ";
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		ТекстПроверкаЗахвата = "ВЫБРАТЬ
		|	Правило.Ссылка КАК СсылкаПравило
		|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правило
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правило.Ссылка
		|	И Состав.Владелец = &Конвертация
		|	И Состав.Отключить = ЛОЖЬ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник.ПравилаКонвертацииОбъектов
		|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
		|ПО ДанныеЗахвата.РабочаяКопия = Правило.Ссылка
		|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
		|ГДЕ Правило.ВременнаяКопия = ЛОЖЬ И Правило.Код = &Имя";
		// Проверка возможности загрузки при совместной работе.
		ОбъектЗанят = ПроверкаЗахвата(ОбщиеПеременные, СтрокаРезультат.НаименованиеОбъекта, ТекстПроверкаЗахвата);
		Если ОбъектЗанят Тогда
			УведомитьОЗахвате(Метаданные.Справочники.ПравилаКонвертацииОбъектов, СтрокаРезультат.НаименованиеОбъекта);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Запрос.УстановитьПараметр("Имя", СтрокаРезультат.НаименованиеОбъекта);
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Запрос.УстановитьПараметр("ВременнаяКопия", (ОбщиеПеременные.ИтерацияЗагрузки <> 1));
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		ПравилоСоздано = Ложь;
		ПКООбъект = Выборка.СсылкаПравило.ПолучитьОбъект();
		ПКООбъект.ОбменДанными.Загрузка = Истина;
		ПКООбъект.ИдентификацияПоПолямПоиска.Очистить(); 
		Если ОбщиеПеременные.ИтерацияЗагрузки = 1 Тогда
			ИндексПКО = СуществующиеПКО.Найти(Выборка.СсылкаПравило);
			Если ИндексПКО <> Неопределено Тогда
				СуществующиеПКО.Удалить(ИндексПКО);
			КонецЕсли;
		КонецЕсли;
		Если Выборка.ПометкаУдаления Тогда
			ПКООбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
		ПКОСсылка = Выборка.СсылкаПравило;
		
		ЗапросПКС = Новый Запрос;
		ЗапросПКС.УстановитьПараметр("Ссылка", Выборка.СсылкаПравило);
		ЗапросПКС.Текст = "ВЫБРАТЬ Ссылка
		|ИЗ Справочник.ПравилаКонвертацииСвойств
		|ГДЕ Владелец = &Ссылка";
		СуществующиеПКС = ЗапросПКС.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	Если ПравилоСоздано Тогда
		ПКООбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO;
		ПКООбъект.Код = СтрокаРезультат.НаименованиеОбъекта; 
		ПКООбъект.ВременнаяКопия = (ОбщиеПеременные.ИтерацияЗагрузки <> 1);
	КонецЕсли;

	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, Сч);
		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, ".ОбъектДанных") > 0 Тогда
			ИмяОбъектаКонфигурации = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(ИмяОбъектаКонфигурации) И ИмяОбъектаКонфигурации <> "Неопределено" Тогда
				ПКООбъект.ОбъектКонфигурации = ОбъектКонфигурацииПоСтроке(ИмяОбъектаКонфигурации, ОбщиеПеременные.Конфигурация); 
				Если НЕ ЗначениеЗаполнено(ПКООбъект.ОбъектКонфигурации) Тогда
					ТекстОшибки = НСтр("ru='Не обнаружен объект конфигурации %1, правило %2'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", ИмяОбъектаКонфигурации);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%2", ПКООбъект.Код);
					ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + Символы.ПС + ТекстОшибки; 
					ОбщиеПеременные.Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрНайти(ТекСтрока, ".ОбъектФормата") > 0 Тогда
			ПКООбъект.ОбъектФормата = ТекстПослеРавно(ТекСтрока);
		ИначеЕсли СтрНайти(ТекСтрока, "ДобавитьПКС(СвойстваШапки") > 0
			Или СтрНайти(ТекСтрока, "ДобавитьПКС(СвойстваТЧ") > 0 Тогда
			Если СтрНайти(ТекСтрока, "ДобавитьПКС(СвойстваШапки") > 0 Тогда
				// Сбрасываем данные группы.
				ДанныеГруппы = Новый Структура("ТекущаяГруппаПКС, ТекущийРодительСвойства, СвойствоКонфигурации, СвойствоКонфигурацииСтрокой, СвойствоФормата");
			КонецЕсли;
			ДобавитьПКС(ТекСтрока, ОбщиеПеременные.Конфигурация, ПКООбъект, ПКОСсылка, СуществующиеПКС, СчетчикПКС, ДанныеГруппы);
		ИначеЕсли СтрНайти(ТекСтрока, "ДобавитьПКТЧ(") > 0 Тогда
			ДанныеГруппы = Новый Структура("ТекущаяГруппаПКС, ТекущийРодительСвойства, СвойствоКонфигурации, СвойствоКонфигурацииСтрокой, СвойствоФормата");
			ДобавитьПКГС(ТекСтрока, ОбщиеПеременные.Конфигурация, ПКООбъект, ПКОСсылка, СуществующиеПКС, СчетчикПКС, ДанныеГруппы);
		ИначеЕсли СтрНайти(ТекСтрока, ".ВариантИдентификации") > 0 Тогда
			ВариантИдентификацииСтрокой = ТекстПослеРавно(ТекСтрока);
			Если ВариантИдентификацииСтрокой = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска" Тогда
				ПКООбъект.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска;
			ИначеЕсли ВариантИдентификацииСтрокой = "ПоПолямПоиска" Тогда
				ПКООбъект.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоПолямПоиска;
			Иначе
				ПКООбъект.ВариантИдентификации = Перечисления.ВариантыИдентификацииОбъектов.ПоУникальномуИдентификатору;
			КонецЕсли;
		ИначеЕсли СтрНайти(ТекСтрока, ".ПоляПоиска.Добавить(") > 0 Тогда
			СтрПолеПоиска = ПКООбъект.ИдентификацияПоПолямПоиска.Добавить();
			СтрПолеПоиска.РеквизитыПоиска = ТекстВнутриКавычек(ТекСтрока);
		ИначеЕсли СтрНайти(ТекСтрока, ".ПослеЗагрузкиВсехДанных") > 0 Тогда
			АлгоритмПослеЗагрузкиВсехДанных = ТекстПослеРавно(ТекСтрока);
			ПозицияТочки = СтрНайти(АлгоритмПослеЗагрузкиВсехДанных, ".");
			Если ПозицияТочки > 0 Тогда
				АлгоритмПослеЗагрузкиВсехДанных = Сред(АлгоритмПослеЗагрузкиВсехДанных, ПозицияТочки + 1);
			КонецЕсли;
			ПКООбъект.АлгоритмПослеЗагрузкиВсехДанных = АлгоритмПослеЗагрузкиВсехДанных;
		ИначеЕсли СтрНайти(ТекСтрока, ".ПравилоДляГруппыСправочника") > 0 Тогда
			ПКООбъект.ПравилоДляГруппыСправочника = Булево(СокрЛП(ТекстПослеРавно(ТекСтрока)));
		КонецЕсли;
	КонецЦикла;
	Если СтрокаРезультат.Отправка = Ложь И СтрокаРезультат.Получение = Ложь Тогда
		ОпределитьНаправлениеОбменаПКО(ОбщиеПеременные, ПКООбъект.Код);
	КонецЕсли;
	ПКООбъект.ИспользоватьДляОтправки = СтрокаРезультат.Отправка;
	ПКООбъект.ИспользоватьДляПолучения = СтрокаРезультат.Получение;
	Если СтрокаРезультат.ВыгружатьВМодульМенеджера = Истина Тогда
		ПКООбъект.ВыгружатьВМодульМенеджера = Истина; 
		ПКООбъект.ОбъектКонфигурацииДляВыгрузкиМодуля = ЗаполнитьОбъектКонфигурацииДляВыгрузкиМодуля(ОбщиеПеременные, СтрокаРезультат, ПКООбъект.ОбъектКонфигурации);
	Иначе
		ПКООбъект.ВыгружатьВМодульМенеджера = Ложь; 
		Если ЗначениеЗаполнено(СтрокаРезультат.ИмяМодуля) Тогда
			ДополнительныйМодульСсылка = Неопределено;
			ОбщиеПеременные.ПользовательскиеМодули.Свойство(СтрокаРезультат.ИмяМодуля, ДополнительныйМодульСсылка);
			ПКООбъект.ДополнительныйМодуль = ДополнительныйМодульСсылка; 
		КонецЕсли;
	КонецЕсли; 

	ПКООбъект.Порядок = СчетчикПКО * 10;
	Если ЗначениеЗаполнено(СтрокаРезультат.Область) Тогда
		ПКООбъект.ГруппаПравил = СтрокаРезультат.Область;
	ИначеЕсли (СтрокаРезультат.Отправка = Ложь И СтрокаРезультат.Получение = Ложь) 
		Или (СтрокаРезультат.Отправка = Истина И СтрокаРезультат.Получение = Истина) Тогда
		ПКООбъект.ГруппаПравил = "Отправка и получение";
	ИначеЕсли СтрокаРезультат.Отправка Тогда
		ПКООбъект.ГруппаПравил = "Отправка";
	Иначе
		ПКООбъект.ГруппаПравил = "Получение";
	КонецЕсли;
	ЗагрузитьТегиВПравиле(СтрокаРезультат.ТекущийТег, ПКООбъект, ОбщиеПеременные);

	СчетчикПКО = СчетчикПКО + 1; 
	ПКООбъект.Записать();
	СтрокаРезультат.СсылкаНаПравило = ПКООбъект.Ссылка;
	Если ПравилоСоздано Тогда
		Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ОбщиеПеременные.Конвертация, ПКООбъект.Ссылка);
		ДополнитьРодственныеКонвертации(ПКООбъект.Ссылка, ПКООбъект.ОбъектКонфигурации, РодственныеКонвертации, РодственныеКонфигурации);
	КонецЕсли;
	// Удаление ПКС.
	Для Каждого ПКС Из СуществующиеПКС Цикл
		ПКСОбъект = ПКС.ПолучитьОбъект();
		ПКСОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьПКПД(ОбщиеПеременные, СтрокаРезультат, СчетчикПКПД, СуществующиеПКПД, РодственныеКонвертации, РодственныеКонфигурации)
	ЧислоСтрок = СтрЧислоСтрок(СтрокаРезультат.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	ТекстПроверкаЗахвата = "";
	ТекстЗапроса = "ВЫБРАТЬ
	|	Правило.Ссылка КАК СсылкаПравило,
	|	Состав.Ссылка КАК СсылкаСостав, 
	|	Правило.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правило
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.ЭлементКонвертации = Правило.Ссылка
	|	И Состав.Владелец = &Конвертация
	|	И Состав.Отключить = ЛОЖЬ
	|ГДЕ Правило.Код = &Имя И Правило.ВременнаяКопия = &ВременнаяКопия
	|	И Правило.Копия = ЛОЖЬ";
	Если ОбщиеПеременные.СовместнаяРабота Тогда
		ТекстПроверкаЗахвата = "ВЫБРАТЬ
		|	Правило.Ссылка КАК СсылкаПравило
		|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Правило
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правило.Ссылка
		|	И Состав.Владелец = &Конвертация
		|	И Состав.Отключить = ЛОЖЬ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник.ПравилаКонвертацииПредопределенныхДанных
		|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
		|ПО ДанныеЗахвата.РабочаяКопия = Правило.Ссылка
		|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
		|ГДЕ Правило.ВременнаяКопия = ЛОЖЬ И Правило.Код = &Имя";
	КонецЕсли;
	ОбъектПКПД = Неопределено;
	СсылкаПКПД = Неопределено;
	НаправлениеОбмена = Неопределено; 
	ЭтоПКЗ = Ложь;
	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СокрЛП(СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, Сч)); 
		ПроверитьТекущийТег(ТекСтрока, ОбщиеПеременные, ЭтоПКЗ);

		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, "Если НаправлениеОбмена = ""Отправка"" Тогда") Тогда
			НаправлениеОбмена = "Отправка";
			Продолжить;
		ИначеЕсли  СтрНайти(ТекСтрока, "Если НаправлениеОбмена = ""Получение"" Тогда") Тогда
			НаправлениеОбмена = "Получение";
			Продолжить;
		ИначеЕсли СтрНайти(ТекСтрока, "КонецЕсли") Тогда
			НаправлениеОбмена = Неопределено;
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, "ПравилоКонвертации.ИмяПКПД") Тогда
			ЭтоПКЗ = Ложь;
			Если ОбщиеПеременные.ТекущийТегПКЗ.Количество() > 0 Тогда
				Для Каждого ТекПКЗ Из ОбщиеПеременные.ТекущийТегПКЗ Цикл
					ОбщиеПеременные.ТекущийТег.Добавить(ТекПКЗ);
				КонецЦикла;
				ОбщиеПеременные.ТекущийТегПКЗ = Новый Массив;
			КонецЕсли;
			ИмяПКПД =  ТекстПослеРавно(ТекСтрока);
			ОбъектПКПД = Справочники.ПравилаКонвертацииПредопределенныхДанных.СоздатьЭлемент();
			ОбъектПКПД.ОбменДанными.Загрузка = Истина;
			ПравилоСоздано = Истина;
			// Проверка возможности загрузки при совместной работе.
			ОбъектЗанят = ПроверкаЗахвата(ОбщиеПеременные, ИмяПКПД, ТекстПроверкаЗахвата);
			Если ОбъектЗанят Тогда
				УведомитьОЗахвате(Метаданные.Справочники.ПравилаКонвертацииПредопределенныхДанных, ИмяПКПД);
				Возврат;
			КонецЕсли; 
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Имя", ИмяПКПД);
			Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
			Запрос.УстановитьПараметр("ВременнаяКопия", (ОбщиеПеременные.ИтерацияЗагрузки <> 1));
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ПравилоСоздано = Ложь;
				ОбъектПКПД = Выборка.СсылкаПравило.ПолучитьОбъект();
				ОбъектПКПД.ОбменДанными.Загрузка = Истина;
				Если ОбщиеПеременные.ИтерацияЗагрузки = 1 Тогда
					ИндексПКПД = СуществующиеПКПД.Найти(Выборка.СсылкаПравило);
					Если ИндексПКПД <> Неопределено Тогда
						СуществующиеПКПД.Удалить(ИндексПКПД);
					КонецЕсли;
				КонецЕсли;
				Если Выборка.ПометкаУдаления Тогда
					ОбъектПКПД.ПометкаУдаления = Ложь;
				КонецЕсли;
				ОбъектПКПД.СопоставлениеЗначений.Очистить();
				СсылкаПКПД = ОбъектПКПД.Ссылка;
			КонецЕсли;
			Если ПравилоСоздано Тогда
				ОбъектПКПД.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO;
				ОбъектПКПД.Код = ИмяПКПД;
				ОбъектПКПД.ВременнаяКопия = (ОбщиеПеременные.ИтерацияЗагрузки <> 1);
			КонецЕсли;
			Если  НаправлениеОбмена = "Отправка" Или НаправлениеОбмена = Неопределено Тогда
				ОбъектПКПД.ИспользоватьДляОтправки = Истина;
			КонецЕсли;
			Если  НаправлениеОбмена = "Получение" Или НаправлениеОбмена = Неопределено Тогда
				ОбъектПКПД.ИспользоватьДляПолучения = Истина;
			КонецЕсли;
			ОбъектПКПД.Теги.Очистить();
			Если ОбщиеПеременные.ТекущийТег.Количество() > 0 Тогда
				Для Каждого ТекТег Из ОбщиеПеременные.ТекущийТег Цикл
					ТекТегСсылка = НайтиСоздатьТег(ОбщиеПеременные, ТекТег);
					СтрокаТег = ОбъектПКПД.Теги.Добавить();
					СтрокаТег.Тег = ТекТегСсылка;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли СтрНайти(ТекСтрока, ".ТипДанных") Тогда
			ЭтоПКЗ = Истина;
			ИмяОбъектаКонфигурации = ТекстПослеРавно(ТекСтрока);
			Если ЗначениеЗаполнено(ИмяОбъектаКонфигурации) И ИмяОбъектаКонфигурации <> "Неопределено" Тогда
				ОбъектПКПД.ОбъектКонфигурации = ОбъектКонфигурацииПоСтроке(ИмяОбъектаКонфигурации, ОбщиеПеременные.Конфигурация);
				Если НЕ ЗначениеЗаполнено(ОбъектПКПД.ОбъектКонфигурации) Тогда
					ТекстОшибки = НСтр("ru='Не обнаружен объект конфигурации %1, правило %2'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", ИмяОбъектаКонфигурации);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%2", ОбъектПКПД.Код);
					ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + Символы.ПС + ТекстОшибки;
					ОбщиеПеременные.Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрНайти(ТекСтрока, ".ТипXDTO") Тогда
			ЭтоПКЗ = Истина;
			ОбъектПКПД.ОбъектФормата = ТекстПослеРавно(ТекСтрока);
		ИначеЕсли СтрНайти(ТекСтрока, "ЗначенияДляОтправки.Вставить") Тогда
			 ДобавитьПКЗ(ОбщиеПеременные, ТекСтрока, ОбъектПКПД, СсылкаПКПД);
		ИначеЕсли НаправлениеОбмена = "Получение" И СтрНайти(ТекСтрока, "ЗначенияДляПолучения.Вставить") Тогда
			 ДобавитьПКЗ(ОбщиеПеременные, ТекСтрока, ОбъектПКПД, СсылкаПКПД, Истина);
		ИначеЕсли СтрНайти(ТекСтрока, "ПравилаКонвертации.Добавить()") И ОбъектПКПД <> Неопределено Тогда
			Если ОбъектПКПД.ИспользоватьДляОтправки И ОбъектПКПД.ИспользоватьДляПолучения Тогда
				ОбъектПКПД.ГруппаПравил = "Отправка и получение";
			ИначеЕсли ОбъектПКПД.ИспользоватьДляОтправки Тогда
				ОбъектПКПД.ГруппаПравил = "Отправка";
			Иначе
				ОбъектПКПД.ГруппаПравил = "Получение";
			КонецЕсли;

			СчетчикПКПД = СчетчикПКПД + 1; 
			ОбъектПКПД.Записать();
			Если ПравилоСоздано Тогда
				Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ОбщиеПеременные.Конвертация, ОбъектПКПД.Ссылка);
				ДополнитьРодственныеКонвертации(ОбъектПКПД.Ссылка, ОбъектПКПД.ОбъектКонфигурации, РодственныеКонвертации, РодственныеКонфигурации);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// Запись последнего ПКПД
	Если ОбъектПКПД <> Неопределено Тогда
		СчетчикПКПД = СчетчикПКПД + 1; 
		ОбъектПКПД.Записать();
		Если ПравилоСоздано Тогда
			Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ОбщиеПеременные.Конвертация, ОбъектПКПД.Ссылка);
			ДополнитьРодственныеКонвертации(ОбъектПКПД.Ссылка, ОбъектПКПД.ОбъектКонфигурации, РодственныеКонвертации, РодственныеКонфигурации);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьПараметры(ОбщиеПеременные, СтрокаРезультат)
	ЧислоСтрок = СтрЧислоСтрок(СтрокаРезультат.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	КонвертацияОбъект = ОбщиеПеременные.Конвертация.ПолучитьОбъект();
	Если ОбщиеПеременные.ИтерацияЗагрузки = 1 Тогда
		КонвертацияОбъект.Параметры.Очистить();
	КонецЕсли;
	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(СтрокаРезультат.ТекстМодуля, Сч);
		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, "ПараметрыКонвертации.Вставить(") Тогда
			ИмяПараметра = ТекстВнутриКавычек(ТекСтрока);
			СтрокаПараметр = КонвертацияОбъект.Параметры.Добавить();
			СтрокаПараметр.Параметр = ИмяПараметра;
			Если ОбщиеПеременные.ИтерацияЗагрузки <> 1 Тогда
				СтрокаПараметр.ВременнаяКопия = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	КонвертацияОбъект.Записать();
КонецПроцедуры

Функция ЗаполнитьСписокПравил(ОбщиеПеременные, ИмяСправочника, РодственныеКонвертации)
	// По существующим определяем связанные конвертации и их конфигурации.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоставЧужой.Владелец КАК Конвертация,
	|	СоставЧужой.Владелец.Конфигурация КАК Конфигурация
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.ЭлементКонвертации = Правила.Ссылка
	|	И Состав.Владелец = &Конвертация
	|	И Состав.Отключить = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК СоставЧужой
	|ПО СоставЧужой.ЭлементКонвертации = Правила.Ссылка
	|	И СоставЧужой.Владелец <> &Конвертация
	|	И СоставЧужой.Отключить = ЛОЖЬ 	
	|";
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Конвертация) Тогда
			Продолжить;
		КонецЕсли;
		Если РодственныеКонвертации.Получить(Выборка.Конвертация) = Неопределено Тогда
			РодственныеКонвертации.Вставить(Выборка.Конвертация, Выборка.Конфигурация);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Правила.Ссылка КАК СсылкаПравило
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.ЭлементКонвертации = Правила.Ссылка
	|	И Состав.Владелец = &Конвертация
	|	И Состав.Отключить = ЛОЖЬ
	|";
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаПравило");
КонецФункции

Процедура ДобавитьПКС(ТекСтрока, Конфигурация, ПКООбъект, ПКОСсылка, СуществующиеПКС, СчетчикПКС, ДанныеГруппы)
	СчетчикПКС = СчетчикПКС + 1;
	Если НЕ ЗначениеЗаполнено(ПКОСсылка) Тогда
		ПКООбъект.Записать();
		ПКОСсылка = ПКООбъект.Ссылка;
	КонецЕсли;
	ИспользуетсяАлгоритм = Ложь;
	СвойствоКонфигурацииСтрокой = "";
	СвойствоФормата = "";
	ПравилоКонвертацииСвойства = "";
	
	ПараметрыПКС = СтрРазделить(ТекстВнутриСкобок(ТекСтрока),",", Истина);
	
	Если ПараметрыПКС.Количество() > 1 Тогда
		СвойствоКонфигурацииСтрокой = ТекстВнутриКавычек(СокрЛП(ПараметрыПКС[1]));
		Если ПараметрыПКС.Количество() > 2 Тогда
			СвойствоФормата = ТекстВнутриКавычек(СокрЛП(ПараметрыПКС[2]));
			Если ПараметрыПКС.Количество() > 3 Тогда
				ИспользуетсяАлгоритм = ?(СтрНайти(ПараметрыПКС[3],"1"), Истина, Ложь);
				Если ПараметрыПКС.Количество() > 4 Тогда
					ПравилоКонвертацииСвойства = ТекстВнутриКавычек(СокрЛП(ПараметрыПКС[4]));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СвойствоКонфигурацииСтрокой) Тогда
		СвойствоКонфигурации = СвойствоКонфигурацииПоСтроке(СвойствоКонфигурацииСтрокой, ПКООбъект.ОбъектКонфигурации,,ДанныеГруппы.ТекущийРодительСвойства);
	Иначе
		СвойствоКонфигурации = Справочники.Свойства.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка,
	|	ИспользуетсяАлгоритмКонвертации,
	|	ПометкаУдаления,
	|	ПравилоКонвертацииСвойства
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &ПКОСсылка И СвойствоКонфигурации = &СвойствоКонфигурации
	|	И СвойствоКонфигурацииСтрокой = &СвойствоКонфигурацииСтрокой
	|	И СвойствоФормата = &СвойствоФормата И Родитель = &Родитель И ЭтоГруппа = Ложь
	|УПОРЯДОЧИТЬ ПО ПометкаУдаления ВОЗР";
	Запрос.УстановитьПараметр("ПКОСсылка", ПКОСсылка);
	Запрос.УстановитьПараметр("СвойствоКонфигурации", СвойствоКонфигурации);
	Запрос.УстановитьПараметр("СвойствоКонфигурацииСтрокой", ?(ЗначениеЗаполнено(СвойствоКонфигурации), "",СвойствоКонфигурацииСтрокой));
	Запрос.УстановитьПараметр("СвойствоФормата", СвойствоФормата);
	Запрос.УстановитьПараметр("Родитель", ?(ДанныеГруппы.ТекущаяГруппаПКС = Неопределено, Справочники.ПравилаКонвертацииСвойств.ПустаяСсылка(), ДанныеГруппы.ТекущаяГруппаПКС));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИндексПКС =  СуществующиеПКС.Найти(Выборка.Ссылка);
		Если ИндексПКС <> Неопределено Тогда
			СуществующиеПКС.Удалить(ИндексПКС);
		КонецЕсли;
		Если Выборка.ИспользуетсяАлгоритмКонвертации = ИспользуетсяАлгоритм 
			И Выборка.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства
			И НЕ Выборка.ПометкаУдаления Тогда
			// Не требуется менять.
			Возврат;
		КонецЕсли;
		ПКСОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Выборка.ПометкаУдаления Тогда
			ПКСОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
	Иначе
		ПКСОбъект = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
		ПКСОбъект.Владелец = ПКОСсылка;
		ПКСОбъект.Родитель = ДанныеГруппы.ТекущаяГруппаПКС;
		ПКСОбъект.СвойствоКонфигурации = СвойствоКонфигурации;
		Если НЕ ЗначениеЗаполнено(СвойствоКонфигурации) Тогда
			ПКСОбъект.СвойствоКонфигурацииСтрокой = СвойствоКонфигурацииСтрокой;
		КонецЕсли;
		ПКСОбъект.СвойствоФормата = СвойствоФормата;
		ПКСОбъект.ПолноеИмяСвойстваКонфигурации = СвойствоКонфигурации; 
		ПКСОбъект.ПолноеИмяСвойстваФормата = СвойствоФормата;

		Если ЗначениеЗаполнено(ДанныеГруппы.ТекущаяГруппаПКС) И ДанныеГруппы.Свойство("СвойствоКонфигурации") Тогда
			ПКСОбъект.ПолноеИмяСвойстваКонфигурации = СокрЛП(ДанныеГруппы.СвойствоКонфигурации) + "." + СокрЛП(СвойствоКонфигурации);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеГруппы.ТекущаяГруппаПКС) И ДанныеГруппы.Свойство("СвойствоФормата") Тогда
			ПКСОбъект.ПолноеИмяСвойстваФормата = СокрЛП(ДанныеГруппы.СвойствоФормата) + "." + СокрЛП(СвойствоФормата);
		КонецЕсли;
		ПараметрыПКС = Новый Структура("СвойствоКонфигурации, СвойствоФормата, СвойствоКонфигурацииСтрокой", СвойствоКонфигурации, СвойствоФормата, СвойствоКонфигурацииСтрокой);
		ПараметрыПКС.Вставить("ПолноеИмяСвойстваКонфигурации", ПКСОбъект.ПолноеИмяСвойстваКонфигурации);  
		ПараметрыПКС.Вставить("ПолноеИмяСвойстваФормата", ПКСОбъект.ПолноеИмяСвойстваФормата);
		ПараметрыПКС.Вставить("ИспользоватьДляОтправки", ПКООбъект.ИспользоватьДляОтправки);  
		ПараметрыПКС.Вставить("ИспользоватьДляПолучения", ПКООбъект.ИспользоватьДляПолучения);

		ПараметрыПКС.Вставить("ЭтоГруппа", Ложь);
		ПараметрыПКС.Вставить("ТипКонвертации", Перечисления.ТипыКонвертаций.XDTO);
		Справочники.ПравилаКонвертацииСвойств.ЗаполнитьНаименованиеПКС(ПКСОбъект.Наименование, ПараметрыПКС);

	КонецЕсли;
	ПКСОбъект.ИспользуетсяАлгоритмКонвертации = ИспользуетсяАлгоритм;
	ПКСОбъект.ПравилоКонвертацииСвойства = ПравилоКонвертацииСвойства;
	ПКСОбъект.Порядок = СчетчикПКС * 10; 
	ПКСОбъект.ОбменДанными.Загрузка = Истина;
	ПКСОбъект.Записать();
КонецПроцедуры

Процедура ДобавитьПКГС(ТекСтрока, Конфигурация, ПКООбъект, ПКОСсылка, СуществующиеПКС, СчетчикПКС, ДанныеГруппы)

	СчетчикПКС = СчетчикПКС + 1;
	Если НЕ ЗначениеЗаполнено(ПКОСсылка) Тогда
		ПКООбъект.Записать();
		ПКОСсылка = ПКООбъект.Ссылка;
	КонецЕсли;
	ПараметрыПКС = СтрРазделить(ТекстВнутриСкобок(ТекСтрока),",", Истина);
	СвойствоФормата = "";
	СвойствоКонфигурацииСтрокой = "";
	Если ПараметрыПКС.Количество() > 1 Тогда
		СвойствоКонфигурацииСтрокой = ТекстВнутриКавычек(СокрЛП(ПараметрыПКС[1]));
		Если ПараметрыПКС.Количество() > 2 Тогда
			СвойствоФормата = ТекстВнутриКавычек(СокрЛП(ПараметрыПКС[2]));
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(СвойствоКонфигурацииСтрокой) Тогда
		СвойствоКонфигурации = СвойствоКонфигурацииПоСтроке(СвойствоКонфигурацииСтрокой, ПКООбъект.ОбъектКонфигурации, Истина);
	Иначе
		СвойствоКонфигурации = Справочники.Свойства.ПустаяСсылка();
	КонецЕсли;
	ДанныеГруппы.ТекущийРодительСвойства = СвойствоКонфигурацииСтрокой;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка,
	|	ПометкаУдаления
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &ПКОСсылка И СвойствоКонфигурации = &СвойствоКонфигурации И СвойствоКонфигурацииСтрокой = &СвойствоКонфигурацииСтрокой
	|	И СвойствоФормата = &СвойствоФормата И Родитель = &Родитель И ЭтоГруппа = ИСТИНА
	|УПОРЯДОЧИТЬ ПО ПометкаУдаления ВОЗР";
	Запрос.УстановитьПараметр("ПКОСсылка", ПКОСсылка);
	Запрос.УстановитьПараметр("СвойствоКонфигурации", СвойствоКонфигурации); 
	Запрос.УстановитьПараметр("СвойствоКонфигурацииСтрокой", ?(ЗначениеЗаполнено(СвойствоКонфигурации),"",СвойствоКонфигурацииСтрокой));

	Запрос.УстановитьПараметр("СвойствоФормата", СвойствоФормата);
	Запрос.УстановитьПараметр("Родитель", Справочники.ПравилаКонвертацииСвойств.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИндексПКС =  СуществующиеПКС.Найти(Выборка.Ссылка);
		Если ИндексПКС <> Неопределено Тогда
			СуществующиеПКС.Удалить(ИндексПКС);
		КонецЕсли;
		Если Выборка.ПометкаУдаления Тогда
			ПКСОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПКСОбъект.ПометкаУдаления = Ложь; 
			ПКСОбъект.ОбменДанными.Загрузка = Истина;

			ПКСОбъект.Записать();
		КонецЕсли;
		ДанныеГруппы.ТекущаяГруппаПКС = Выборка.Ссылка;
		ДанныеГруппы.СвойствоКонфигурации = СвойствоКонфигурации;
		Если ЗначениеЗаполнено(СвойствоКонфигурацииСтрокой) И НЕ ЗначениеЗаполнено(СвойствоКонфигурации) Тогда
			ДанныеГруппы.СвойствоКонфигурацииСтрокой = СвойствоКонфигурацииСтрокой;
		КонецЕсли;
		ДанныеГруппы.СвойствоФормата = СвойствоФормата;
		Возврат;
	КонецЕсли;
	ПКСОбъект = Справочники.ПравилаКонвертацииСвойств.СоздатьГруппу();
	ПКСОбъект.Владелец = ПКОСсылка;
	ПКСОбъект.СвойствоКонфигурации = СвойствоКонфигурации;
	Если ЗначениеЗаполнено(СвойствоКонфигурацииСтрокой) И НЕ ЗначениеЗаполнено(СвойствоКонфигурации) Тогда
		ПКСОбъект.СвойствоКонфигурацииСтрокой = СвойствоКонфигурацииСтрокой;
	КонецЕсли;
	ПКСОбъект.СвойствоФормата = СвойствоФормата; 
	ПКСОбъект.Порядок = СчетчикПКС * 10; 
	ПараметрыПКС = Новый Структура("СвойствоКонфигурации, СвойствоФормата, СвойствоКонфигурацииСтрокой", СвойствоКонфигурации, СвойствоФормата, СвойствоКонфигурацииСтрокой);
	ПараметрыПКС.Вставить("ПолноеИмяСвойстваКонфигурации", "");  
	ПараметрыПКС.Вставить("ПолноеИмяСвойстваФормата", "");
	ПараметрыПКС.Вставить("ИспользоватьДляОтправки", ПКООбъект.ИспользоватьДляОтправки);  
	ПараметрыПКС.Вставить("ИспользоватьДляПолучения", ПКООбъект.ИспользоватьДляПолучения);

	ПараметрыПКС.Вставить("ЭтоГруппа", Истина);
	ПараметрыПКС.Вставить("ТипКонвертации", Перечисления.ТипыКонвертаций.XDTO);
	Справочники.ПравилаКонвертацииСвойств.ЗаполнитьНаименованиеПКС(ПКСОбъект.Наименование, ПараметрыПКС);
	ПКСОбъект.ОбменДанными.Загрузка = Истина;

	ПКСОбъект.Записать();
	
	ДанныеГруппы.ТекущаяГруппаПКС = ПКСОбъект.Ссылка;
	ДанныеГруппы.СвойствоКонфигурации = СвойствоКонфигурации;
	Если ЗначениеЗаполнено(СвойствоКонфигурацииСтрокой) И НЕ ЗначениеЗаполнено(СвойствоКонфигурации) Тогда
		ДанныеГруппы.СвойствоКонфигурацииСтрокой = СвойствоКонфигурацииСтрокой;
	КонецЕсли;
	ДанныеГруппы.СвойствоФормата = СвойствоФормата;
КонецПроцедуры

Процедура ДобавитьПКЗ(ОбщиеПеременные, ТекСтрока, ОбъектПКПД, СсылкаПКПД, ДляПолучения = Ложь)
	Если НЕ ЗначениеЗаполнено(СсылкаПКПД) Тогда
		ОбъектПКПД.Записать();
		СсылкаПКПД = ОбъектПКПД.Ссылка;
	КонецЕсли;
	ПараметрыПКЗ = СтрРазделить(ТекстВнутриСкобок(ТекСтрока),",", Истина);
	ПервыйПараметр = "";
	ВторойПараметр = "";
	Если ПараметрыПКЗ.Количество() > 0 Тогда
		ПервыйПараметр = ТекстВнутриКавычек(СокрЛП(ПараметрыПКЗ[0]));
		Если ПараметрыПКЗ.Количество() > 1 Тогда
			ВторойПараметр = ТекстВнутриКавычек(СокрЛП(ПараметрыПКЗ[1]));
		КонецЕсли;
	КонецЕсли;
	ВторойПараметр = СтрЗаменить(ВторойПараметр, ")", "");
	ВторойПараметр = СтрЗаменить(ВторойПараметр, ";", "");
	Если ДляПолучения Тогда
		ЗначениеКонфигурацииСтрокой = ВторойПараметр;
		ЗначениеФормата = ПервыйПараметр;
	Иначе
		ЗначениеКонфигурацииСтрокой = ПервыйПараметр;
		ЗначениеФормата = ВторойПараметр;
	КонецЕсли;
	ПозицияТочки = СтрНайти(ЗначениеКонфигурацииСтрокой,".",НаправлениеПоиска.СКонца);
	ИмяЗначенияКонфигурации = Сред(ЗначениеКонфигурацииСтрокой, ПозицияТочки + 1);
	СтрокаПКЗ = ОбъектПКПД.СопоставлениеЗначений.Добавить();
	СтрокаПКЗ.ЗначениеКонфигурации = ИмяЗначенияКонфигурации;
	СтрокаПКЗ.ЗначениеФормата = ЗначениеФормата;
	Если ОбщиеПеременные.ТекущийТегПКЗ.Количество() > 0 Тогда
		ТекПКЗСтрокой = ОбщиеПеременные.ТекущийТегПКЗ[ОбщиеПеременные.ТекущийТегПКЗ.Количество()-1];
		СтрокаПКЗ.Тег = НайтиСоздатьТег(ОбщиеПеременные, ТекПКЗСтрокой);
	КонецЕсли;
КонецПроцедуры

// Служебные  процедуры для разбора текста.

Функция ПодготовитьСтруктуруДляАнализаТекстаМодуля()

	Стр = Новый Структура;
	Стр.Вставить("ЭтоФункция",  Ложь);
	// 0 - ищется Функция или Процедура.
	// 1 - ищется имя функции или процедуры.
	// 2 - ищется левая скобка.
	// 3 - ищется правая скобка.
	// 4 - ищется КонецФункции или КонецПроцедуры.
	Стр.Вставить("Статус",      0);
	Стр.Вставить("ИмяПроцедурыФункции","");
	Стр.Вставить("Параметры","");
	Стр.Вставить("ТекстМодуля", 0);
	Стр.Вставить("Экспортный", Ложь);
	Стр.Вставить("ОткрытыеОбласти", Новый Массив);
	Стр.Вставить("НайденТегОткрытие", Ложь);
	Стр.Вставить("НайденТегЗакрытие", Ложь); 

	Возврат Стр;

КонецФункции // ПодготовитьСтруктуруДляАнализаТекстаМодуля()

Процедура ОбработатьСтрокуВПоискеИмениФункцииИлиПроцедуры(ОбщиеПеременные, Стр, СтрАнализа, НомерСтроки)
	Если Найти(Стр, "// АЛГОРИТМЫ") > 0 
		Или Найти(Стр, "#Область Алгоритмы") > 0
		// Для конвертаций на версии 8.2. 
		Или Найти(Стр, "//  Алгоритмы") > 0 Тогда
		ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов = НомерСтроки + 1;
	ИначеЕсли Найти(Стр, "// ПАРАМЕТРЫ КОНВЕРТАЦИИ") > 0 
		Или Найти(Стр, "#Область Параметры") > 0
		// Для конвертаций на версии 8.2. 
		Или Найти (Стр, "ЗаполнитьПараметрыКонвертации")
		Или Найти (Стр, "ОбработчикиКонвертации") Тогда
		Если ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов > 0 И ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов < НомерСтроки Тогда
			ОбщиеПеременные.НомерСтрокиКонецАлгоритмов = НомерСтроки - 1;
		КонецЕсли;
	ИначеЕсли ОбщиеПеременные.ЭтоМодульМенеджера Тогда 
		// Надо пропускать строки которые вне тегов открытия и закрытия.
		Если СтрАнализа.НайденТегОткрытие = Ложь Тогда
			Если Найти(Стр, ОбщиеПеременные.ТегОткрытие) > 0 Тогда
				СтрАнализа.НайденТегОткрытие = Истина; 
			КонецЕсли; 
			Возврат;
		ИначеЕсли СтрАнализа.НайденТегЗакрытие = Истина Тогда
			Возврат;
		ИначеЕсли СтрАнализа.НайденТегОткрытие = Истина И СтрАнализа.НайденТегЗакрытие = Ложь  Тогда
			Если Найти(Стр, ОбщиеПеременные.ТегЗакрытие) > 0 И СтрАнализа.ОткрытыеОбласти.Количество() = 0 Тогда
				СтрАнализа.НайденТегЗакрытие = Истина; 
				Возврат;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	Если Найти(Стр, "#Область") Тогда
		СтрАнализа.ОткрытыеОбласти.Добавить(СтрЗаменить(Стр, "#Область", ""));
	ИначеЕсли Найти(Стр, "#КонецОбласти") Тогда
		Если СокрЛП(СтрАнализа.ОткрытыеОбласти[СтрАнализа.ОткрытыеОбласти.Количество()-1]) = "Алгоритмы" Тогда
			Если ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов > 0 И ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов < НомерСтроки Тогда
				ОбщиеПеременные.НомерСтрокиКонецАлгоритмов = НомерСтроки - 1;
			КонецЕсли;
		КонецЕсли;
		СтрАнализа.ОткрытыеОбласти.Удалить(СтрАнализа.ОткрытыеОбласти.Количество()-1);
	КонецЕсли;
	Если СтрАнализа.Статус <> 4 Тогда
		Если ПустаяСтрока(Стр) Тогда
			Возврат;
		КонецЕсли;
		Если Лев(СокрЛП(Стр),1) = "#" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 0 Тогда
		// 0 - ищется Функция или Процедура.
		ПроверитьТекущийТег(Стр, ОбщиеПеременные);
		ПС = ВРЕГ(ПервоеСлово(Стр));
		Если ПС = "ФУНКЦИЯ" Тогда
			СтрАнализа.Статус = 1;
			СтрАнализа.ЭтоФункция = Истина;
			СтрАнализа.Параметры = "";
		ИначеЕсли ПС = "ПРОЦЕДУРА" Тогда
			СтрАнализа.Статус = 1;
			СтрАнализа.ЭтоФункция = Ложь;
			СтрАнализа.Параметры = "";
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если СтрАнализа.Статус = 1 Тогда
		// 1 - ищется имя функции или процедуры.
		Поз = Найти(Стр, "(");
		Если Поз = 0 Тогда
			СтрАнализа.ИмяПроцедурыФункции = Стр;
			Стр = "";
		Иначе
			СтрАнализа.ИмяПроцедурыФункции = СокрЛП(Лев(Стр, Поз-1));
			Стр = СокрЛП(Сред(Стр, Поз));
		КонецЕсли;
		СтрАнализа.Статус = 2;
		
		Если ПустаяСтрока(Стр) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 2 Тогда
		// 2 - ищется левая скобка.
		Если Лев(Стр, 1) <> "(" Тогда
			СтрОшибка = НСтр("ru='В строке'") + " " + НомерСтроки + " " + НСтр("ru='ожидается символ'") + " '('";
			Возврат;
		КонецЕсли;
		
		СтрАнализа.Статус = 3;
		Стр = СокрЛП(Сред(Стр,2));
		Если ПустаяСтрока(Стр) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 3 Тогда
		// 3 - ищется правая скобка.
		Поз = Найти(Стр, ")");
		Если Поз=0 Тогда
			Возврат;
		КонецЕсли;
		// Сохраняем параметры если они есть.
		Если Поз > 1 Тогда
			СтрАнализа.Параметры = СокрЛП(Лев(Стр, Поз-1));
		КонецЕсли;
		// Анализируем наличие ключевого слова Экспорт после закрывающей скобки.
		Хвост = Сред(Стр, Поз+1);
		Если Найти(Хвост, "Экспорт") > 0 Тогда
			СтрАнализа.Экспортный = Истина;
		Иначе
			СтрАнализа.Экспортный = Ложь;
		КонецЕсли;

		СтрАнализа.Статус = 4;
		СтрАнализа.ТекстМодуля = "";
		Возврат;
	КонецЕсли;
	
	Если СтрАнализа.Статус = 4 Тогда
		// 4 - ищется КонецФункции или КонецПроцедуры.
		КопияСтр = Стр;
		ПС = ВРЕГ(ПервоеСлово(КопияСтр));
		Если (ПС <> "КОНЕЦФУНКЦИИ") И (ПС <> "КОНЕЦПРОЦЕДУРЫ") Тогда
			
			Если СокрЛП(СтрАнализа.ТекстМодуля) <> "" Тогда
				СтрАнализа.ТекстМодуля = СтрАнализа.ТекстМодуля + Символы.ПС;
			КонецЕсли;
			// Убираем первый символ tab - он подставляется автоматически при выгрузке модуля.
			Если Лев(Стр, 1) = Символы.Таб Тогда
				Стр = Сред(Стр,2);
			КонецЕсли;
			СтрАнализа.ТекстМодуля = СтрАнализа.ТекстМодуля + Стр;
			Возврат;
		КонецЕсли;
		
		СтрАнализа.Статус = 0;
		
		новСтр = ОбщиеПеременные.ТаблицаРезультатов.Добавить();
		новСтр.ИмяПроцедурыФункции      = СтрАнализа.ИмяПроцедурыФункции;
		новСтр.ЭтоФункция = СтрАнализа.ЭтоФункция;
		новСтр.Параметры = СтрАнализа.Параметры;
		новСтр.ТекстМодуля = СтрАнализа.ТекстМодуля;
		НовСтр.ИмяМодуля = ОбщиеПеременные.ТекущийЗагружаемыйМодуль;
		Если СтрАнализа.НайденТегОткрытие Тогда 
			новСтр.ВыгружатьВМодульМенеджера = Истина;
		КонецЕсли;
		Для НомерОбласти = 1 По СтрАнализа.ОткрытыеОбласти.Количество() Цикл
			ИмяОбласти = СокрЛП(СтрАнализа.ОткрытыеОбласти[СтрАнализа.ОткрытыеОбласти.Количество() - НомерОбласти]);
			Если СтрНайти(НРег(ИмяОбласти), "отправкаиполучение")
				Или СтрНайти(НРег(ИмяОбласти), "отправка_и_получение") Тогда
				НовСтр.Отправка = Истина;
				НовСтр.Получение = Истина;
			ИначеЕсли  СтрНайти(НРег(ИмяОбласти), "отправка") Тогда
				НовСтр.Отправка = Истина;
			ИначеЕсли СтрНайти(НРег(ИмяОбласти), "получение") Тогда
				НовСтр.Получение = Истина;
			КонецЕсли;
			Если СтрНайти(СтрАнализа.ИмяПроцедурыФункции, ИмяОбласти) > 0
				Или ЭтоСлужебнаяОбласть(ИмяОбласти) Тогда
				Продолжить;
			КонецЕсли;
			новСтр.Область = ИмяОбласти;
			Прервать;
		КонецЦикла;
		НовСтр.ТекущийТег = СтрСоединить(ОбщиеПеременные.ТекущийТег, ",");
		Если НомерСтроки >= ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов 
			И ОбщиеПеременные.НомерСтрокиНачалоАлгоритмов <> 0
			И ОбщиеПеременные.НомерСтрокиКонецАлгоритмов = 0 Тогда
			НовСтр.ЭтоАлгоритм = Истина;
			// Признак экспорта имеет смысл только для алгоритмов.
			НовСтр.Экспортный = СтрАнализа.Экспортный;
		Иначе
			НовСтр.ЭтоАлгоритм = Ложь;
			НовСтр.Экспортный = Ложь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОпределитьНаправлениеОбменаПКО(ОбщиеПеременные, КодПКО)
	Если ОбщиеПеременные.Свойство("СтрокаЗаполнитьПКО") = Ложь Тогда
		ОбщиеПеременные.Ошибки = ОбщиеПеременные.Ошибки + НСтр("ru='Проверьте наличие процедуры ЗаполнитьПравилаКонвертацииОбъектов, она должна располагаться в начале модуля'") + Символы.ПС;
		ОбщиеПеременные.Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЧислоСтрок = СтрЧислоСтрок(ОбщиеПеременные.СтрокаЗаполнитьПКО.ТекстМодуля);
	Если ЧислоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	НаправлениеОбмена = "";
	Для Сч = 1 По ЧислоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(ОбщиеПеременные.СтрокаЗаполнитьПКО.ТекстМодуля, Сч);
		Если Лев(ТекСтрока, 2) = "//" Или СокрЛП(ТекСтрока) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если СтрНайти(ТекСтрока, "НаправлениеОбмена") > 0 Тогда
			НаправлениеОбмена = ТекстПослеРавно(ТекСтрока);
		ИначеЕсли СтрНайти(ТекСтрока, "КонецЕсли") > 0 Тогда
			НаправлениеОбмена = "";
		ИначеЕсли СтрНайти(ТекСтрока, "ДобавитьПКО_" + КодПКО) > 0 Тогда
			СтрокаПКО = ОбщиеПеременные.ТаблицаРезультатов.НайтиСтроки(Новый Структура("ИмяПроцедурыФункции", "ДобавитьПКО_" + КодПКО));
			Если СтрокаПКО = Неопределено Или СтрокаПКО.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			Если НаправлениеОбмена = "Отправка" Тогда
				СтрокаПКО[0].Отправка = Истина;
			ИначеЕсли НаправлениеОбмена = "Получение" Тогда
				СтрокаПКО[0].Получение = Истина;
			Иначе
				СтрокаПКО[0].Отправка = Истина;
				СтрокаПКО[0].Получение = Истина;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Из строки получить первое слово.
Функция ПервоеСлово(Стр)

	Стр = СокрЛП(Стр);
	масСимволов = Новый Массив;
	масСимволов.Добавить(" ");
	масСимволов.Добавить("/");
	масСимволов.Добавить(";");
	масСимволов.Добавить(Символы.Таб);
	
	Поз = 0;
	Для Каждого Символ Из масСимволов Цикл
		ПозицияСимвола = Найти(Стр, Символ);
		Если ПозицияСимвола = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияСимвола = ?(Поз=0, ПозицияСимвола, Мин(Поз, ПозицияСимвола));
		Поз = ПозицияСимвола;
	КонецЦикла;
	
	Если Поз=0 Тогда
		Результат = Стр;
		Стр = "";
	Иначе
		Результат = СокрЛП(Лев(Стр,Поз-1));
		Стр = СокрЛП(Сред(Стр,Поз+1));
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

Функция ЭтоСлужебнаяОбласть(СтрОбласть)
	СлужебныеОбласти = Новый Массив;
	СлужебныеОбласти.Добавить("ВерсияФорматаМенеджераОбмена");
	СлужебныеОбласти.Добавить("ЗаполнитьПравилаОбработкиДанных");
	СлужебныеОбласти.Добавить("ПОД");
	СлужебныеОбласти.Добавить("ЗаполнитьПравилаКонвертацииОбъектов");
	СлужебныеОбласти.Добавить("ПКО_ЕстьПолучение");
	СлужебныеОбласти.Добавить("ПКО_ТолькоОтправка");
	СлужебныеОбласти.Добавить("Конвертация_Параметры_ПОД_ПередОбработкой");
	СлужебныеОбласти.Добавить("Конвертация_Параметры_ПОД_ПриОбработке");
	СлужебныеОбласти.Добавить("Конвертация_Параметры_ПОД_ВыборкаДанных");
	СлужебныеОбласти.Добавить("Конвертация_Параметры_ПКО_ПередОтправкойДанных");
	СлужебныеОбласти.Добавить("Конвертация_Параметры_ПКО_ПриОтправкеДанных");
	СлужебныеОбласти.Добавить("Конвертация_Параметры_ПКО_ПриКонвертацииДанныхXDTO");
	СлужебныеОбласти.Добавить("Конвертация_Параметры_ПКО_ПередЗаписьюПолученныхДанных");
	СлужебныеОбласти.Добавить("ПрограммныйИнтерфейс");
	СлужебныеОбласти.Добавить("ПроцедурыКонвертации");
	СлужебныеОбласти.Добавить("ОбщегоНазначения");
	СлужебныеОбласти.Добавить("СлужебныеПроцедурыИФункции");
	СлужебныеОбласти.Добавить("Алгоритмы");
	СлужебныеОбласти.Добавить("ОбработчикиКонвертации");
	Для Каждого СлужебнаяОбласть Из СлужебныеОбласти Цикл
		Если СтрНайти(СтрОбласть, СлужебнаяОбласть) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Процедура ПроверитьТекущийТег(Стр, ОбщиеПеременные, ЭтоПКЗ = Ложь)
	Если Лев(Стр, 2) <> "//" Тогда
		Возврат;
	КонецЕсли;
	СтрБезПробелов = СокрЛП(Стр);
	Если Найти(СтрБезПробелов, "//++") > 0 Тогда
		ТегСтрокой = СокрЛП(СтрЗаменить(СтрБезПробелов, "//++", ""));
		Если ЭтоПКЗ Тогда 
			Если ОбщиеПеременные.ТекущийТегПКЗ.Найти(ТегСтрокой) = Неопределено Тогда
				ОбщиеПеременные.ТекущийТегПКЗ.Добавить(ТегСтрокой);
			КонецЕсли
		ИначеЕсли ОбщиеПеременные.ТекущийТег.Найти(ТегСтрокой) = Неопределено Тогда
			ОбщиеПеременные.ТекущийТег.Добавить(ТегСтрокой);
		КонецЕсли;
	ИначеЕсли Найти(СтрБезПробелов, "//--") > 0 Тогда
		ТегСтрокой = СокрЛП(СтрЗаменить(СтрБезПробелов, "//--", ""));
		ИндексЗначения = ОбщиеПеременные.ТекущийТегПКЗ.Найти(ТегСтрокой);
		Если ИндексЗначения <> Неопределено Тогда
			ОбщиеПеременные.ТекущийТегПКЗ.Удалить(ИндексЗначения);
		Иначе
			ИндексЗначения = ОбщиеПеременные.ТекущийТег.Найти(ТегСтрокой);
			Если ИндексЗначения <> Неопределено Тогда
				ОбщиеПеременные.ТекущийТег.Удалить(ИндексЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ТекстПослеРавно(Стр)
	Позиция1 = СтрНайти(Стр, "=");
	Если Позиция1 = 0 Тогда
		Возврат "";
	КонецЕсли;
	Результат = СокрЛП(Сред(Стр, Позиция1 + 1));
	
	Результат = СтрЗаменить(Результат, ";", "");
	Если СтрНайти(Результат, """") > 0 Тогда
		Результат = ТекстВнутриКавычек(Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ТекстВнутриКавычек(Стр)
	Позиция1 = СтрНайти(Стр, """",,,1);
	Позиция2 = СтрНайти(Стр, """",,,2);
	Если Позиция1 = 0 Или Позиция2 = 0 Тогда
		Возврат Стр;
	КонецЕсли;
	Возврат СокрЛП(Сред(Стр,Позиция1+1,Позиция2-Позиция1-1)); 
КонецФункции

Функция ТекстВнутриСкобок(Стр)
	Позиция1 = СтрНайти(Стр, "(",,,1);
	Позиция2 = СтрНайти(Стр, ")",,,2);
	Если Позиция1 = 0 Или Позиция2 = 0 Тогда
		Возврат Стр;
	КонецЕсли;
	Возврат СокрЛП(Сред(Стр,Позиция1+1,Позиция2-Позиция1-1)); 
КонецФункции

Функция ОбъектКонфигурацииПоСтроке(Стр, Конфигурация, Разделитель = ".")
	// Пример строки Метаданные.Документы.ВводОстатков
	// Либо Документы_АвансовыйОтчет
	ПолеПоиска = СтрЗаменить(Стр, "Метаданные.", "");
	ПозицияТочки = СтрНайти(ПолеПоиска, Разделитель);
	ГруппаОбъектов = Лев(ПолеПоиска, ПозицияТочки - 1);
	ИмяОбъекта = Сред(ПолеПоиска, ПозицияТочки + 1);
	ЗапросОбъект = Новый Запрос;
	ЗапросОбъект.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.Объекты
	|ГДЕ Владелец = &Конфигурация И Имя = &Имя И Родитель.Наименование = &Группа
	|УПОРЯДОЧИТЬ ПО ПометкаУдаления ВОЗР";
	ЗапросОбъект.УстановитьПараметр("Конфигурация", Конфигурация);
	ЗапросОбъект.УстановитьПараметр("Группа", ГруппаОбъектов);
	ЗапросОбъект.УстановитьПараметр("Имя", ИмяОбъекта);
	Выборка = ЗапросОбъект.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Объекты.ПустаяСсылка();
КонецФункции

Функция СвойствоКонфигурацииПоСтроке(Наименование, Объект, ЭтоГруппа = Ложь, Родитель = "")
	ЗапросСвойство = Новый Запрос;
	ЗапросСвойство.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.Свойства
	|ГДЕ Владелец = &Объект И Наименование = &Наименование И 
	|	(Родитель.Наименование = &Родитель ИЛИ (&ПустойРодитель И Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)))
	|	И ЭтоГруппа = &ЭтоГруппа
	|УПОРЯДОЧИТЬ ПО ПометкаУдаления ВОЗР";
	ЗапросСвойство.УстановитьПараметр("Объект", Объект);
	ЗапросСвойство.УстановитьПараметр("ЭтоГруппа", ЭтоГруппа);
	ЗапросСвойство.УстановитьПараметр("Наименование", Наименование);
	ЗапросСвойство.УстановитьПараметр("Родитель", Родитель);
	ЗапросСвойство.УстановитьПараметр("ПустойРодитель", НЕ ЗначениеЗаполнено(Родитель));

	Выборка = ЗапросСвойство.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Свойства.ПустаяСсылка();
	
КонецФункции

Процедура УдалитьЛишниеПравила(ОбщиеПеременные, СуществующиеПравила, ИмяСправочника)
	Если СуществующиеПравила.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	ПОД.Ссылка КАК Правило,
	|	СоставСвой.Ссылка КАК Состав,
	|	ВЫБОР КОГДА СоставЧужой.Ссылка Есть NULL ТОГДА
	|		ИСТИНА
	|	ИНАЧЕ ЛОЖЬ КОНЕЦ КАК МожноУдалить
	|ИЗ Справочник." + ИмяСправочника + " КАК ПОД
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК СоставЧужой
	|ПО СоставЧужой.ЭлементКонвертации = ПОД.Ссылка
	|	И СоставЧужой.Владелец <> &Конвертация
	|	И СоставЧужой.Отключить = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК СоставСвой
	|ПО СоставСвой.ЭлементКонвертации = ПОД.Ссылка
	|	И СоставСвой.Владелец = &Конвертация
	|	И СоставСвой.Отключить = ЛОЖЬ
	|ГДЕ ПОД.Ссылка В (&КУдалению)";
	Запрос.УстановитьПараметр("КУдалению", СуществующиеПравила);
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.МожноУдалить Тогда
			ПравилоОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПравилоОбъект.УстановитьПометкуУдаления(Истина);
		Иначе
			СоставОбъект = Выборка.Состав.ПолучитьОбъект();
			СоставОбъект.Отключить = Истина;
			СоставОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДополнитьРодственныеКонвертации(ПравилоСсылка, ИсходныйОбъектКонфигурации, РодственныеКонвертации, РодственныеКонфигурации)
	РодственныеКонвертации = Новый Соответствие;
	Если РодственныеКонвертации.Количество() = 0 Или Не ЗначениеЗаполнено(ИсходныйОбъектКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	ИмяОбъектаКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйОбъектКонфигурации, "Наименование");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Владелец
	|ИЗ Справочник.Объекты КАК Объекты
	|ГДЕ Объект.Владелец В &МассивКонфигураций
	|	И Объект.Наименование = &Наименование";
	Запрос.УстановитьПараметр("МассивКонфигураций", РодственныеКонфигурации);
	ИскомыеКонфигурации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Владелец");
	Если ИскомыеКонфигурации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Родственник Из РодственныеКонвертации Цикл
		Если ИскомыеКонфигурации.Найти(Родственник.Значение) Тогда
			Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(Родственник.Ключ, ПравилоСсылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДополнитьРодственныеКонвертации_ПОДЗагрузки(ОбщиеПеременные, ПОДЗагрузки, РодственныеКонвертации)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПравилоКонвертацииОбъекта КАК ПКО,
	|	Ссылка КАК ПОД
	|ПОМЕСТИТЬ ИменаПКО
	|ИЗ Справочник.ПравилаОбработкиДанных.ПравилаКонвертацииОбъектов
	|ГДЕ Ссылка В (&ПОД)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|  ПравилоКонвертацииОбъекта,
	|	Ссылка
	|ИЗ Справочник.ПравилаОбработкиДанных
	|ГДЕ Ссылка В (&ПОД) И ПравилоКонвертацииОбъекта <> &ПустаяСтрока
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИменаПКО.ПОД КАК ПОД,
	|	СоставЧужой.Владелец КАК Конвертация
	|ИЗ ИменаПКО КАК ИменаПКО
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииОбъектов КАК ПравилаКонвертацииОбъектов
	|ПО ИменаПКО.ПКО = ПравилаКонвертацииОбъектов.Код
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.ЭлементКонвертации = ПравилаКонвертацииОбъектов.Ссылка
	|	И Состав.Владелец = &Конвертация
	|	И Состав.Отключить = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.СоставыКонвертаций КАК СоставЧужой
	|ПО Состав.ЭлементКонвертации = ПравилаКонвертацииОбъектов.Ссылка
	|	И Состав.Владелец <> &Конвертация
	|	И Состав.Отключить = ЛОЖЬ
	|ГДЕ СоставЧужой.Владелец IS NOT NULL
	|";
	Запрос.УстановитьПараметр("ПОД", ПОДЗагрузки);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если РодственныеКонвертации.Получить(Выборка.Конвертация) Тогда
			Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(Выборка.Конвертация, Выборка.ПОД);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СписокВВидеСтроки(СписокЗначенийИсходный) 
	СтрокаПредставление = " ";
	Для Каждого ЭлементСписка Из СписокЗначенийИсходный Цикл
		СтрокаПредставление = СтрокаПредставление + СокрЛП(ЭлементСписка.Значение) + ",";
	КонецЦикла; 
	СтрокаПредставление = Лев(СтрокаПредставление, СтрДлина(СтрокаПредставление)-1);
	Возврат СтрокаПредставление;
КонецФункции

Процедура НайтиРасхожденияВПравилах(ОбщиеПеременные, ИмяСправочника, ИмяРеквизитаИдентификации, СписокРеквизитов, Уровень1, СписокРеквизитовОтправка = "", СписокРеквизитовПолучение = "")
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	Правила." + ИмяРеквизитаИдентификации + " КАК КлючПоиска
	|ПОМЕСТИТЬ ПравилаИсходные
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставВнутр
	|ПО Правила.Ссылка = СоставВнутр.ЭлементКОнвертации
	|	И СоставВнутр.Владелец = &Конвертация И СоставВнутр.Отключить = ЛОЖЬ И СоставВнутр.ПометкаУдаления = ЛОЖЬ
	|	И Правила.ВременнаяКопия = ЛОЖЬ И Правила.Копия = ЛОЖЬ
	|;
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	Правила." + ИмяРеквизитаИдентификации + " КАК КлючПоиска
	|ПОМЕСТИТЬ ПравилаНовые
	|ИЗ Справочник." + ИмяСправочника + " КАК Правила
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставВнутр
	|ПО Правила.Ссылка = СоставВнутр.ЭлементКОнвертации
	|	И СоставВнутр.Владелец = &Конвертация И СоставВнутр.Отключить = ЛОЖЬ И СоставВнутр.ПометкаУдаления = ЛОЖЬ
	|	И Правила.ВременнаяКопия = ИСТИНА
	|;
	|ВЫБРАТЬ
	|	ПравилаИсходные.Ссылка КАК Правило1,
	|	ПравилаНовые.Ссылка КАК Правило2
	|ИЗ ПравилаИсходные КАК ПравилаИсходные
	|ПОЛНОЕ СОЕДИНЕНИЕ ПравилаНовые КАК ПравилаНовые
	|ПО ПравилаИсходные.КлючПоиска = ПравилаНовые.КлючПоиска
	|";
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация); 
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);


	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Правило1) Или НЕ ЗначениеЗаполнено(Выборка.Правило2) Тогда
			Уровень1_строка = Уровень1.Добавить();
			Если ЗначениеЗаполнено(Выборка.Правило1) Тогда
				Уровень1_строка.Правило1 = Выборка.Правило1;
				Уровень1_строка.Правило2 = Справочники[ИмяСправочника].ПустаяСсылка();
				ДобавитьИнформациюОВхожденияхПравила(Уровень1_строка);
				ДобавитьИнформациюОЗахватеПравила(ОбщиеПеременные, Уровень1_строка, ИмяСправочника, ИмяРеквизитаИдентификации);
			Иначе
				Уровень1_строка.Правило1 = Справочники[ИмяСправочника].ПустаяСсылка();
				Уровень1_строка.Правило2 = Выборка.Правило2;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		РеквизитыПравила1 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Правило1, СписокРеквизитов);
		РеквизитыПравила2 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Правило2, СписокРеквизитов); 
		ЕстьРасхождения = Ложь;
		МассивРеквизитов = СтрРазделить(СписокРеквизитов, ",", Ложь);
		Для Каждого Рекв Из МассивРеквизитов Цикл
			Если РеквизитыПравила1[СокрЛП(Рекв)] <> РеквизитыПравила2[СокрЛП(Рекв)] Тогда
				ИмяРеквИсключение = "#" + СокрЛП(Рекв) + "#";
				Если СписокРеквизитовОтправка <> "" И НЕ РеквизитыПравила1.ИспользоватьДляОтправки
					И СтрНайти(СписокРеквизитовОтправка, ИмяРеквИсключение) > 0 Тогда
					Продолжить;
				КонецЕсли; 
				Если СписокРеквизитовПолучение <> "" И НЕ РеквизитыПравила1.ИспользоватьДляПолучения
					И СтрНайти(СписокРеквизитовПолучение, ИмяРеквИсключение) > 0 Тогда
					Продолжить;
				КонецЕсли;
				ЕстьРасхождения = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьРасхождения = Ложь Тогда
			// Сравнение ТЧ.
			Если ИмяСправочника = "ПравилаОбработкиДанных" Тогда
				СравнитьТабличныеЧастиПОД(Выборка.Правило1, Выборка.Правило2, ЕстьРасхождения);
			ИначеЕсли ИмяСправочника = "ПравилаКонвертацииОбъектов" Тогда
				СравнитьТабличныеЧастиИПКС(Выборка.Правило1, Выборка.Правило2, ЕстьРасхождения); 
			ИначеЕсли ИмяСправочника = "ПравилаКонвертацииПредопределенныхДанных" Тогда
				СравнитьТабличныеЧастиПКПД(Выборка.Правило1, Выборка.Правило2, ЕстьРасхождения);
			КонецЕсли;
		КонецЕсли;
		Если ЕстьРасхождения = Ложь Тогда
			Продолжить;
		КонецЕсли;
		// Есть расхождения.
		Уровень1_строка = Уровень1.Добавить();
		Уровень1_строка.Правило1 = Выборка.Правило1;
		Уровень1_строка.Правило2 = Выборка.Правило2;  
		ДобавитьИнформациюОВхожденияхПравила(Уровень1_строка);
		ДобавитьИнформациюОЗахватеПравила(ОбщиеПеременные, Уровень1_строка, ИмяСправочника, ИмяРеквизитаИдентификации);
	КонецЦикла;

КонецПроцедуры

Процедура НайтиРасхожденияВПараметрахКонвертации(ОбщиеПеременные, Уровень1)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	Правила.Параметр КАК КлючПоиска
	|ПОМЕСТИТЬ ПравилаИсходные
	|ИЗ Справочник.Конвертации.Параметры КАК Правила 
	|ГДЕ Правила.ВременнаяКопия = ЛОЖЬ И Правила.Ссылка = &Конвертация
	|;
	|ВЫБРАТЬ
	|	Правила.Параметр КАК КлючПоиска
	|ПОМЕСТИТЬ ПравилаНовые
	|ИЗ Справочник.Конвертации.Параметры КАК Правила 
	|ГДЕ Правила.ВременнаяКопия = ИСТИНА И Правила.Ссылка = &Конвертация
	|;
	|ВЫБРАТЬ
	|	ПравилаИсходные.КлючПоиска КАК Правило1,
	|	ПравилаНовые.КлючПоиска КАК Правило2
	|ИЗ ПравилаИсходные КАК ПравилаИсходные
	|ПОЛНОЕ СОЕДИНЕНИЕ ПравилаНовые КАК ПравилаНовые
	|ПО ПравилаИсходные.КлючПоиска = ПравилаНовые.КлючПоиска
	|";
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация); 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Правило1) Или НЕ ЗначениеЗаполнено(Выборка.Правило2) Тогда
			Уровень1_строка = Уровень1.Добавить();
			Если ЗначениеЗаполнено(Выборка.Правило1) Тогда
				Уровень1_строка.Правило1 = Выборка.Правило1;
				Уровень1_строка.Правило2 = "";
				Уровень1_строка.ПравилоРазделенное = Ложь;
				Уровень1_строка.ИнформацияЗагрузки = НСтр("ru='Правило обособленное'");
			Иначе
				Уровень1_строка.Правило1 = "";
				Уровень1_строка.Правило2 = Выборка.Правило2;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СравнитьТабличныеЧастиПОД(Правило1, Правило2, ЕстьРасхождения)
	ТЧ1 = Правило1.ПравилаКонвертацииОбъектов.Выгрузить();
	ТЧ2 = Правило2.ПравилаКонвертацииОбъектов.Выгрузить();
	Если ТЧ1.Количество() <> ТЧ2.Количество() Тогда
		ЕстьРасхождения = Истина; 
		Возврат;
	ИначеЕсли ТЧ1.Количество() <> 0 Тогда
		Для Каждого СтрокаТЧ Из ТЧ1 Цикл
			Если ТЧ2.Найти(СтрокаТЧ.ПравилоКонвертацииОбъекта, "ПравилоКонвертацииОбъекта") = Неопределено Тогда
				ЕстьРасхождения = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаТЧ Из ТЧ2 Цикл
			Если ТЧ1.Найти(СтрокаТЧ.ПравилоКонвертацииОбъекта, "ПравилоКонвертацииОбъекта") = Неопределено Тогда
				ЕстьРасхождения = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьТабличныеЧастиПКПД(Правило1, Правило2, ЕстьРасхождения)
	ТЧ1 = Правило1.СопоставлениеЗначений.Выгрузить();
	ТЧ2 = Правило2.СопоставлениеЗначений.Выгрузить();
	Если ТЧ1.Количество() <> ТЧ2.Количество() Тогда
		ЕстьРасхождения = Истина;
	ИначеЕсли ТЧ1.Количество() <> 0 Тогда
		Для Каждого СтрокаТЧ Из ТЧ1 Цикл
			СтрПоиска = Новый Структура("ЗначениеКонфигурации, ЗначениеФормата", СтрокаТЧ.ЗначениеКонфигурации, СтрокаТЧ.ЗначениеФормата);
			МасСтрТЧ2 = ТЧ2.НайтиСтроки(СтрПоиска);
			Если МасСтрТЧ2.Количество() = 0 Тогда
				ЕстьРасхождения = Истина;
				Возврат; 
			КонецЕсли;
		КонецЦикла; 
		Для Каждого СтрокаТЧ Из ТЧ2 Цикл
			СтрПоиска = Новый Структура("ЗначениеКонфигурации, ЗначениеФормата", СтрокаТЧ.ЗначениеКонфигурации, СтрокаТЧ.ЗначениеФормата);
			МасСтрТЧ1 = ТЧ1.НайтиСтроки(СтрПоиска);
			Если МасСтрТЧ1.Количество() = 0 Тогда
				ЕстьРасхождения = Истина;
				Возврат; 
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьТабличныеЧастиИПКС(Правило1, Правило2, ЕстьРасхождения)
	ТЧ1 = Правило1.ИдентификацияПоПолямПоиска.Выгрузить();
	ТЧ2 = Правило2.ИдентификацияПоПолямПоиска.Выгрузить();
	Если ТЧ1.Количество() <> ТЧ2.Количество() Тогда
		ЕстьРасхождения = Истина;
		Возврат;
	ИначеЕсли ТЧ1.Количество() <> 0 Тогда
		Для НомСтр = 0 По ТЧ1.Количество()-1 Цикл 
			Если ТЧ1[НомСтр].РеквизитыПоиска <> ТЧ2[НомСтр].РеквизитыПоиска Тогда
				ЕстьРасхождения = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	// Сравнение ПКС. 
	ИменаРеквизитовСтрокой = "
	|	ИспользуетсяАлгоритмКонвертации, 
	|	ПолноеИмяСвойстваКонфигурации, 
	|	ПолноеИмяСвойстваФормата,
	|	СвойствоКонфигурации,
	|	СвойствоКонфигурацииСтрокой,
	|	СвойствоФормата,
	|	ПравилоКонвертацииСвойства, 
	|	Поиск,";
	ИменаРеквизитовУникальные = "ИспользуетсяАлгоритмКонвертации,ПолноеИмяСвойстваКонфигурации,ПолноеИмяСвойстваФормата,ПравилоКонвертацииСвойства,Поиск,СвойствоКонфигурации,СвойствоКонфигурацииСтрокой,СвойствоФормата";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ" + ИменаРеквизитовСтрокой + "
	|1 КАК КоличествоИсх,
	|0 КАК КоличествоНов
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК ПКСИсходные
	|ГДЕ Владелец = &Правило1 И НЕ ПометкаУдаления И ЭтоГруппа = ЛОЖЬ И Отключить = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ " + ИменаРеквизитовСтрокой + "
	|0 КАК КоличествоИсх,
	|1 КАК КоличествоНов
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК ПКСНовые
	|ГДЕ Владелец = &Правило2 И НЕ ПометкаУдаления И ЭтоГруппа = ЛОЖЬ И Отключить = ЛОЖЬ
	|";  
	Запрос.УстановитьПараметр("Правило1", Правило1); 
	Запрос.УстановитьПараметр("Правило2", Правило2);

	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Если ТабРезультат.Количество() > 0 Тогда
		Для Каждого СтрТаб Из ТабРезультат Цикл
			Если СтрТаб.ИспользуетсяАлгоритмКонвертации И ЗначениеЗаполнено(СтрТаб.СвойствоКонфигурации) Тогда
				СтрТаб.СвойствоКонфигурации = Справочники.Свойства.ПустаяСсылка();
			КонецЕсли; 
			Если СтрТаб.ИспользуетсяАлгоритмКонвертации И ЗначениеЗаполнено(СтрТаб.СвойствоКонфигурацииСтрокой) Тогда
				СтрТаб.СвойствоКонфигурацииСтрокой = "";
			КонецЕсли;
		КонецЦикла;
		ТабРезультат.Свернуть(ИменаРеквизитовУникальные, "КоличествоИсх, КоличествоНов");
		Для Каждого СтрТаб Из ТабРезультат Цикл
			Если СтрТаб.КоличествоИсх <> СтрТаб.КоличествоНов Тогда
				ЕстьРасхождения = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


Процедура ДобавитьИнформациюОВхожденияхПравила(Уровень1_строка)
	СписокКонвертаций = Новый СписокЗначений;
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Уровень1_строка.Правило1, СписокКонвертаций);
	Если СписокКонвертаций.Количество() > 1 Тогда
		Уровень1_строка.ПравилоРазделенное = Истина;
		Уровень1_строка.ИнформацияЗагрузки = НСтр("ru='Правило общее:'") + СписокВВидеСтроки(СписокКонвертаций);
	Иначе 
		Уровень1_строка.ПравилоРазделенное = Ложь;
		Уровень1_строка.ИнформацияЗагрузки = НСтр("ru='Правило обособленное'");
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьИнформациюОЗахватеПравила(ОбщиеПеременные, Уровень1_строка, ИмяСправочника, ИмяРеквизитаИдентификации)
	Уровень1_строка.ПравилоЗахвачено = Ложь;
	Если НЕ ОбщиеПеременные.СовместнаяРабота Тогда
		Возврат;
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Правило.Ссылка КАК СсылкаПравило
		|ИЗ Справочник." + ИмяСправочника + " КАК Правило
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правило.Ссылка
		|	И Состав.Владелец = &Конвертация
		|	И Состав.Отключить = ЛОЖЬ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект ССЫЛКА Справочник." + ИмяСправочника + "
		|				И Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)) КАК ДанныеЗахвата
		|ПО ДанныеЗахвата.РабочаяКопия = Правило.Ссылка
		|	И ДанныеЗахвата.Пользователь <> &ТекущийПользователь
		|ГДЕ Правило.ВременнаяКопия = ЛОЖЬ И Правило." + ИмяРеквизитаИдентификации + " = &Имя";
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Имя", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уровень1_строка.Правило1,ИмяРеквизитаИдентификации));
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Уровень1_строка.ПравилоЗахвачено = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьСтроку_Удаление(СтрокаТЧ, ОбщиеПеременные)
	Если СтрокаТЧ.ПравилоРазделенное И СтрокаТЧ.РежимЗагрузки = 1 Тогда
		// Необходимо исключить из состава конвертации
		ИсключитьПравилоИзСоставаКонвертации(СтрокаТЧ.Правило1, ОбщиеПеременные);
		Возврат;
	КонецЕсли;
	Если ТипЗнч(СтрокаТЧ.Правило1) = Тип("Строка") Тогда
		// Это параметр.
		КонвертацияОбъект = ОбщиеПеременные.Конвертация.ПолучитьОбъект();
		СтрТЧ = КонвертацияОбъект.Параметры.Найти(СтрокаТЧ.Правило1, "Параметр");
		Если СтрТЧ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		КонвертацияОбъект.Параметры.Удалить(СтрТЧ);
		КонвертацияОбъект.Записать();
		Возврат;
	КонецЕсли;
	ПравилоОбъект = СтрокаТЧ.Правило1.ПолучитьОбъект();
	ПравилоОбъект.ОбменДанными.Загрузка = Истина;
	ПравилоОбъект.УстановитьПометкуУдаления(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставыКонвертаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ГДЕ
	|	СоставыКонвертаций.ЭлементКонвертации = &ЭлементКонвертации
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И НЕ СоставыКонвертаций.ПометкаУдаления
	|	И НЕ СоставыКонвертаций.Отключить";
	Запрос.УстановитьПараметр("ЭлементКонвертации", СтрокаТЧ.Правило1);
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
    Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоставОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СоставОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьСтроку_Изменение(Строка, ОбщиеПеременные)
	Если ТипЗнч(Строка.Правило2) = Тип("Строка") Тогда
		// Это параметр.
		КонвертацияОбъект = ОбщиеПеременные.Конвертация.ПолучитьОбъект();
		СтрТЧ = КонвертацияОбъект.Параметры.Найти(Строка.Правило2, "Параметр");
		Если СтрТЧ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		СтрТЧ.ВременнаяКопия = Ложь;
		КонвертацияОбъект.Записать();
		Возврат;
	КонецЕсли;

	ПравилоНовое = Ложь;
	Если ЗначениеЗаполнено(Строка.Правило1) Тогда
		Если Строка.ПравилоРазделенное И Строка.РежимЗагрузки = 1 Тогда
			ИсключитьПравилоИзСоставаКонвертации(Строка.Правило1, ОбщиеПеременные);
			ПравилоНовое = Истина;
			ПравилоОбъект = Строка.Правило2.Скопировать();
		Иначе
			ПравилоОбъект = Строка.Правило1.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		ПравилоНовое = Истина;
		ПравилоОбъект = Строка.Правило2.Скопировать(); 
		ПравилоОбъект.ВременнаяКопия = Ложь;
	КонецЕсли;
	ПравилоОбъект.ОбменДанными.Загрузка = Истина;
	Если ПравилоНовое Тогда
		ПравилоОбъект.Записать();
		Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ОбщиеПеременные.Конвертация, ПравилоОбъект.Ссылка, Истина);
		Если ТипЗнч(Строка.Правило2) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
			СкопироватьПКС(ПравилоОбъект.Ссылка, Строка.Правило2);
		КонецЕсли;
	Иначе
		ИмяТЧ = "";
		Если ТипЗнч(Строка.Правило2) = Тип("СправочникСсылка.Алгоритмы") Тогда
			СписокКопируемыхСвойств = "Алгоритм, ИспользуетсяПриЗагрузке, Параметры, Экспортный, ЭтоФункция, Комментарий";
		ИначеЕсли ТипЗнч(Строка.Правило2) = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда 
			СписокКопируемыхСвойств = "АлгоритмПриОбработке, АлгоритмВыборкаДанных, ИспользоватьДляОтправки, ИспользоватьДляПолучения, ОбъектВыборки, ОчисткаДанных, СпособВыборки, ПравилоКонвертацииОбъекта";
			ИмяТЧ = "ПравилаКонвертацииОбъектов";
		ИначеЕсли ТипЗнч(Строка.Правило2) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
			СписокКопируемыхСвойств = "АлгоритмПриОтправкеДанных, АлгоритмПередПолучениемДанных, АлгоритмПриПолученииДанных, АлгоритмПослеЗагрузкиВсехДанных," +
			"ВариантИдентификации, ИспользоватьДляОтправки, ИспользоватьДляПолучения, ОбъектКонфигурации, ОбъектСДвижениями, ОбъектФормата," +
			"ПравилоДляГруппыСправочника";
			СкопироватьПКС(Строка.Правило1, Строка.Правило2, Истина);
			ИмяТЧ = "ИдентификацияПоПолямПоиска";
		ИначеЕсли ТипЗнч(Строка.Правило2) = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда
			СписокКопируемыхСвойств = "ОбъектКонфигурации, ОбъектФормата,ИспользоватьДляОтправки, ИспользоватьДляПолучения";
			ИмяТЧ = "СопоставлениеЗначений";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ПравилоОбъект, Строка.Правило2, СписокКопируемыхСвойств);
		Если ИмяТЧ <> "" Тогда
			ПравилоОбъект[ИмяТЧ].Загрузить(Строка.Правило2[ИмяТЧ].Выгрузить());
		КонецЕсли;
		ПравилоОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ИсключитьПравилоИзСоставаКонвертации(Правило, ОбщиеПеременные)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставыКонвертаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ГДЕ
	|	СоставыКонвертаций.ЭлементКонвертации = &ЭлементКонвертации
	|	И СоставыКонвертаций.Владелец = &Конвертация
	|	И НЕ СоставыКонвертаций.ПометкаУдаления
	|	И НЕ СоставыКонвертаций.Отключить";
	Запрос.УстановитьПараметр("ЭлементКонвертации", Правило); 
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СоставОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СоставОбъект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;
КонецПроцедуры

Процедура СкопироватьПКС(НовоеПравило, ИсходноеПравило, УдалятьСуществующие = Ложь)
	Если УдалятьСуществующие Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка
		|ИЗ Справочник.ПравилаКонвертацииСвойств
		|ГДЕ Владелец = &Владелец"; 
		Запрос.УстановитьПараметр("Владелец", НовоеПравило); 
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПКСОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПКСОбъект.ОбменДанными.Загрузка = Истина;
			ПКСОбъект.Удалить();
		КонецЦикла;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ссылка,
	|	Родитель,
	|	ЭтоГруппа
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &Владелец И НЕ ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", ИсходноеПравило);
	ТабПКС = Запрос.Выполнить().Выгрузить(); 
	СоответствиеГрупп = Новый Соответствие;
	Для НомерПрохода = 1 По 2 Цикл
		// В первый проход обрабатываются группы, во второй элементы.	
		Для Каждого СтрокаПКС Из ТабПКС Цикл
			Если НомерПрохода = 1 Тогда
				Если НЕ СтрокаПКС.ЭтоГруппа Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли НомерПрохода = 2 Тогда
				Если СтрокаПКС.ЭтоГруппа Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			// Для ПКО подчиненные ПКС копируются.
			ДубльПКС = СтрокаПКС.Ссылка.Скопировать();
			ДубльПКС.Владелец = НовоеПравило;
			Если ЗначениеЗаполнено(СтрокаПКС.Родитель) Тогда
				ДубльПКС.Родитель = СоответствиеГрупп.Получить(СтрокаПКС.Родитель);
			КонецЕсли;
			ДубльПКС.ОбменДанными.Загрузка = Истина;
			ДубльПКС.Записать();
			Если СтрокаПКС.ЭтоГруппа Тогда
				СоответствиеГрупп.Вставить(СтрокаПКС.Ссылка, ДубльПКС.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Функция НайтиСоздатьТег(ОбщиеПеременные, ТегСтрокой)
	Если ТегСтрокой = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	ТекТегСсылка = Справочники.Теги.НайтиПоНаименованию(ТегСтрокой,,,ОбщиеПеременные.КонфигурацияВладелец);
	Если ЗначениеЗаполнено(ТекТегСсылка) Тогда 
		Возврат ТекТегСсылка;
	КонецЕсли;
	ТекТегОбъект = Справочники.Теги.СоздатьЭлемент();
	ТекТегОбъект.Наименование = ТегСтрокой;
	ТекТегОбъект.Владелец = ОбщиеПеременные.КонфигурацияВладелец;
	ТекТегОбъект.ОбменДанными.загрузка = Истина; 
	ТекТегОбъект.Записать();
	Возврат ТекТегОбъект.Ссылка;
КонецФункции

Процедура ЗагрузитьТегиВПравиле(ТегиСтрокой, ПравилоОбъект, ОбщиеПеременные)
	Если ПустаяСтрока(СокрЛП(ТегиСтрокой)) Тогда
		Если ПравилоОбъект.Теги.Количество() > 0 Тогда
			ПравилоОбъект.Теги.Очистить();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	МассивТеговДляЗагрузки = Новый Массив;
	ТекущийТегМассив = СтрРазделить(ТегиСтрокой, ",");
	Для Каждого ТекТег Из ТекущийТегМассив Цикл
		ТекТегСсылка = НайтиСоздатьТег(ОбщиеПеременные, ТекТег);
		МассивТеговДляЗагрузки.Добавить(ТекТегСсылка);
	КонецЦикла;
	ПравилоОбъект.Теги.Очистить();
	Для Каждого ТекТегСсылка Из МассивТеговДляЗагрузки Цикл
		СтрокаТег = ПравилоОбъект.Теги.Добавить();
		СтрокаТег.Тег = ТекТегСсылка; 
	КонецЦикла;
КонецПроцедуры

Функция ПроверкаЗахвата(ОбщиеПеременные, ИмяПравила, ТекстЗапросаПроверкаЗахвата)
	Если НЕ ОбщиеПеременные.СовместнаяРабота Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ОбщиеПеременные.ИтерацияЗагрузки = 2 Тогда
		// при сравнении захваченные объекты не учитываются.
		Возврат Ложь;
	КонецЕсли;
	Если ОбщиеПеременные.СоздатьНовуюКонвертацию Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроверкаЗахвата;
	Запрос.УстановитьПараметр("Имя", ИмяПравила);
	Запрос.УстановитьПараметр("Конвертация", ОбщиеПеременные.Конвертация);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

Процедура УведомитьОЗахвате(ОбъектМД, ПредставлениеОбъекта)
	КомментВЖурнал = НСтр("ru='Невозможно загрузить %1%: захвачено другим пользователем'");
	КомментВЖурнал = СтрЗаменить(КомментВЖурнал, "%1%", ПредставлениеОбъекта);
	ЗаписьЖурналаРегистрации(НСтр("ru='Загрузка правил конвертации'"), УровеньЖурналаРегистрации.Информация, ОбъектМД, , КомментВЖурнал);
КонецПроцедуры

#КонецОбласти
#КонецЕсли