
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СсылкаНаПравило = ПараметрКоманды;
	ФормаОбъекта = ПараметрыВыполненияКоманды.Источник;
	Отказ = Ложь;
	Обработчики = ПолучитьИменаЭлементовФормы(СсылкаНаПравило, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ИтоговыйТекст = "";
	Для Каждого ИмяЭлемента Из Обработчики Цикл
		ДанныеОбработчика = ФормаОбъекта.Элементы[ИмяЭлемента.Ключ].РасширеннаяПодсказка.Заголовок;
		
		ТХДок = Новый ФорматированныйДокумент;
		ТХДок.УстановитьФорматированнуюСтроку(ДанныеОбработчика);
		ЛокальныйТекст = "";
		Вложения = Новый Структура;
		ТХДок.ПолучитьHTML(ЛокальныйТекст, Вложения);
		ЛокальныйТекст = СтрЗаменить(ЛокальныйТекст, "<body>", "");
		ЛокальныйТекст = СтрЗаменить(ЛокальныйТекст, "</body>", "");
		ИтоговыйТекст = ИтоговыйТекст + ЛокальныйТекст + "<br>";
	КонецЦикла;
	ИтоговыйТекст = "<body>" + ИтоговыйТекст + "</body>";
	ТХДок = Новый ФорматированныйДокумент;
	ТХДок.УстановитьHTML(ИтоговыйТекст, Вложения);
	ОткрытьФорму("ОбщаяФорма.ИнформацияОбОбработчиках", Новый Структура("Информация", ТХДок), ФормаОбъекта, СсылкаНаПравило); 
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаЭлементовФормы(СсылкаНаПравило, Отказ)
	ТипОбъекта = ТипЗнч(СсылкаНаПравило);
	ТипКонвертации = Неопределено;
	Если ТипОбъекта <> Тип("СправочникСсылка.ПравилаРегистрацииОбъектов") Тогда
		Если ТипОбъекта = Тип("СправочникСсылка.ПравилаКонвертацииСвойств") Тогда
			ТипКонвертации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПравило.Владелец, "ТипКонвертации");
		Иначе
			ТипКонвертации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПравило, "ТипКонвертации");
		КонецЕсли;
	КонецЕсли;
	Обработчики = Новый Соответствие;
	Если ТипОбъекта = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO Тогда
			Обработчики.Вставить("ИмяОбработчикаПриОбработке");
			Обработчики.Вставить("ИмяОбработчикаВыборкаДанных");
		Иначе
			Обработчики.Вставить("ИмяОбработчикаПередОбработкой");
			Обработчики.Вставить("ИмяОбработчикаПередВыгрузкой"); 
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузки");
			Обработчики.Вставить("ИмяОбработчикаПослеОбработки");
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO Тогда
			Обработчики.Вставить("ИмяОбработчикаПриОтправке");
			Обработчики.Вставить("ИмяОбработчикаПередПолучением");
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузки");
			Обработчики.Вставить("АлгоритмПослеЗагрузкиВсехДанных");
		Иначе
			Обработчики.Вставить("ИмяОбработчикаПередВыгрузкой");
			Обработчики.Вставить("ИмяОбработчикаПриВыгрузке"); 
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузки");
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузкиВФайл");
			Обработчики.Вставить("ИмяОбработчикаПоляПоиска");
			Обработчики.Вставить("ИмяОбработчикаПередЗагрузкой");
			Обработчики.Вставить("ИмяОбработчикаПриЗагрузке");
			Обработчики.Вставить("ИмяОбработчикаПослеЗагрузки"); 
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
			Обработчики.Вставить("ИмяОбработчикаПередВыгрузкой");
			Обработчики.Вставить("ИмяОбработчикаПриВыгрузке"); 
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузки");
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузкиВФайл");
			Обработчики.Вставить("ИмяОбработчикаПередЗагрузкой");
			Обработчики.Вставить("ИмяОбработчикаПриЗагрузке");
			Обработчики.Вставить("ИмяОбработчикаПослеЗагрузки"); 
		Иначе
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПравилаКонвертацииСвойств") Тогда
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
			// Дублирование для соблюдения порядка обработчиков в ПКГС
			Если СсылкаНаПравило.ЭтоГруппа Тогда
				Обработчики.Вставить("ИмяОбработчикаПередОбработкой");
				Обработчики.Вставить("ИмяОбработчикаПередВыгрузкой");
				Обработчики.Вставить("ИмяОбработчикаПриВыгрузке"); 
				Обработчики.Вставить("ИмяОбработчикаПослеВыгрузки");
				Обработчики.Вставить("ИмяОбработчикаПослеОбработки");
			Иначе
				Обработчики.Вставить("ИмяОбработчикаПередВыгрузкой");
				Обработчики.Вставить("ИмяОбработчикаПриВыгрузке"); 
				Обработчики.Вставить("ИмяОбработчикаПослеВыгрузки");
			КонецЕсли;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Конвертации") Тогда
		Если ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO Тогда
			Обработчики.Вставить("ИмяОбработчикаПередКонвертацией");
			Обработчики.Вставить("ИмяОбработчикаПередОтложеннымЗаполнением"); 
			Обработчики.Вставить("ИмяОбработчикаПослеКонвертации");
		Иначе
			Обработчики.Вставить("ИмяОбработчикаПослеЗагрузкиПравилОбмена");
			Обработчики.Вставить("ИмяОбработчикаПередВыгрузкойДанных");
			Обработчики.Вставить("ИмяОбработчикаПередПолучениемИзмененных");
			Обработчики.Вставить("ИмяОбработчикаПередОтправкойУдаления");
			Обработчики.Вставить("ИмяОбработчикаПередКонвертациейОбъекта");
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузкиОбъекта");
			Обработчики.Вставить("ИмяОбработчикаПослеВыгрузкиДанных");
			Обработчики.Вставить("ИмяОбработчикаПередЗагрузкойДанных");
			Обработчики.Вставить("ИмяОбработчикаПослеЗагрузкиПараметров");
			Обработчики.Вставить("ИмяОбработчикаПослеПолученияУзловОбмена");
			Обработчики.Вставить("ИмяОбработчикаПередЗагрузкойОбъекта");
			Обработчики.Вставить("ИмяОбработчикаПриПолученииУдаления");
			Обработчики.Вставить("ИмяОбработчикаПослеЗагрузкиОбъекта");
			Обработчики.Вставить("ИмяОбработчикаПослеЗагрузкиДанных");
		КонецЕсли;
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ПравилаРегистрацииОбъектов") Тогда
		Обработчики.Вставить("АлгоритмПередОбработкойПравила");
		Обработчики.Вставить("АлгоритмПриОбработкеПравила");
		Обработчики.Вставить("АлгоритмПриОбработкеДополнительныйПравила");
		Обработчики.Вставить("АлгоритмПослеОбработкиПравила");
	КонецЕсли;
	Возврат Обработчики;
КонецФункции
