#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Копирование дерева значений. 
	ТаблицаРасхожденийИсходная = Параметры.ТаблицаРасхождений.Получить();
	ВыбранныеРанееРасхождения = Неопределено;
	Если Параметры.ВыбранныеРасхождения <> Неопределено Тогда
		ВыбранныеРанееРасхождения = Параметры.ВыбранныеРасхождения.Получить();
	КонецЕсли;
	Уровень0_Источник = ТаблицаРасхожденийИсходная.Строки;
	Уровень0_Получатель = ТаблицаРасхождений.ПолучитьЭлементы();
	МассивИдентификаторов = Новый Массив;
	СкопироватьСтрокиДерева(Уровень0_Получатель, Уровень0_Источник); 
	ВыбранныеРанееРасхождения = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
	СтрокиУровня0 = ТаблицаРасхождений.ПолучитьЭлементы();
	Для Сч = 1 По СтрокиУровня0.Количество() Цикл
		ИдСтроки = СтрокиУровня0[Сч-1].ПолучитьИдентификатор();
		Элементы.ТаблицаРасхождений.Развернуть(ИдСтроки, Истина);
	КонецЦикла;
	Элементы.ПросмотрРасхожденийИзменениеВарианта.Заголовок = "Отображать расхождения с помощью ExamDiff";
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	УдалитьВременныеФайлыНаКлиенте();
	Если ВариантПросмотраРасхождений = 0 Тогда
		УдалитьВременныеФайлыНаСервере(); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Результат = ЗаполнитьРезультатНаСервере();
	Закрыть(Результат);

КонецПроцедуры
&НаКлиенте
Процедура РежимЗагрузкиОбщий(Команда) 
	ИзменитьРежимЗагрузкиДляОтмеченных(0);
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Команда)
	ИзменитьПометкиСтрок(Истина);
КонецПроцедуры 

&НаКлиенте
Процедура СнятьВсе(Команда)
	ИзменитьПометкиСтрок(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РазличияТекущейСтроки(Команда)
	ТекСтрока = Элементы.ТаблицаРасхождений.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Правило1) Или НЕ ЗначениеЗаполнено(ТекСтрока.Правило2) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Невозможно сравнить правила текущей строки. Одно из правил пустое'"));
		Возврат;
	КонецЕсли;
	Если ВариантПросмотраРасхождений = 0 Тогда
		Если НЕ ЗначениеЗаполнено(ВладелецФайлов) Тогда 
			НайтиСоздатьВладельцаФайлов();
		КонецЕсли;
		УдалитьВременныеФайлыНаСервере();  
	Иначе
		УдалитьВременныеФайлыНаКлиенте();
	КонецЕсли;
	ТХДок1 = ПолучитьТекстПравила(ТекСтрока.Правило1);
	Если ТХДок1 = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Невозможно сравнить правила текущей строки. Одно из правил пустое'"));
	КонецЕсли;  
	ТХДок2 = ПолучитьТекстПравила(ТекСтрока.Правило2);
	Если ТХДок2 = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Невозможно сравнить правила текущей строки. Одно из правил пустое'"));
	КонецЕсли;
	Если ВариантПросмотраРасхождений = 0 Тогда
		ПараметрыСравнения = Новый Структура;
		ПараметрыСравнения.Вставить("ТекстДляСравнения1", ТХДок1.ПолучитьТекст());
		ПараметрыСравнения.Вставить("ОписаниеТекста1", НСтр("ru = 'Существующее'"));
		ПараметрыСравнения.Вставить("ТекстДляСравнения2", ТХДок2.ПолучитьТекст());
		ПараметрыСравнения.Вставить("ОписаниеТекста2", НСтр("ru = 'Загружаемое'"));
		ПараметрыСравнения.Вставить("ВыполнитьСравнениеДвухТекстов", Истина);
		КаталогРедактора = "";
		ПараметрыСравнения.Вставить("ЕстьКешФайловРедактора", Ложь);
		ПараметрыСравнения.Вставить("КаталогРедактора", "");
		ОткрытьФорму("ОбщаяФорма.СравнениеТекстов", ПараметрыСравнения, ,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		#Если НЕ ВебКлиент Тогда
		ПервыйФайлСтрокой = ПолучитьИмяВременногоФайла("txt");
		ДобавитьПрефиксВИмяФайла(ПервыйФайлСтрокой, "Существующее");
		ВторойФайлСтрокой = ПолучитьИмяВременногоФайла("txt");
		ДобавитьПрефиксВИмяФайла(ВторойФайлСтрокой, "Загружаемое");
		ТХДок1.Записать(ПервыйФайлСтрокой, "windows-1251");
		ТХДок2.Записать(ВторойФайлСтрокой, "windows-1251");
		ЗапуститьКомандуСравненияФайлов();
		#КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимЗагрузкиОбособленный(Команда) 
	ИзменитьРежимЗагрузкиДляОтмеченных(1);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрРасхожденийИзменениеВарианта(Команда)
	Если ВариантПросмотраРасхождений = 0 Тогда
		ВариантПросмотраРасхождений = 1;
		Элементы.ПросмотрРасхожденийИзменениеВарианта.Заголовок = "Отображать расхождения средствами БСП";
	Иначе
		Элементы.ПросмотрРасхожденийИзменениеВарианта.Заголовок = "Отображать расхождения с помощью ExamDiff";
		ВариантПросмотраРасхождений = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСписок(Команда)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Фильтр = НСтр("ru = 'Сжатая ZIP-папка'") + " (*.zip)|*.zip";   
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьСохранениеВАрхив", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОписаниеОповещения, ДиалогВыбора);	

КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ТаблицаРасхожденийПометкаПриИзменении(Элемент)
	Если Элементы.ТаблицаРасхождений.ТекущиеДанные.ПравилоЗахвачено И Элементы.ТаблицаРасхождений.ТекущиеДанные.Пометка Тогда
		Элементы.ТаблицаРасхождений.ТекущиеДанные.Пометка = Ложь;
		Возврат;
	КонецЕсли;
	
	ЗначениеФлага = Элементы.ТаблицаРасхождений.ТекущиеДанные.Пометка;
	Для Каждого ТекСтрока Из Элементы.ТаблицаРасхождений.ТекущиеДанные.ПолучитьЭлементы() Цикл
		Если ЗначениеФлага И ТекСтрока.ПравилоЗахвачено Тогда
			ТекСтрока.Пометка = Ложь;
			Продолжить;
		КонецЕсли;
		ТекСтрока.Пометка = ЗначениеФлага;
	КонецЦикла;
КонецПроцедуры
&НаКлиенте
Процедура ТаблицаРасхожденийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Если Поле.Имя = "ТаблицаРасхожденийРежимЗагрузки" Тогда
		ТекСтрока = Элементы.ТаблицаРасхождений.ТекущиеДанные;  
		Если ТекСтрока.ПравилоРазделенное Тогда
			Если ТекСтрока.РежимЗагрузки = 1 Тогда 
				ТекСтрока.РежимЗагрузки = 0;
			Иначе
				ТекСтрока.РежимЗагрузки = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьРежимЗагрузкиДляОтмеченных(НовыйРежимЗагрузки, СтрокаДереваРодитель = Неопределено)
	Если СтрокаДереваРодитель = Неопределено Тогда
		ПодчиненныеСтроки = ТаблицаРасхождений.ПолучитьЭлементы();
	Иначе
		ПодчиненныеСтроки = СтрокаДереваРодитель.ПолучитьЭлементы();
	КонецЕсли; 
	Для Каждого СтрокаДерева Из ПодчиненныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаДерева.Правило2) Тогда
			Если СтрокаДерева.Пометка = Истина И СтрокаДерева.ПравилоРазделенное = Истина И СтрокаДерева.РежимЗагрузки <> НовыйРежимЗагрузки Тогда 
				СтрокаДерева.РежимЗагрузки = НовыйРежимЗагрузки;
			КонецЕсли;
		Иначе
			ИзменитьРежимЗагрузкиДляОтмеченных(НовыйРежимЗагрузки, СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокиДерева(Узел_Получатель, Узел_Источник)
	Для Сч = 1 По Узел_Источник.Количество() Цикл
		Стр_Источник = Узел_Источник[Сч-1];
		Стр_Получатель = Узел_Получатель.Добавить();
		ЗаполнитьЗначенияСвойств(Стр_Получатель, Стр_Источник);
		Если ВыбранныеРанееРасхождения <> Неопределено Тогда
			МасСтроки = ВыбранныеРанееРасхождения.НайтиСтроки(Новый Структура("Правило1, Правило2", Стр_Получатель.Правило1, Стр_Получатель.Правило2));
			Если МасСтроки.Количество() > 0 Тогда
				Стр_Получатель.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
		СкопироватьСтрокиДерева(Стр_Получатель.ПолучитьЭлементы(), Стр_Источник.Строки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометкиСтрок(НоваяПометка)
	Если Элементы.ТаблицаРасхождений.ВыделенныеСтроки.Количество() > 1 Тогда
		Для Каждого ИдСтроки Из Элементы.ТаблицаРасхождений.ВыделенныеСтроки Цикл
			ТекСтрока = ТаблицаРасхождений.НайтиПоИдентификатору(ИдСтроки);
			Если НоваяПометка И ТекСтрока.ПравилоЗахвачено Тогда
				Продолжить;
			КонецЕсли;
			ТекСтрока.Пометка = НоваяПометка;
		КонецЦикла;
	Иначе
		ТекСтрока = Элементы.ТаблицаРасхождений.ТекущиеДанные;
		Если НоваяПометка И ТекСтрока.ПравилоЗахвачено Тогда
			Возврат;
		КонецЕсли;
		ТекСтрока.Пометка = НоваяПометка;
		СтрокиПодчиненные = ТекСтрока.ПолучитьЭлементы();
		Для Каждого СтрокаПодчиненная Из СтрокиПодчиненные Цикл  
			Если НоваяПометка И СтрокаПодчиненная.ПравилоЗахвачено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаПодчиненная.Пометка = НоваяПометка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРезультатНаСервере()
	Результат = Новый Структура();
	ТаблицаПравил = Новый ТаблицаЗначений;
	ТаблицаПравил.Колонки.Добавить("Правило1");
	ТаблицаПравил.Колонки.Добавить("Правило2");
	ТаблицаПравил.Колонки.Добавить("РежимЗагрузки");
	ТаблицаПравил.Колонки.Добавить("ПравилоРазделенное");
	ТаблицаПравил.Колонки.Добавить("ПравилоЗахвачено");
	ЗаписатьОтмеченныеСтроки(ТаблицаПравил);
	Результат.Вставить("ТаблицаПравил", Новый ХранилищеЗначения(ТаблицаПравил));

	Если ТаблицаПравил.Количество() > 0 Тогда
		Результат.Вставить("ОписаниеРезультата", "Выбраны правила для загрузки, количество: " + ТаблицаПравил.Количество()); 
		Результат.Вставить("ПравилаВыбраны", Истина);

	Иначе
		Результат.Вставить("ОписаниеРезультата", "Правила для загрузки не выбраны");
		Результат.Вставить("ПравилаВыбраны", Ложь);
	КонецЕсли;
    Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаписатьОтмеченныеСтроки(ТаблицаПравил, СтрокаДереваРодитель = Неопределено)
	Если СтрокаДереваРодитель = Неопределено Тогда
		НомерУровня = 0;
		ПодчиненныеСтроки = ТаблицаРасхождений.ПолучитьЭлементы();
	Иначе
		ПодчиненныеСтроки = СтрокаДереваРодитель.ПолучитьЭлементы();
		НомерУровня = 1;
	КонецЕсли; 
	Для Каждого СтрокаДерева Из ПодчиненныеСтроки Цикл
		Если НомерУровня = 0 Тогда
			ЗаписатьОтмеченныеСтроки(ТаблицаПравил, СтрокаДерева); 
			Продолжить;
		КонецЕсли;
		Если СтрокаДерева.Пометка = Истина Тогда
			НовСтрока = ТаблицаПравил.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДерева, "Правило1, Правило2,РежимЗагрузки,ПравилоРазделенное");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстПравила(ТекПравило)
	Если НЕ ЗначениеЗаполнено(ТекПравило) Или ТипЗнч(ТекПравило) = Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	ОбрОбъект = Обработки.ВыгрузкаМодуля.Создать();
	Возврат ОбрОбъект.СформироватьТекстПравила(Новый Структура("Правило, Конвертация", ТекПравило, Объект.Конвертация));
КонецФункции

&НаСервере
Процедура УдалитьВременныеФайлыНаСервере()
	Если ЗначениеЗаполнено(ПервыйФайл) Тогда
		ПервыйФайлОбъект = ПервыйФайл.ПолучитьОбъект();
		Попытка
			ПервыйФайлОбъект.Удалить();
		Исключение
		КонецПопытки;
		ПервыйФайл = Неопределено;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВторойФайл) Тогда 
		ВторойФайлОбъект = ВторойФайл.ПолучитьОбъект();

		Попытка
			ВторойФайлОбъект.Удалить();
		Исключение
		КонецПопытки;
		ВторойФайл = Неопределено;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура УдалитьВременныеФайлыНаКлиенте()
	Если ЗначениеЗаполнено(ПервыйФайлСтрокой) Тогда
		Попытка
			УдалитьФайлы(ПервыйФайлСтрокой);
		Исключение
		КонецПопытки;
		ПервыйФайлСтрокой = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(ВторойФайлСтрокой) Тогда 
		Попытка
			УдалитьФайлы(ВторойФайлСтрокой);
		Исключение
		КонецПопытки;
		ВторойФайлСтрокой = "";
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура НайтиСоздатьВладельцаФайлов() 
	ВладелецФайлов = Справочники.ПапкиФайлов.НайтиПоНаименованию("Служебный (сравнение правил)"); 
	Если ЗначениеЗаполнено(ВладелецФайлов) Тогда
		Возврат;
	КонецЕсли; 
	ВладелецФайловОбъект = Справочники.ПапкиФайлов.СоздатьЭлемент();
	ВладелецФайловОбъект.Наименование = "Служебный (сравнение правил)";
	ВладелецФайловОбъект.Описание = "Для хранения файлов, содержащих загружаемые правила"; 
	ВладелецФайловОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	ВладелецФайловОбъект.Записать();
	ВладелецФайлов = ВладелецФайловОбъект.Ссылка;
КонецПроцедуры

Процедура ДобавитьПрефиксВИмяФайла(ВремФайлСтрокой, ПрефиксИмениФайла)
	РазделительПути = ПолучитьРазделительПути();
	ПозицияТочки = СтрНайти(ВремФайлСтрокой, ".",НаправлениеПоиска.СКонца);
	ПозицияРазделителя = СтрНайти(ВремФайлСтрокой, РазделительПути,НаправлениеПоиска.СКонца);
	ИмяФайлаБезПути = Сред(ВремФайлСтрокой,ПозицияРазделителя + 1, СтрДлина(ВремФайлСтрокой) - ПозицияТочки - 1);
	ВремФайлСтрокой = СтрЗаменить(ВремФайлСтрокой, ИмяФайлаБезПути, ПрефиксИмениФайла + "_" + ИмяФайлаБезПути);
КонецПроцедуры

&НаСервере
Процедура ЗапуститьКомандуСравненияФайлов()
	ФайлКоманды = Новый ТекстовыйДокумент; 
	ФайлКомандыБат = ПолучитьИмяВременногоФайла(".bat");
	СтрокаКоманды = "start ""ExamDiff"" /B ""C:\Program Files (x86)\ExamDiff\ExamDiff.exe"" %1 %2 /w /t /n ";
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%1", СокрЛП(ПервыйФайлСтрокой));
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды, "%2", СокрЛП(ВторойФайлСтрокой)); 
	ФайлКоманды.ДобавитьСтроку("@ECHO OFF");
	ФайлКоманды.ДобавитьСтроку(СтрокаКоманды);

	ФайлКоманды.Записать(ФайлКомандыБат, КодировкаТекста.OEM);
	КодВозврата = 0;
	ТекстОшибки = "";
	Попытка
	ЗапуститьПриложение(ФайлКомандыБат, , Истина, КодВозврата);
	Исключение 
	ТекстОшибки = ОписаниеОшибки();
	КонецПопытки; 

	Попытка
		УдалитьФайлы(ФайлКомандыБат);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСохранениеВАрхив(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТХДок1 = Новый ТекстовыйДокумент;
	ТХДок2 = Новый ТекстовыйДокумент;
	УровеньДерева0 = ТаблицаРасхождений.ПолучитьЭлементы();
	Для Каждого СтрокаУровень0 Из УровеньДерева0 Цикл
		УровеньДерева1 = СтрокаУровень0.ПолучитьЭлементы();
		Для Каждого СтрокаУровень1 Из УровеньДерева1 Цикл
			Если НЕ СтрокаУровень1.Пометка Тогда
				Продолжить;
			КонецЕсли;
			ТХДокЛок1 = ПолучитьТекстПравила(СтрокаУровень1.Правило1);
			ТХДокЛок2 = ПолучитьТекстПравила(СтрокаУровень1.Правило2);
			Если ТХДокЛок1 <> Неопределено Тогда
				ТХДок1.ДобавитьСтроку(ТХДокЛок1.ПолучитьТекст());
			КонецЕсли;
			Если ТХДокЛок2 <> Неопределено Тогда
				ТХДок2.ДобавитьСтроку(ТХДокЛок2.ПолучитьТекст());
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если ТХДок2.КоличествоСтрок() = 0 И ТХДок1.КоличествоСтрок() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Список для сохранения пуст. Возможно не установлены пометки в списке правил.'"));
		Возврат;
	КонецЕсли;
	#Если НЕ ВебКлиент Тогда
	СтрокаКомментарийКСохранению = "";
	ВвестиСтроку(СтрокаКомментарийКСохранению, НСтр("ru='Комментарий к архиву'"),, Истина);
	ИмяФайла1 = КаталогВременныхФайлов() + "\МодульИсходный.txt";  
	ИмяФайла2 = КаталогВременныхФайлов() + "\МодульЗагружаемый.txt";
	ИмяФайла3 = КаталогВременныхФайлов() + "\Комментарий.txt";
	ЗаписьZIP = Новый ЗаписьZIPФайла(ВыбранныеФайлы[0]);
	ТХДок1.Записать(ИмяФайла1, "windows-1251");
	ТХДок2.Записать(ИмяФайла2, "windows-1251");
	ЗаписьZIP.Добавить(ИмяФайла1, РежимСохраненияПутейZIP.НеСохранятьПути);
	ЗаписьZIP.Добавить(ИмяФайла2, РежимСохраненияПутейZIP.НеСохранятьПути);
	Если ЗначениеЗаполнено(СтрокаКомментарийКСохранению) Тогда
		ТХДок3 = Новый ТекстовыйДокумент;
		ТХДок3.ДобавитьСтроку(СтрокаКомментарийКСохранению);
		ТХДок3.Записать(ИмяФайла3, "UTF-8");
		ЗаписьZIP.Добавить(ИмяФайла3, РежимСохраненияПутейZIP.НеСохранятьПути);
	КонецЕсли;
	ЗаписьZIP.Записать();
	
	Попытка
		УдалитьФайлы(ИмяФайла1);
	Исключение
	КонецПопытки;
	Попытка
		УдалитьФайлы(ИмяФайла2);
	Исключение
	КонецПопытки;
	Если НЕ ЗначениеЗаполнено(СтрокаКомментарийКСохранению) Тогда
		Возврат;
	КонецЕсли;
	Попытка
		УдалитьФайлы(ИмяФайла3);
	Исключение
	КонецПопытки;
	#КонецЕсли
КонецПроцедуры


#КонецОбласти