#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// Синхронизация признака Расширение у подчиненных версий формата.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка
	|ИЗ Справочник.ВерсииФормата
	|ГДЕ Родитель = &Родитель И Расширение <> &Расширение И ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("Родитель", Ссылка);
	Запрос.УстановитьПараметр("Расширение", Расширение);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВерсияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ВерсияОбъект.Расширение = Расширение;
		Попытка
			ВерсияОбъект.Записать();
		Исключение
			ВерсияОбъект = Неопределено;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецЕсли