#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("парКонвертация") Тогда
		Объект.Конвертация = Параметры.парКонвертация;
	КонецЕсли;
	Элементы.ПоказатьОшибки.Видимость = Ложь;
	Элементы.ПоСостояниюХранилища.Видимость = Константы.СовместнаяРабота.Получить();
	Элементы.МеждународнаяКонвертация.Доступность = Ложь;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	СтрокиДерева = Объект.ДеревоКонвертаций.ПолучитьЭлементы();
	СтрокиДерева.Очистить();
	НовСтрока = СтрокиДерева.Добавить();
	НовСтрока.Конвертация = Объект.Конвертация;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указана конвертация'"));
		Возврат;
	КонецЕсли;
	Элементы.ПоказатьОшибки.Видимость = Ложь;
	ИмяФайлаДляСохранения = "";
	ТХ = ВыгрузитьМодулиСервер(ИмяФайлаДляСохранения);
	ПроверитьВложенныеТэгиЛокализации(ТХ);
	Если ЗначениеЗаполнено(ИмяФайлаДляСохранения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Модуль сохранен в файл'") + ": " + ИмяФайлаДляСохранения);
	Иначе
		КонвертацияДанныхXDTOКлиент.ВывестиТекстДляИспользования(ТХ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВложенныеТэгиЛокализации(Текст)
		
	Уровень = 0;
	ОткрывающиеТэги = Новый Соответствие;
	
	ТабИтог.Очистить();
	
	Для Сч = 1 По Текст.КоличествоСтрок() Цикл
		
		Строка = Текст.ПолучитьСтроку(Сч);
				
		Если СтрНайти(НРег(Строка), "локализация") И СтрНайти(Строка, "++") Тогда
			Уровень = Уровень + 1;
			ОткрывающиеТэги.Вставить(Уровень, Сч);
		КонецЕсли;
		
		Если СтрНайти(НРег(Строка), "локализация") И СтрНайти(Строка, "--") Тогда
			
			Если Уровень > 1 Тогда
				НовСтрока = ТабИтог.Добавить();
				НовСтрока.Начало = ОткрывающиеТэги.Получить(Уровень);
				Новстрока.Конец = Сч;
			КонецЕсли;
			
			Уровень = Уровень - 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабИтог.Сортировать("Начало");
	
	ШаблонОшибки = "Вложенные теги локализации. Строки %1-%2";

	Для Каждого Строка Из ТабИтог Цикл
		Ошибка = СтрШаблон(ШаблонОшибки, Строка.Начало, Строка.Конец);
		Сообщить(Ошибка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибки(Команда)
	ТабДок = СформироватьОтчетОбОшибках();
	ТабДок.Показать("Ошибки");
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьМодулиСервер(ИмяФайлаДляСохранения)
	ИмяФайлаДляСохранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ИмяФайлаДляСохранения");
	
	ЗаполнитьЛокализуемыеЭлементы();
	ВыполнитьАнализДереваКонвертаций();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	Результат = ОбработкаОбъект.ВыполнитьВыгрузкуМодулей();
	Если ЗначениеЗаполнено(ИмяФайлаДляСохранения) Тогда
		Результат.Записать(ИмяФайлаДляСохранения);
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Функция СформироватьОтчетОбОшибках()
	// Формируем отчет
	ТабДок = Новый ТабличныйДокумент;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МакетОшибки = ОбработкаОбъект.ПолучитьМакет("ОтчетОшибки");
	ОбластьШапка = МакетОшибки.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого СтрТаб Из Объект.ТаблицаСопоставленияКонвертаций Цикл
		Если СтрТаб.ЕстьПроблемы Тогда
			ОбластьСтрока = МакетОшибки.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(СтрТаб);
			ТабДок.Вывести(ОбластьСтрока);
		КонецЕсли;
	КонецЦикла;
	Возврат ТабДок;
КонецФункции

&НаСервере
Процедура ЗаполнитьЛокализуемыеЭлементы()
	Объект.ТаблицаЛокализуемыхЭлементов.Очистить();
	
	Если Не Объект.ИсключатьОбъектыМеждународнойКонфигурации Или Не ЗначениеЗаполнено(Объект.МеждународнаяКонвертация) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	СоставыКонвертаций.ЭлементКонвертации КАК ЭлементКонвертации
		|ПОМЕСТИТЬ ВТ_МеждународныеЭлементыКонвертации
		|ИЗ
		|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
		|ГДЕ
		|	СоставыКонвертаций.Владелец = &МеждународнаяКонвертация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставыКонвертаций.ЭлементКонвертации КАК ЭлементКонвертации
		|ИЗ
		|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
		|ГДЕ
		|	СоставыКонвертаций.Владелец = &Конвертация
		|	И НЕ СоставыКонвертаций.ЭлементКонвертации В
		|				(ВЫБРАТЬ
		|					ВТ_МеждународныеЭлементыКонвертации.ЭлементКонвертации
		|				ИЗ
		|					ВТ_МеждународныеЭлементыКонвертации КАК ВТ_МеждународныеЭлементыКонвертации)");
	Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
	Запрос.УстановитьПараметр("МеждународнаяКонвертация", Объект.МеждународнаяКонвертация);
	
	Объект.ТаблицаЛокализуемыхЭлементов.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАнализДереваКонвертаций()
	Объект.ТаблицаСопоставленияКонвертаций.Очистить();
	ОбработатьЭлементыКонвертаций();
КонецПроцедуры

&НаСервере
Процедура ОбработатьЭлементыКонвертаций()
	СтрокиДЗ = Объект.ДеревоКонвертаций.ПолучитьЭлементы();
	Если СтрокиДЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ГлавнаяКонвертация = СтрокиДЗ[0].Конвертация;
	ОбработатьЭлементыДляКонвертации(ГлавнаяКонвертация, "ЕстьГК", "СсылкаГК", Неопределено, Ложь);
	// Конвертации уровня 1
	СтрокиУ1 = СтрокиДЗ[0].ПолучитьЭлементы();
	Для Каждого СтрокаУ1 Из СтрокиУ1 Цикл
		ОбработатьЭлементыДляКонвертации(СтрокаУ1.Конвертация, "ЕстьПК", "СсылкаПК", СтрокаУ1.Конвертация, Истина);
		// Конвертации уровня 2
		СтрокиУ2 = СтрокаУ1.ПолучитьЭлементы();
		Для Каждого СтрокаУ2 Из СтрокиУ2 Цикл
			ОбработатьЭлементыДляКонвертации(СтрокаУ2.Конвертация, "ЕстьПК2", "СсылкаПК2", СтрокаУ1.Конвертация, Истина);
		КонецЦикла;
	КонецЦикла;
	// Обработка таблицы - анализ проблем
	Для Каждого СтрТаб Из Объект.ТаблицаСопоставленияКонвертаций Цикл
		Если Объект.АнализУТБ И СтрТаб.ЕстьГК <> СтрТаб.ЕстьПК Тогда
			СтрТаб.ЕстьПроблемы = Истина;
			СтрТаб.ОписаниеПроблемы = НСтр("ru='Отличается состав ГК и ПК'");
			Продолжить;
		КонецЕсли;
		Если СтрТаб.ЕстьГК>0 И СтрТаб.ЕстьПК=0 И СтрТаб.ЕстьПК2=0 Тогда
			// Есть только в ГК - ОК
			Продолжить;
		ИначеЕсли СтрТаб.ЕстьГК=0 И СтрТаб.ЕстьПК=0 И СтрТаб.ЕстьПК2>0 Тогда
			СтрТаб.ЕстьПроблемы = Истина;
			СтрТаб.ОписаниеПроблемы = НСтр("ru='Есть только в ПК2'");
		ИначеЕсли СтрТаб.ЕстьГК=0 И СтрТаб.ЕстьПК>0 Тогда
			СтрТаб.ЕстьПроблемы = Истина;
			СтрТаб.ОписаниеПроблемы = НСтр("ru='Есть в ПК и нет в ГК'");
		ИначеЕсли СтрТаб.ЕстьГК>0 И СтрТаб.ЕстьПК>0 И СтрТаб.ЕстьПК2=0 Тогда
			// Есть в 2-х конвертациях и ссылки одинаковые
			Если СтрТаб.СсылкаГК = СтрТаб.СсылкаПК Тогда
				Продолжить;
			КонецЕсли;
			СравнитьЭлементыКонвертации(СтрТаб, СтрТаб.СсылкаГК, СтрТаб.СсылкаПК);
			СтрТаб.ЕстьПК=2;
		ИначеЕсли СтрТаб.ЕстьГК>0 И СтрТаб.ЕстьПК>0 И СтрТаб.ЕстьПК2>0 Тогда
			Если СтрТаб.СсылкаГК = СтрТаб.СсылкаПК
				И СтрТаб.СсылкаГК = СтрТаб.СсылкаПК2 Тогда
				Продолжить;
			Иначе
				ОписаниеПроблемы = "";
				Если СтрТаб.СсылкаГК <> СтрТаб.СсылкаПК Тогда
					СравнитьЭлементыКонвертации(СтрТаб, СтрТаб.СсылкаГК, СтрТаб.СсылкаПК);
					Если СтрТаб.СсылкаПК = СтрТаб.СсылкаПК2 Тогда
						// Проблемы ограничиваются парой ГК - ПК
						Продолжить;
					КонецЕсли;
					СтрТаб.ЕстьПК = 2;
					ОписаниеПроблемы = СтрТаб.ОписаниеПроблемы + НСтр("ru='(ГК и ПК)'");
				КонецЕсли;
				Если СтрТаб.СсылкаПК <> СтрТаб.СсылкаПК2 Тогда
					СравнитьЭлементыКонвертации(СтрТаб, СтрТаб.СсылкаПК, СтрТаб.СсылкаПК2);
					
					СтрТаб.ОписаниеПроблемы = ОписаниеПроблемы + ?(ОписаниеПроблемы = "","","; ") + СтрТаб.ОписаниеПроблемы + НСтр("ru='(ПК и ПК2)'");
					ОписаниеПроблемы = СтрТаб.ОписаниеПроблемы;
					СтрТаб.ЕстьПК2 = СтрТаб.ЕстьПК + 1;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрТаб.ЕстьГК>0 И СтрТаб.ЕстьПК=0 И СтрТаб.ЕстьПК2>0 Тогда
			СтрТаб.ЕстьПроблемы = Истина;
			ОписаниеПроблемы = НСтр("ru='Есть в ГК и в ПК2, нет в ПК'");
			Если СтрТаб.СсылкаГК <> СтрТаб.СсылкаПК2 Тогда
				СравнитьЭлементыКонвертации(СтрТаб, СтрТаб.СсылкаГК, СтрТаб.СсылкаПК2);
				СтрТаб.ОписаниеПроблемы = ОписаниеПроблемы + "; " + СтрТаб.ОписаниеПроблемы;
				СтрТаб.ЕстьПК2 = 2;
			Иначе
				СтрТаб.ОписаниеПроблемы = ОписаниеПроблемы;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработатьЭлементыДляКонвертации(ТекКонвертация, ИмяКолонкиЕсть, ИмяКолонкиСсылка, ТекПК, ВыполнятьПоиск)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭлементКонвертации.Ссылка КАК Ссылка,
	|	ЭлементКонвертации.Ссылка.Захвачен КАК Захвачен,
	|	ЭлементКонвертации.Ссылка.Копия КАК Копия,
	|	ЭлементКонвертации.Ссылка КАК " + ИмяКолонкиСсылка + ",
	|	1 КАК " + ИмяКолонкиЕсть + ",
	|	ВЫБОР КОГДА ЭлементКонвертации ССЫЛКА Справочник.ПравилаОбработкиДанных ТОГДА
	|		ЭлементКонвертации.Наименование
	|	ИНАЧЕ 
	|		ЭлементКонвертации.Код
	|	КОНЕЦ КАК НаименованиеЭлементаКонвертации
	|ИЗ Справочник.СоставыКонвертаций КАК Состав
	|ГДЕ Владелец = &Конвертация И НЕ ПометкаУдаления И НЕ Отключить И ЭлементКонвертации.Ссылка is not null";
	Запрос.УстановитьПараметр("Конвертация", ТекКонвертация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРезультат = Неопределено;
		Если ВыполнятьПоиск Тогда
			СтруктураПоиска = Новый Структура("ТипЭлементаКонвертации, НаименованиеЭлементаКонвертации, Захвачен",
								ТипЗнч(Выборка.Ссылка), Выборка.НаименованиеЭлементаКонвертации, Выборка.Захвачен);
								
			СтруктураПоиска.Вставить("Копия", Выборка.Копия);
			НайденныеСтроки = Объект.ТаблицаСопоставленияКонвертаций.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Если НайденнаяСтрока.ПодчиненнаяКонвертация = ТекПК
						Или НЕ ЗначениеЗаполнено(НайденнаяСтрока.ПодчиненнаяКонвертация) Тогда
						СтрокаРезультат = НайденнаяСтрока;
					КонецЕсли;
				КонецЦикла;
				Если СтрокаРезультат = Неопределено Тогда
					СтрокаРезультат = Объект.ТаблицаСопоставленияКонвертаций.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРезультат, НайденныеСтроки[0], "СсылкаГК, ЕстьГК");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаРезультат = Неопределено Тогда
			СтрокаРезультат = Объект.ТаблицаСопоставленияКонвертаций.Добавить();
		КонецЕсли;
		СтрокаРезультат.ПодчиненнаяКонвертация = ТекПК;
		Если  ТекПК <> ТекКонвертация И ЗначениеЗаполнено(ТекПК) Тогда
			СтрокаРезультат.ПодчиненнаяКонвертация2 = ТекКонвертация;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаРезультат, Выборка);
		СтрокаРезультат.ТипЭлементаКонвертации = ТипЗнч(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СравнитьЭлементыКонвертации(ТабРезультатСтрока, Ссылка1, Ссылка2)
	Если ТабРезультатСтрока.ТипЭлементаКонвертации = Тип("СправочникСсылка.Алгоритмы") Тогда
		ЕстьОтличия = СокрЛП(Ссылка1.Алгоритм) <> СокрЛП(Ссылка2.Алгоритм)
						ИЛИ СокрЛП(Ссылка1.Параметры) <> СокрЛП(Ссылка2.Параметры)
						ИЛИ Ссылка1.ЭтоФункция <> Ссылка2.ЭтоФункция;
	ИначеЕсли ТабРезультатСтрока.ТипЭлементаКонвертации = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		ЕстьОтличия = Ссылка1.ИспользоватьДляОтправки <> Ссылка2.ИспользоватьДляОтправки
						ИЛИ Ссылка1.ИспользоватьДляПолучения <> Ссылка2.ИспользоватьДляПолучения
						ИЛИ Ссылка1.ПравилоДляГруппыСправочника <> Ссылка2.ПравилоДляГруппыСправочника
						ИЛИ Ссылка1.Отключить <> Ссылка2.Отключить
						ИЛИ СокрЛП(Ссылка1.ОбъектКонфигурации) <> СокрЛП(Ссылка2.ОбъектКонфигурации)
						ИЛИ СокрЛП(Ссылка1.ОбъектФормата) <> СокрЛП(Ссылка2.ОбъектФормата)
						ИЛИ СокрЛП(Ссылка1.АлгоритмПередОтправкойДанных) <> СокрЛП(Ссылка2.АлгоритмПередОтправкойДанных)
						ИЛИ СокрЛП(Ссылка1.АлгоритмПриОтправкеДанных) <> СокрЛП(Ссылка2.АлгоритмПриОтправкеДанных)
						ИЛИ СокрЛП(Ссылка1.АлгоритмПередПолучениемДанных) <> СокрЛП(Ссылка2.АлгоритмПередПолучениемДанных)
						ИЛИ СокрЛП(Ссылка1.АлгоритмПриПолученииДанных) <> СокрЛП(Ссылка2.АлгоритмПриПолученииДанных)
						ИЛИ СокрЛП(Ссылка1.АлгоритмПослеЗагрузкиВсехДанных) <> СокрЛП(Ссылка2.АлгоритмПослеЗагрузкиВсехДанных)
						ИЛИ Ссылка1.ВариантИдентификации <> Ссылка2.ВариантИдентификации
						ИЛИ Ссылка1.ПравилаКонвертацииСвойств.Количество() <> Ссылка2.ПравилаКонвертацииСвойств.Количество()
						ИЛИ Ссылка1.ИдентификацияПоПолямПоиска.Количество() <> Ссылка2.ИдентификацияПоПолямПоиска.Количество();
		Если НЕ ЕстьОтличия И Ссылка1.ПравилаКонвертацииСвойств.Количество() > 0 Тогда
			Инд = 0;
			Для Каждого СтрокаТЧ1 Из Ссылка1.ПравилаКонвертацииСвойств Цикл
				СтрокаТЧ2 = Ссылка2.ПравилаКонвертацииСвойств[Инд];
				ЕстьОтличия = СокрЛП(СтрокаТЧ1.ПолноеИмяСвойстваКонфигурации) <> СокрЛП(СтрокаТЧ2.ПолноеИмяСвойстваКонфигурации)
							ИЛИ СокрЛП(СтрокаТЧ1.ПолноеИмяСвойстваФормата) <> СокрЛП(СтрокаТЧ2.ПолноеИмяСвойстваФормата)
							ИЛИ СокрЛП(СтрокаТЧ1.ПравилоКонвертацииСвойства) <> СокрЛП(СтрокаТЧ2.ПравилоКонвертацииСвойства)
							ИЛИ СтрокаТЧ1.Отключить <> СтрокаТЧ2.Отключить
							ИЛИ СтрокаТЧ1.ИспользуетсяАлгоритмКонвертации <> СтрокаТЧ2.ИспользуетсяАлгоритмКонвертации;
				Инд = Инд + 1;
				Если ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если НЕ ЕстьОтличия И Ссылка1.ИдентификацияПоПолямПоиска.Количество() > 0 Тогда
			Инд = 0;
			Для Каждого СтрокаТЧ1 Из Ссылка1.ИдентификацияПоПолямПоиска Цикл
				СтрокаТЧ2 = Ссылка2.ИдентификацияПоПолямПоиска[Инд];
				ЕстьОтличия = СокрЛП(СтрокаТЧ1.РеквизитыПоиска) <> СокрЛП(СтрокаТЧ2.РеквизитыПоиска);
				Инд = Инд + 1;
				Если ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТабРезультатСтрока.ТипЭлементаКонвертации = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда
		ЕстьОтличия = Ссылка1.ИспользоватьДляОтправки <> Ссылка2.ИспользоватьДляОтправки
				ИЛИ Ссылка1.ИспользоватьДляПолучения <> Ссылка2.ИспользоватьДляПолучения
				ИЛИ СокрЛП(Ссылка1.ОбъектКонфигурации) <> СокрЛП(Ссылка2.ОбъектКонфигурации)
				ИЛИ СокрЛП(Ссылка1.ОбъектФормата) <> СокрЛП(Ссылка2.ОбъектФормата)
				ИЛИ Ссылка1.СопоставлениеЗначений.Количество() <> Ссылка2.СопоставлениеЗначений.Количество();
		Если НЕ ЕстьОтличия И Ссылка1.СопоставлениеЗначений.Количество() > 0 Тогда
			Инд = 0;
			Для Каждого СтрокаТЧ1 Из Ссылка1.СопоставлениеЗначений Цикл
				СтрокаТЧ2 = Ссылка2.СопоставлениеЗначений[Инд];
				ЕстьОтличия = СокрЛП(СтрокаТЧ1.ЗначениеКонфигурации) <> СокрЛП(СтрокаТЧ2.ЗначениеКонфигурации)
							ИЛИ СокрЛП(СтрокаТЧ1.ЗначениеФормата) <> СокрЛП(СтрокаТЧ2.ЗначениеФормата);
				Инд = Инд + 1;
				Если ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТабРезультатСтрока.ТипЭлементаКонвертации = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда
		ЕстьОтличия = Ссылка1.ИспользоватьДляОтправки <> Ссылка2.ИспользоватьДляОтправки
						ИЛИ Ссылка1.ИспользоватьДляПолучения <> Ссылка2.ИспользоватьДляПолучения
						ИЛИ Ссылка1.ОчисткаДанных <> Ссылка2.ОчисткаДанных
						ИЛИ Ссылка1.Отключить <> Ссылка2.Отключить
						ИЛИ Ссылка1.СпособВыборки <> Ссылка2.СпособВыборки
						ИЛИ СокрЛП(Ссылка1.ОбъектВыборки) <> СокрЛП(Ссылка2.ОбъектВыборки)
						ИЛИ СокрЛП(Ссылка1.ПравилоКонвертацииОбъекта) <> СокрЛП(Ссылка2.ПравилоКонвертацииОбъекта)
						ИЛИ СокрЛП(Ссылка1.АлгоритмВыборкаДанных) <> СокрЛП(Ссылка2.АлгоритмВыборкаДанных)
						ИЛИ СокрЛП(Ссылка1.АлгоритмПриОбработке) <> СокрЛП(Ссылка2.АлгоритмПриОбработке)
						ИЛИ Ссылка1.ПравилаКонвертацииОбъектов.Количество() <> Ссылка2.ПравилаКонвертацииОбъектов.Количество();
		Если НЕ ЕстьОтличия И Ссылка1.ПравилаКонвертацииОбъектов.Количество() > 0 Тогда
			Инд = 0;
			Для Каждого СтрокаТЧ1 Из Ссылка1.ПравилаКонвертацииОбъектов Цикл
				СтрокаТЧ2 = Ссылка2.ПравилаКонвертацииОбъектов[Инд];
				ЕстьОтличия = СокрЛП(СтрокаТЧ1.ПравилоКонвертацииОбъекта) <> СокрЛП(СтрокаТЧ2.ПравилоКонвертацииОбъекта);
				Инд = Инд + 1;
				Если ЕстьОтличия Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ТабРезультатСтрока.ЕстьПроблемы = Истина;
	ТабРезультатСтрока.ОписаниеПроблемы = ?(ЕстьОтличия,НСтр("ru='Отличаются элементы конвертации'"),
		НСтр("ru='Можно объединить элементы конвертации'"));
КонецПроцедуры

&НаКлиенте
Процедура ИсключатьОбъектыМеждународнойКонфигурацииПриИзменении(Элемент)
	Элементы.МеждународнаяКонвертация.Доступность = Объект.ИсключатьОбъектыМеждународнойКонфигурации;
КонецПроцедуры

#КонецОбласти
