#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтоГруппа Тогда
		// Полное имя свойств конфигурации.
		Если (ЗначениеЗаполнено(СвойствоКонфигурации) И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурации))
			Или (ЗначениеЗаполнено(СвойствоКонфигурацииКорреспондента) И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурацииКорреспондента)) Тогда
			ГруппаСвойствКонфигурации = "";
			ГруппаСвойствКонфигурацииКорреспондента = "";
			Если ЗначениеЗаполнено(Родитель) Тогда
				ДанныеРодителя = Новый Структура("СвойствоКонфигурации, СвойствоКонфигурацииКорреспондента");
				ЗаполнитьЗначенияСвойств(ДанныеРодителя, Родитель);
				ГруппаСвойствКонфигурации = СокрЛП(ДанныеРодителя.СвойствоКонфигурации);
				ГруппаСвойствКонфигурацииКорреспондента = СокрЛП(ДанныеРодителя.СвойствоКонфигурацииКорреспондента);
			КонецЕсли;
			Если ЗначениеЗаполнено(СвойствоКонфигурации) И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурации) Тогда
				ПолноеИмяСвойстваКонфигурации = ?(ПустаяСтрока(ГруппаСвойствКонфигурации), 
					"", "" + ГруппаСвойствКонфигурации + ".") + СокрЛП(СвойствоКонфигурации);
			КонецЕсли;
			Если ЗначениеЗаполнено(СвойствоКонфигурацииКорреспондента) 
				И НЕ ЗначениеЗаполнено(ПолноеИмяСвойстваКонфигурацииКорреспондента) Тогда
				ПолноеИмяСвойстваКонфигурацииКорреспондента = ?(ПустаяСтрока(ГруппаСвойствКонфигурацииКорреспондента), 
					"", "" + ГруппаСвойствКонфигурацииКорреспондента + ".") + СокрЛП(СвойствоКонфигурацииКорреспондента);
			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	// Авто формирование наименования.
	ПараметрыПКС = Новый Структура("ИспользоватьДляОтправки, ИспользоватьДляПолучения, ТипКонвертации");
	ЗаполнитьЗначенияСвойств(ПараметрыПКС, Владелец);
	ПараметрыПКС.Вставить("СвойствоКонфигурации", СвойствоКонфигурации);
	ПараметрыПКС.Вставить("СвойствоКонфигурацииСтрокой", СвойствоКонфигурацииСтрокой);
	ПараметрыПКС.Вставить("ПолноеИмяСвойстваКонфигурации", ПолноеИмяСвойстваКонфигурации); 
	ПараметрыПКС.Вставить("СвойствоФормата", СвойствоФормата);
	ПараметрыПКС.Вставить("ПолноеИмяСвойстваФормата", ПолноеИмяСвойстваФормата); 
	ПараметрыПКС.Вставить("ЭтоГруппа", ЭтоГруппа);
	ПараметрыПКС.Вставить("ИмяПараметраДляПередачи", ИмяПараметраДляПередачи);
	ПараметрыПКС.Вставить("СвойствоКонфигурацииКорреспондента", СвойствоКонфигурацииКорреспондента);
	ПараметрыПКС.Вставить("ЭтоГруппа", ЭтоГруппа);
	
	Справочники.ПравилаКонвертацииСвойств.ЗаполнитьНаименованиеПКС(Наименование, ПараметрыПКС);
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	// Для конвертации XML: признак ИспользуетсяАлгоритмКонвертации заполняется для служебных целей (оформление цветом в списке свойств).
	Если ПараметрыПКС.ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
		ИспользуетсяАлгоритмКонвертации = НЕ ПустаяСтрока(АлгоритмПередВыгрузкойСвойства)
			Или НЕ ПустаяСтрока(АлгоритмПриВыгрузкеСвойства) Или НЕ ПустаяСтрока(АлгоритмПослеВыгрузкиСвойства);
		Если ЭтоГруппа И НЕ ИспользуетсяАлгоритмКонвертации Тогда
			ИспользуетсяАлгоритмКонвертации = НЕ ПустаяСтрока(АлгоритмПередОбработкойВыгрузки)
				Или НЕ ПустаяСтрока(АлгоритмПослеОбработкиВыгрузки); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ ЭтоГруппа Тогда
		Проверено = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#КонецЕсли