#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если Параметры.Свойство("ПараметрыДерева") Тогда
		Если Параметры.ПараметрыДерева.Свойство("ОбъектКопирования") Тогда
			ЗаполнитьЗначенияСвойств(Объект,  Параметры.ПараметрыДерева.ОбъектКопирования,"Владелец, Наименование, Комментарий");
		ИначеЕсли Параметры.ПараметрыДерева.Свойство("ОбъектФормата") Тогда
			Объект.Владелец = Параметры.ПараметрыДерева.ОбъектФормата;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти