#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ТипКонвертации = Параметры.Ключ.ТипКонвертации;
		ВыбраннаяФорма = ?(ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO,"ФормаЭлементаXDTO","ФормаЭлементаXML");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#КонецЕсли