#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантРаботы = "Единичный";
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантРаботыПриИзменении(Элемент)
	Если ВариантРаботы = "Единичный" И СписокКонвертаций.Количество() > 0 Тогда
		Объект.Конвертация = СписокКонвертаций[0].Значение;
	ИначеЕсли ВариантРаботы = "Множественный" И СписокКонвертаций.Количество() = 0
		И ЗначениеЗаполнено(Объект.Конвертация) Тогда
		СписокКонвертаций.Добавить(Объект.Конвертация);
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбособитьКонвертацию(Команда)
	Если ВариантРаботы = "Единичный" И НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указана конвертация'"));
		Возврат;
	ИначеЕсли ВариантРаботы = "Множественный" И СписокКонвертаций.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указана ни одна конвертация'"));
		Возврат;
	КонецЕсли;
	МассивСвязанныхКонвертаций = СвязанныеКонвертации(ВариантРаботы, Объект.Конвертация, СписокКонвертаций.ВыгрузитьЗначения());
	Если МассивСвязанныхКонвертаций.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Данная конвертация уже обособлена.'"));
		Возврат;
	КонецЕсли;
	Если ВариантРаботы = "Единичный" Тогда
		ТекстВопроса = НСтр("ru = 'Данная конвертация будет обособлена от следующих конвертаций'") + Символы.ПС;
	Иначе
		ТекстВопроса = НСтр("ru = 'Указанные конвертации будут обособлены от следующих конвертаций'") + Символы.ПС;
	КонецЕсли;
	Для Каждого СвязаннаяКонвертация Из МассивСвязанныхКонвертаций Цикл
		ТекстВопроса = ТекстВопроса + СокрЛП(СвязаннаяКонвертация) + ", ";
	КонецЦикла;
	ТекстВопроса = Лев(ТекстВопроса, СтрДлина(ТекстВопроса)-2) + Символы.ПС + НСтр("ru = 'Продолжить?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыбранВариантДействий", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
// Обработчик ожидания после ответа на вопрос пользователя.
Процедура ВыбранВариантДействий(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ОбособитьКонвертациюНаСервере(ВариантРаботы,Объект.Конвертация, СписокКонвертаций.ВыгрузитьЗначения());
	Если ВариантРаботы = "Единичный" Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Конвертация обособлена.'"));
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Конвертации обособлены.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если ВариантРаботы = "Единичный" Тогда
		ТекСтраница = Элементы.ОднаКонвертация;
		ЗаголовокКнопки = НСтр("ru = 'Обособить конвертацию'");
	Иначе
		ТекСтраница = Элементы.НесколькоКонвертаций;
		ЗаголовокКнопки = НСтр("ru = 'Обособить конвертации'");
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ТекСтраница;
	Элементы.ФормаОбособитьКонвертацию.Заголовок = ЗаголовокКнопки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвязанныеКонвертации(ВариантРаботы, Конвертация, МассивКонвертаций)
	Запрос = Новый Запрос;
	Если ВариантРаботы = "Единичный" Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставЧужая.Владелец КАК КонвертацияСвязанная
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.Владелец <> СоставЧужая.Владелец
		|	И СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец = &ТекКонвертация И НЕ СоставНаша.Отключить
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)";
		Запрос.УстановитьПараметр("ТекКонвертация", Конвертация);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставЧужая.Владелец КАК КонвертацияСвязанная
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец В (&МассивКонвертаций) И НЕ СоставНаша.Отключить
		|	И НЕ (СоставЧужая.Владелец В (&МассивКонвертаций))
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)";

		Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонвертацияСвязанная");
КонецФункции
&НаСервереБезКонтекста
Процедура ОбособитьКонвертациюНаСервере(ВариантРаботы, Конвертация, МассивКонвертаций)
	ОбъектыДляЗамены = Новый Соответствие;
	СвойстваДляЗамены = Новый Соответствие;

	Запрос = Новый Запрос;
	Если ВариантРаботы = "Единичный" Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставНаша.ЭлементКонвертации КАК ЭлементКонвертации,
		|	СоставНаша.Ссылка КАК СоставСсылка
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.Владелец <> СоставЧужая.Владелец
		|	И СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец = &ТекКонвертация И НЕ СоставНаша.Отключить
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации.Копия = ЛОЖЬ";
		Запрос.УстановитьПараметр("ТекКонвертация", Конвертация);
		КонфигурацияИсточник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация, "Конфигурация");
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			// Создаем копию элемента до изменения.
			ЭлементКонвертацииОбъект = Выборка.ЭлементКонвертации.Скопировать();
			ПереопределитьОбъектыПравила(ЭлементКонвертацииОбъект, КонфигурацияИсточник, ОбъектыДляЗамены);
			ЭлементКонвертацииОбъект.Записать();
			
			// Меняем состав конвертации.
			СоставКонвертацийОбъект = Выборка.СоставСсылка.ПолучитьОбъект();
			СоставКонвертацийОбъект.ЭлементКонвертации = ЭлементКонвертацииОбъект.Ссылка;
			СоставКонвертацийОбъект.Записать();
			
			Если ТипЗнч(Выборка.ЭлементКонвертации) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
				СкопироватьПКС(Выборка.ЭлементКонвертации, ЭлементКонвертацииОбъект.Ссылка, СвойстваДляЗамены);
			КонецЕсли;
		КонецЦикла;

	Иначе
		МассивКонфигураций = Новый Массив;
		Для Каждого ЭлКонв Из МассивКонвертаций Цикл
			ЭлКонф = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлКонв, "Конфигурация");
			Если ЗначениеЗаполнено(ЭлКонф) Тогда
				МассивКонфигураций.Добавить(ЭлКонф);
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СоставНаша.ЭлементКонвертации КАК ЭлементКонвертации,
		|	СоставНаша.Ссылка КАК СоставСсылка
		|ИЗ Справочник.СоставыКонвертаций КАК СоставНаша
		|СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК СоставЧужая
		|ПО СоставНаша.Владелец <> СоставЧужая.Владелец
		|	И СоставНаша.ЭлементКонвертации = СоставЧужая.ЭлементКонвертации
		|	И НЕ СоставЧужая.Отключить И НЕ СоставЧужая.ПометкаУдаления
		|ГДЕ СоставНаша.Владелец В (&МассивКонвертаций) И НЕ СоставНаша.Отключить
		|	И НЕ СоставЧужая.Владелец В (&МассивКонвертаций)
		|	И НЕ СоставНаша.ПометкаУдаления
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.Алгоритмы.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииОбъектов.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаОбработкиДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации <> ЗНАЧЕНИЕ(Справочник.ПравилаКонвертацииПредопределенныхДанных.ПустаяСсылка)
		|	И СоставНаша.ЭлементКонвертации.Копия = ЛОЖЬ
		|ИТОГИ ПО СоставНаша.ЭлементКонвертации";
		Запрос.УстановитьПараметр("МассивКонвертаций", МассивКонвертаций);
		ВыборкаЭлементКонвертации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЭлементКонвертации.Следующий() Цикл
			// Создаем копию элемента до изменения.
			ЭлементКонвертацииОбъект = ВыборкаЭлементКонвертации.ЭлементКонвертации.Скопировать();
			ПереопределитьОбъектыПравила(ЭлементКонвертацииОбъект, МассивКонфигураций, ОбъектыДляЗамены);
			ЭлементКонвертацииОбъект.Записать();
			Выборка = ВыборкаЭлементКонвертации.Выбрать();
			ПравилоИсходное = ВыборкаЭлементКонвертации.ЭлементКонвертации;
			Пока Выборка.Следующий() Цикл
				// Меняем состав конвертации.
				СоставКонвертацийОбъект = Выборка.СоставСсылка.ПолучитьОбъект();
				СоставКонвертацийОбъект.ЭлементКонвертации = ЭлементКонвертацииОбъект.Ссылка;
				СоставКонвертацийОбъект.Записать();
			КонецЦикла;
			
			Если ТипЗнч(ПравилоИсходное) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
				СкопироватьПКС(ПравилоИсходное, ЭлементКонвертацииОбъект.Ссылка, СвойстваДляЗамены);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереопределитьОбъектыПравила(ЭлементКонвертацииОбъект, КонфигурацияИсточник, ОбъектыДляЗамены)
	ТипОбъекта = ТипЗнч(ЭлементКонвертацииОбъект);
	Если ТипОбъекта = Тип("СправочникОбъект.ПравилаОбработкиДанных") Тогда
		ИмяРеквизита = "ОбъектВыборки";
	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.ПравилаКонвертацииОбъектов")
		Или ТипОбъекта = Тип("СправочникОбъект.ПравилаКонвертацииПредопределенныхДанных") Тогда
		ИмяРеквизита = "ОбъектКонфигурации";
	Иначе
		Возврат;
	КонецЕсли;
	ОбъектКонфигурации = ЭлементКонвертацииОбъект[ИмяРеквизита];
	Если ТипЗнч(ОбъектКонфигурации) <> Тип("СправочникСсылка.Объекты")
		Или НЕ ЗначениеЗаполнено(ОбъектКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	СоотвОбъект = ОбъектыДляЗамены.Получить(ОбъектКонфигурации);
	Если СоотвОбъект <> Неопределено Тогда
		ЭлементКонвертацииОбъект[ИмяРеквизита] = СоотвОбъект;
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Если ТипЗнч(КонфигурацияИсточник) = Тип("Массив") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбъектыНовый.Ссылка
		|ИЗ Справочник.Объекты КАК ОбъектыИсходный
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОбъектыНовый
		|ПО ОбъектыИсходный.Наименование = ОбъектыНовый.Наименование
		|	ИЛИ (ОбъектыИсходный.Идентификатор = ОбъектыНовый.Идентификатор
		|		И ОбъектыИсходный.Идентификатор <> """")
		|	И ОбъектыИсходный.Владелец.КонфигурацияВладелец = ОбъектыНовый.Владелец.КонфигурацияВладелец
		|ГДЕ ОбъектыИсходный.Ссылка = &СсылкаИсходный И ОбъектыНовый.Владелец В (&Конфигурация)";

	Иначе
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбъектыНовый.Ссылка
		|ИЗ Справочник.Объекты КАК ОбъектыИсходный
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Объекты КАК ОбъектыНовый
		|ПО ОбъектыИсходный.Наименование = ОбъектыНовый.Наименование
		|	ИЛИ (ОбъектыИсходный.Идентификатор = ОбъектыНовый.Идентификатор
		|		И ОбъектыИсходный.Идентификатор <> """")
		|ГДЕ ОбъектыИсходный.Ссылка = &СсылкаИсходный И ОбъектыНовый.Владелец = &Конфигурация";
	КонецЕсли;
	Запрос.УстановитьПараметр("СсылкаИсходный", ОбъектКонфигурации);
	Запрос.УстановитьПараметр("Конфигурация", КонфигурацияИсточник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭлементКонвертацииОбъект[ИмяРеквизита] = Выборка.Ссылка;
		ОбъектыДляЗамены.Вставить(ОбъектКонфигурации, Выборка.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьПКС(ПКОИсточник, ПКОПолучатель, СвойстваДляЗамены)
	ЗапросПКС = Новый Запрос;
	ЗапросПКС.Текст = "ВЫБРАТЬ
	|	Код,
	|	Ссылка,
	|	Родитель,
	|	ЭтоГруппа
	| ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &ПКО И НЕ ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО ЭтоГруппа УБЫВ";
	ЗапросПКС.УстановитьПараметр("ПКО", ПКОИсточник);
	ВыборкаПКС = ЗапросПКС.Выполнить().Выбрать();
	СоответствиеГрупп = Новый Соответствие;
	Пока ВыборкаПКС.Следующий() Цикл
		ДубльПКС = ВыборкаПКС.Ссылка.Скопировать();
		ДубльПКС.Владелец = ПКОПолучатель;
		Если ЗначениеЗаполнено(ВыборкаПКС.Родитель) Тогда
			ДубльПКС.Родитель = СоответствиеГрупп.Получить(ВыборкаПКС.Родитель);
		КонецЕсли;
		ПереопределитьСвойстваПравила(ДубльПКС, ПКОПолучатель, СвойстваДляЗамены);
		ДубльПКС.Код = ВыборкаПКС.Код;    
		Если НЕ ЗНачениеЗаполнено(ДубльПКС.Код) Тогда
			ДубльПКС.УстановитьНовыйКод();
		КонецЕсли;
		Если НЕ ВыборкаПКС.ЭтоГруппа Тогда
			ДубльПКС.Проверено = Ложь; 
		КонецЕсли;
		ДубльПКС.ОбменДанными.Загрузка = Истина;
		ДубльПКС.Записать();
		Если ВыборкаПКС.ЭтоГруппа Тогда
			СоответствиеГрупп.Вставить(ВыборкаПКС.Ссылка, ДубльПКС.Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереопределитьСвойстваПравила(ПКСОбъект, ПКОПолучатель, СвойстваДляЗамены)
	СвойствоКонфигурации = ПКСОбъект.СвойствоКонфигурации;
	Если НЕ ЗначениеЗаполнено(СвойствоКонфигурации) Или НЕ ЗначениеЗаполнено(ПКОПолучатель.ОбъектКонфигурации) Тогда
		Возврат;
	КонецЕсли;
	СоотвСвойство = СвойстваДляЗамены.Получить(СвойствоКонфигурации);
	Если СоотвСвойство <> Неопределено Тогда
		ПКСОбъект.СвойствоКонфигурации = СоотвСвойство;
		Возврат;
	КонецЕсли;
	УточненноеСвойство = Неопределено;
	// Исправление возможной ошибочной ситуации - исходное свойство может не соответствовать по иерархии ПКС
	Если ЗначениеЗаполнено(СвойствоКонфигурации.Родитель) И НЕ ЗначениеЗаполнено(ПКСОбъект.Родитель)
		Или НЕ ЗначениеЗаполнено(СвойствоКонфигурации.Родитель) И ЗначениеЗаполнено(ПКСОбъект.Родитель) Тогда
		ЗапросВерноеСвойство = Новый Запрос;
		ЗапросВерноеСвойство.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ Справочник.Свойства
		|ГДЕ Владелец = &Владелец
		|	И Наименование = &Наименование
		|	И ЕстьNULL(Родитель.Наименование, """") = &РодительНаименование";
		ЗапросВерноеСвойство.УстановитьПараметр("Владелец", СвойствоКонфигурации.Владелец);
		ЗапросВерноеСвойство.УстановитьПараметр("Наименование", СвойствоКонфигурации.Наименование);
		Если ЗначениеЗаполнено(ПКСОбъект.Родитель) Тогда
			Если ЗначениеЗаполнено(ПКСОбъект.Родитель.СвойствоКонфигурации) Тогда
				ЗапросВерноеСвойство.УстановитьПараметр("РодительНаименование", ПКСОбъект.Родитель.СвойствоКонфигурации.Наименование);
			Иначе
				ЗапросВерноеСвойство.УстановитьПараметр("РодительНаименование", ПКСОбъект.Родитель.СвойствоФормата);
			КонецЕсли;
		Иначе
			ЗапросВерноеСвойство.УстановитьПараметр("РодительНаименование", "");
		КонецЕсли;
		ВыборкаВерноеСвойство = ЗапросВерноеСвойство.Выполнить().Выбрать();
		Если ВыборкаВерноеСвойство.Следующий() Тогда
			УточненноеСвойство = ВыборкаВерноеСвойство.Ссылка;
			Если ЗначениеЗаполнено(УточненноеСвойство) Тогда
				СоотвСвойство = СвойстваДляЗамены.Получить(УточненноеСвойство);
				Если СоотвСвойство <> Неопределено Тогда
					ПКСОбъект.СвойствоКонфигурации = СоотвСвойство;
					Возврат;
				КонецЕсли;
			Иначе
				УточненноеСвойство = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваНовый.Ссылка
	|ИЗ Справочник.Свойства КАК СвойстваИсходный
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Свойства КАК СвойстваНовый
	|ПО СвойстваИсходный.Наименование = СвойстваНовый.Наименование
	|	ИЛИ (СвойстваИсходный.Идентификатор = СвойстваНовый.Идентификатор
	|		И СвойстваИсходный.Идентификатор <> """")
	|ГДЕ СвойстваИсходный.Ссылка = &СсылкаИсходный И СвойстваНовый.Владелец = &ОбъектНовый
	|	И ЕстьNULL(СвойстваИсходный.Родитель.Наименование, """") = ЕстьNULL(СвойстваНовый.Родитель.Наименование, """")";
	Если УточненноеСвойство = Неопределено Тогда
		Запрос.УстановитьПараметр("СсылкаИсходный", СвойствоКонфигурации);
	Иначе
		Запрос.УстановитьПараметр("СсылкаИсходный", УточненноеСвойство);
	КонецЕсли;
	Запрос.УстановитьПараметр("ОбъектНовый", ПКОПолучатель.ОбъектКонфигурации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПКСОбъект.СвойствоКонфигурации = Выборка.Ссылка;
		Если УточненноеСвойство = Неопределено Тогда
			СвойстваДляЗамены.Вставить(СвойствоКонфигурации, Выборка.Ссылка);
		Иначе
			СвойстваДляЗамены.Вставить(УточненноеСвойство, Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

