#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	// Заполнение списка конвертаций данного правила
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций, ВедущаяКонфигурация);
	Иначе
		Если ЗначениеЗаполнено(Параметры.Конвертация) Тогда
			СписокКонвертаций.Добавить(Параметры.Конвертация);
			ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Конвертация, "ТипКонвертации, Конфигурация");

			Объект.ТипКонвертации = ДанныеКонвертации.ТипКонвертации;
			ВедущаяКонфигурация = ДанныеКонвертации.Конфигурация;
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Возможно новый элемент копируется - тогда список конвертаций необходимо заполнить.
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Параметры.ЗначениеКопирования, СписокКонвертаций, ВедущаяКонфигурация);
		ИначеЕсли ЗначениеЗаполнено(Параметры.Основание) Тогда
			КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Параметры.Основание, СписокКонвертаций, ВедущаяКонфигурация);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ГруппаПравил) Тогда
			Объект.ГруппаПравил = Параметры.ГруппаПравил;
		КонецЕсли;
	КонецЕсли;
	КонвертацияXDTO = (Объект.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	Если НЕ КонвертацияXDTO 
			ИЛИ (Объект.ИспользоватьДляОтправки = Ложь И Объект.ИспользоватьДляПолучения = Ложь) Тогда
		Объект.ИспользоватьДляОтправки = Истина;
	КонецЕсли;
	
	СовместнаяРабота = Константы.СовместнаяРабота.Получить();
	Если СовместнаяРабота Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			// Для нового объекта ставим захват по умолчанию.
			Объект.Захвачен = Истина;
		ИначеЕсли Объект.Захвачен Тогда
			КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТолькоПросмотр Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если ОграничиватьДоступНаУровнеЗаписей Тогда
			КонвертацияДанныхXDTOСервер.ПроверитьДоступКОбъектуНаУровнеЗаписей(ЭтаФорма, СписокКонвертаций);
		КонецЕсли;
	КонецЕсли;
	// Проверка использования дополнительных модулей и тегов.
	Если КонвертацияXDTO Тогда
		КонвертацияДанныхXDTOВызовСервера.ОпределитьИспользованиеТегов(СписокКонвертаций, ЕстьТеги, Элементы.ТегиТег);
		Для Каждого Конвертация Из СписокКонвертаций Цикл
			ИспользоватьРазделениеМодуля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация.Значение, "ИспользоватьРазделениеМодуля");
			Если ИспользоватьРазделениеМодуля Тогда
				КонвертацияВладелецМодулей = Конвертация.Значение;
				ЗаполнитьПараметрыВыбораДополнительногоМодуля();
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		Если ИспользоватьРазделениеМодуля Тогда
			Если Объект.ВыгружатьВМодульМенеджера Тогда
				Если ЗначениеЗаполнено(Объект.ОбъектКонфигурацииДляВыгрузкиМодуля) Тогда
					ВариантВыгрузки = 3;
				Иначе
					ВариантВыгрузки = 2;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Объект.ДополнительныйМодуль) Тогда
				ВариантВыгрузки = 1;
			КонецЕсли;
		КонецЕсли;
		ОпределитьМодульПоУмолчанию();
	КонецЕсли;
	ЗаполнитьОтборПоВладельцуОбъектВыгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ПравилаКонвертацииОбъектов.Количество() > 0 Тогда
		ИспользоватьНесколькоПравилКонвертации = Истина;
	КонецЕсли;
	ПеречитатьИменаОбработчиков();
	КонвертацияДанныхXDTOКлиент.ДобавитьТекущееЗначениеВСписокВыбораЭлементаФормы(Элементы.ОбъектВыборки, Объект.ОбъектВыборки);
	КонвертацияДанныхXDTOКлиент.ДобавитьТекущееЗначениеВСписокВыбораЭлементаФормы(Элементы.ПравилоКонвертацииОбъекта, Объект.ПравилоКонвертацииОбъекта);
	Для Каждого СтрокаТЧ Из Объект.ПравилаКонвертацииОбъектов Цикл
		КонвертацияДанныхXDTOКлиент.ДобавитьТекущееЗначениеВСписокВыбораЭлементаФормы(Элементы.ПравилаКонвертацииОбъектовПравилоКонвертацииОбъекта, СтрокаТЧ.ПравилоКонвертацииОбъекта);
	КонецЦикла; 
	УстановитьВидимость();
	ОбновитьИндикациюОбработчиков();
	КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Объект.Захвачен, СовместнаяРабота);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Для нового правила создать запись в регистре
	КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(Объект.Ссылка, СписокКонвертаций);
	СписокКонвертацийКДобавлению.Очистить();
	Если КонвертацияXDTO Тогда
		СписокКонвертацийКДобавлению = КонвертацияДанныхXDTOВызовСервера.ПолучитьДополненныйСписокКонвертаций(Объект.Ссылка, СписокКонвертаций)
	КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если СписокКонвертацийКДобавлению.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОДобавленииВСоставКонвертаций", ЭтаФорма);
		КонвертацииКДобавлениюСтрокой = " ";
		Для Каждого ТекКонвертация Из СписокКонвертацийКДобавлению Цикл
			КонвертацииКДобавлениюСтрокой = КонвертацииКДобавлениюСтрокой + СокрЛП(ТекКонвертация.Значение) + ",";
		КонецЦикла;
		КонвертацииКДобавлениюСтрокой = Лев(КонвертацииКДобавлениюСтрокой, СтрДлина(КонвертацииКДобавлениюСтрокой)-1) + "?";
		ТекстВопроса = НСтр("ru='Включить правило в состав конвертаций:'") + КонвертацииКДобавлениюСтрокой;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ Отказ И ТекущийОбъект.ТипКонвертации = Перечисления.ТипыКонвертаций.XML И НЕ ЗначениеЗаполнено(ТекущийОбъект.Порядок) Тогда
		// Новый порядок.
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	Максимум(Правила.Порядок) КАК Порядок
		|ИЗ
		|	Справочник.ПравилаОбработкиДанных КАК Правила
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.ЭлементКонвертации = Правила.Ссылка И Состав.Владелец В (&Конвертации) 
		|ГДЕ
		|	ВЫРАЗИТЬ(Правила.ГруппаПравил КАК Строка(100)) = &Группа";
		
		Запрос.УстановитьПараметр("Группа", Лев(ТекущийОбъект.ГруппаПравил,100));
		Запрос.УстановитьПараметр("Конвертации", СписокКонвертаций.ВыгрузитьЗначения());

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий()
			И Выборка.Порядок <> NULL Тогда
			
			НовыйПорядок = Выборка.Порядок + 50;
			
		Иначе
			
			НовыйПорядок = 50;
			
		КонецЕсли;
		ТекущийОбъект.Порядок = НовыйПорядок;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Закрыта форма вопроса о составе конвертаций с изменением состава
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		ОбработкаВыбораНаСервере();
		ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере()
	// Изменился состав конвертаций
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СовместнаяРабота И ИмяСобытия = "ИзмененСтатусЗахвата" И Источник = Объект.Ссылка Тогда
		Прочитать();
		ОбработкаОповещенияНаСервере();
		КонвертацияДанныхXDTOКлиент.ИзменитьВидимостьЭлементовФормыПоСтатусуЗахвата(ЭтаФорма, Параметр);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьДляОтправкиПриИзменении(Элемент)
	Объект.ИспользоватьДляПолучения = НЕ Объект.ИспользоватьДляОтправки;
	ПроверитьОбъектВыборки();
	НастроитьСпискиВыбора();
	ЗаполнитьОтборПоВладельцуОбъектВыгрузки();
	УстановитьВидимость();
	Если КонвертацияXDTO И ИспользоватьРазделениеМодуля Тогда 
		ОпределитьМодульПоУмолчанию();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНесколькоПравилКонвертацииПриИзменении(Элемент)
	Если ИспользоватьНесколькоПравилКонвертации Тогда
		НоваяСтрока = Объект.ПравилаКонвертацииОбъектов.Добавить();
		НоваяСтрока.ПравилоКонвертацииОбъекта = Объект.ПравилоКонвертацииОбъекта;
		Объект.ПравилоКонвертацииОбъекта = Неопределено;
	Иначе  // Флаг сброшен
		Если Объект.ПравилаКонвертацииОбъектов.Количество() > 0 Тогда
			Объект.ПравилоКонвертацииОбъекта =  Объект.ПравилаКонвертацииОбъектов[0].ПравилоКонвертацииОбъекта;
			Объект.ПравилаКонвертацииОбъектов.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СпособВыборкиПриИзменении(Элемент)
	Если Объект.СпособВыборки = 1 Тогда
		Объект.ОбъектВыборки = Неопределено;
	КонецЕсли;
	СписокПКОЗаполнен = Ложь;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПеречитатьИменаОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыборкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("МассивКонвертаций, ТекущаяСтрока, РежимРаботы", 
					СписокКонвертаций, Объект.ОбъектВыборки);

	Если Объект.ИспользоватьДляОтправки Тогда
		ПараметрыФормыВыбора.РежимРаботы = "ОбъектКонфигурации";
		Если НЕ СписокОбъектовКонфигурацииЗаполнен Тогда
			ОбъектВыборкиНачалоВыбораИзСпискаНаСервере(Истина, Ложь, СписокОбъектовКонфигурации);
			СписокОбъектовКонфигурацииЗаполнен = Истина;
			КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектВыборки, СписокОбъектовКонфигурации);
		КонецЕсли;
	ИначеЕсли Объект.ИспользоватьДляПолучения Тогда
		ПараметрыФормыВыбора.РежимРаботы = "ОбъектФормата";
		Если НЕ СписокОбъектовФорматаЗаполнен Тогда
			ОбъектВыборкиНачалоВыбораИзСпискаНаСервере(Ложь, Истина, СписокОбъектовФормата);
			СписокОбъектовФорматаЗаполнен = Истина;
			КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектВыборки, СписокОбъектовФормата);
		КонецЕсли;
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбранОбъектВыборки", ЭтотОбъект, Элемент.Имя),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры 
		
&НаКлиенте
Процедура ОбъектКонфигурацииДляВыгрузкиМодуляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормыВыбора = Новый Структура("МассивКонвертаций, ТекущаяСтрока, РежимРаботы", 
					СписокКонвертаций, Объект.ОбъектВыборки, "ОбъектКонфигурации");
	Если НЕ СписокОбъектовКонфигурацииЗаполнен Тогда
		ОбъектВыборкиНачалоВыбораИзСпискаНаСервере(Истина, Ложь, СписокОбъектовКонфигурации);
		СписокОбъектовКонфигурацииЗаполнен = Истина;
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектВыборки, СписокОбъектовКонфигурации);
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбранОбъектВыборки", ЭтотОбъект, Элемент.Имя),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаКлиенте
Процедура ОбъектВыборкиПриИзменении(Элемент)
	СписокПКОЗаполнен = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПравилоКонвертацииОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ СписокПКОЗаполнен Тогда
		ПравилоКонвертацииОбъектаНачалоВыбораНаСервере(СписокПКО, Объект.ИспользоватьДляОтправки, Объект.ОбъектВыборки);
		СписокПКОЗаполнен = Истина;
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ПравилоКонвертацииОбъекта, СписокПКО);
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ПравилаКонвертацииОбъектовПравилоКонвертацииОбъекта, СписокПКО);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	ОбновитьИндикациюОбработчиков();
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыгрузкиПриИзменении(Элемент)
	Если ВариантВыгрузки = 2 Или ВариантВыгрузки = 3 Тогда
		Объект.ВыгружатьВМодульМенеджера = Истина;
		Объект.ДополнительныйМодуль = Неопределено;
		Если ВариантВыгрузки = 2 Тогда
			Объект.ОбъектКонфигурацииДляВыгрузкиМодуля = Неопределено;
		КонецЕсли;
	Иначе
		Объект.ВыгружатьВМодульМенеджера = Ложь;
	КонецЕсли;
	Модифицированность = Истина;
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьЭлементВСоставКонвертации(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстПредупреждения = НСтр("ru = 'Сначала необходимо записать правило обработки данных'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбранаКонвертация", ЭтаФорма);
	ОткрытьФорму("Справочник.Конвертации.ФормаВыбора",, ЭтаФорма,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификатор(Команда)
	Постфикс = "";
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектВыборки) Тогда
		Возврат;
	КонецЕсли;
	Код = СокрЛП(Объект.ОбъектВыборки);
	Если КонвертацияXDTO Тогда
		Постфикс = ?(Объект.ИспользоватьДляПолучения, "_Получение", "_Отправка");
	КонецЕсли;
	Код = СтрЗаменить(Код, "Ссылка", "");
	Код = СтрЗаменить(Код, ".", "_");
	Объект.Наименование = Код + Постфикс;
	НаименованиеПриИзменении(Неопределено);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбранаКонвертация(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	ОтказДобавления = Ложь;
	ДополнитьСоставКонвертации(РезультатЗакрытия, Объект.Ссылка, ОтказДобавления);
	Если ОтказДобавления Тогда
		ТекстПредупреждения = НСтр("ru = 'Данный элемент уже входит в состав выбранной конвертации'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	Иначе
		Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, ОтказДобавления)
	Если ТипЗнч(Конвертация) = Тип("СписокЗначений") Тогда
		Для Каждого ТекКонвертация Из Конвертация Цикл
			Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(ТекКонвертация.Значение, ЭлементКонвертации);
		КонецЦикла;
	Иначе

		// Проверка на дубли
		Если КонвертацияДанныхXDTOВызовСервера.ЭлементКонвертацииВходитВСоставКонвертации(Конвертация, ЭлементКонвертации) Тогда
			ОтказДобавления = Истина;
			Возврат;
		КонецЕсли;
		Справочники.СоставыКонвертаций.ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации);
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(Объект.Ссылка, СписокКонвертаций);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ИспользоватьНесколькоПравилКонвертации.Видимость = КонвертацияXDTO;
	Элементы.ОбработчикиСобытийXDTO.Видимость = КонвертацияXDTO;
	Элементы.ОбработчикиСобытийXML.Видимость = НЕ КонвертацияXDTO;
	Элементы.Дополнительно.Видимость = НЕ КонвертацияXDTO;
	Элементы.ИспользоватьДляОтправки.Видимость = КонвертацияXDTO;
	Элементы.ФормаРегистрСведенийКомментарииКОбработчикамЗадатьКомментарийКОбработчику.Видимость = КонвертацияXDTO;
	Элементы.ВыгрузкаВМодули.Видимость = ИспользоватьРазделениеМодуля;
	Если ИспользоватьРазделениеМодуля Тогда
		Элементы.ДополнительныйМодуль.Доступность = Ложь;
		Элементы.ОбъектКонфигурацииДляВыгрузкиМодуля.Доступность = Ложь;
		Если ВариантВыгрузки = 1 Тогда
			Элементы.ДополнительныйМодуль.АвтоОтметкаНезаполненного = Истина;
			Элементы.ДополнительныйМодуль.Доступность = Истина;
		ИначеЕсли ВариантВыгрузки = 3 Тогда
			Элементы.ОбъектКонфигурацииДляВыгрузкиМодуля.Доступность = Истина;
            Элементы.ОбъектКонфигурацииДляВыгрузкиМодуля.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
	КонецЕсли;
	Элементы.ГруппаТеги.Видимость = КонвертацияXDTO И ЕстьТеги;
    // Табличная часть с ПКО
	Элементы.ПравилаКонвертацииОбъектов.Видимость = ИспользоватьНесколькоПравилКонвертации;
	Элементы.ПравилоКонвертацииОбъекта.Видимость = НЕ  ИспользоватьНесколькоПравилКонвертации;
	
	// Объект выборки
	Элементы.ОбъектВыборки.Доступность = (Объект.СпособВыборки = 0);
	
	Элементы.Страница_ВыборкаДанных.Видимость = Объект.ИспользоватьДляОтправки;
	Элементы.ОчисткаДанных.Видимость = КонвертацияXDTO И ИспользоватьНесколькоПравилКонвертации И Объект.ИспользоватьДляОтправки;
	Элементы.ИспользоватьДляОтправки.Видимость = КонвертацияXDTO;
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьИменаОбработчиков()
	Если КонвертацияXDTO Тогда
		ПрефиксПравила = НСтр("ru='ПОД'");

		ИмяОбработчикаПриОбработке = ПрефиксПравила + "_" + СокрЛП(Объект.Наименование)+"_" + НСтр("ru='ПриОбработке'");
		ИмяОбработчикаВыборкаДанных = ПрефиксПравила + "_" + СокрЛП(Объект.Наименование)+"_" + НСтр("ru='ВыборкаДанных'");
	Иначе
		ПрефиксПравила = НСтр("ru='ПВД'");
		ИмяОбработчикаПередОбработкой = ПрефиксПравила + "_" + СокрЛП(Объект.Наименование)+"_" + НСтр("ru='ПередОбработкойПравила'");
		ИмяОбработчикаПередВыгрузкой = ПрефиксПравила + "_" + СокрЛП(Объект.Наименование)+"_" + НСтр("ru='ПередВыгрузкойОбъекта'");
		ИмяОбработчикаПослеВыгрузки = ПрефиксПравила + "_" + СокрЛП(Объект.Наименование)+"_" + НСтр("ru='ПослеВыгрузкиОбъекта'");
		ИмяОбработчикаПослеОбработки = ПрефиксПравила + "_" + СокрЛП(Объект.Наименование)+"_" + НСтр("ru='ПослеОбработкиПравила'"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбъектВыборки()
	Если СокрЛП(Объект.ОбъектВыборки) = "" Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ИспользоватьДляОтправки И СписокОбъектовКонфигурации.НайтиПоЗначению(СокрЛП(Объект.ОбъектВыборки)) = Неопределено Тогда
		Объект.ОбъектВыборки = "";
	ИначеЕсли Объект.ИспользоватьДляПолучения И СписокОбъектовФормата.НайтиПоЗначению(СокрЛП(Объект.ОбъектВыборки)) = Неопределено Тогда
		Объект.ОбъектВыборки = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСпискиВыбора()
	Если Объект.ИспользоватьДляОтправки Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектВыборки, СписокОбъектовКонфигурации);
	ИначеЕсли Объект.ИспользоватьДляПолучения Тогда
		КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.ОбъектВыборки, СписокОбъектовФормата);
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ОбъектВыборкиНачалоВыбораИзСпискаНаСервере(ЗаполнитьСписокОбъектовКонфигурации, ЗаполнитьСписокОбъектовФормата, ЗаполняемыйСписок)
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	ОбластьПрименения = Новый Структура("ДляПКО, ДляПКПД, ДляПРО", Истина, Ложь, Ложь);

	Если ЗаполнитьСписокОбъектовКонфигурации Тогда
		Если ЗначениеЗаполнено(ВедущаяКонфигурация) Тогда
			ФильтрКонфигураций = ВедущаяКонфигурация;
		Иначе
			ФильтрКонфигураций = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(МассивКонвертаций);
		КонецЕсли;
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовКонфигурации(ЗаполняемыйСписок, ФильтрКонфигураций, ОбластьПрименения);
	КонецЕсли;
	Если ЗаполнитьСписокОбъектовФормата Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовФормата(ЗаполняемыйСписок, МассивКонвертаций, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПравилоКонвертацииОбъектаНачалоВыбораНаСервере(СписокПКО, ИспользоватьДляОтправки, ОбъектВыборки)
	МассивКонвертаций = СписокКонвертаций.ВыгрузитьЗначения();
	Если ИспользоватьДляОтправки Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокПКО(СписокПКО, МассивКонвертаций, Истина, Неопределено, ОбъектВыборки, Неопределено);
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокПКО(СписокПКО, МассивКонвертаций, Неопределено, Истина, Неопределено, ОбъектВыборки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранОбъектВыборки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Объект[ДополнительныеПараметры] = РезультатЗакрытия.Ссылка;
	Иначе
		Объект[ДополнительныеПараметры] = РезультатЗакрытия;
	КонецЕсли; 
	Если ДополнительныеПараметры = "ОбъектВыборки" Тогда
		ОбъектВыборкиПриИзменении(Элементы.ОбъектВыборки);
		Если КонвертацияXDTO И ИспользоватьРазделениеМодуля Тогда 
			ОпределитьМодульПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикациюОбработчиков()
	Если КонвертацияXDTO Тогда
		КоллекцияСтраниц = Элементы.СтраницыОбработчикиXDTO;
	Иначе
		КоллекцияСтраниц = Элементы.СтраницыОбработчикиXML;
		ПоляИсключение = "";
	КонецЕсли;
	КонвертацияДанныхXDTOКлиент.ОбновитьИндикациюСтраницОбработчиков(КоллекцияСтраниц, Объект, ПоляИсключение);
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере()
	КонвертацияДанныхXDTOСервер.ПрочитатьСведенияОЗахватеОбъекта(Объект, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ВопросОДобавленииВСоставКонвертаций(РезультатВопроса, ДопПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОтказДобавления = Ложь;
		ДополнитьСоставКонвертации(СписокКонвертацийКДобавлению, Объект.Ссылка, ОтказДобавления);
		СписокКонвертацийКДобавлению.Очистить();
		Если НЕ ОтказДобавления Тогда
			Элементы.СписокКонвертаций.ОбновитьТекстРедактирования();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыВыбораДополнительногоМодуля()
	ПараметрВладелец = Новый ПараметрВыбора("Отбор.Владелец", КонвертацияВладелецМодулей); 
	ПараметрРаздел = Новый ПараметрВыбора("Отбор.Раздел", Перечисления.РазделыДополнительныхМодулей.Пользовательский);
	ПараметрыВыбораМодуля = Новый Массив; 	
	ПараметрыВыбораМодуля.Добавить(ПараметрВладелец);
	ПараметрыВыбораМодуля.Добавить(ПараметрРаздел);
	Элементы.ДополнительныйМодуль.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораМодуля);
КонецПроцедуры

&НаСервере
Процедура ОпределитьМодульПоУмолчанию()
	Элементы.ДекорацияМодульМенеджера.Заголовок = "";  
	ОбъектКонфигурацииМенеджера = Неопределено;
	ПараметрОбъектКонфигурации = ?(Объект.ИспользоватьДляОтправки, Объект.ОбъектВыборки, Неопределено);
	ПараметрОбъектФормата = ?(Объект.ИспользоватьДляПолучения, Объект.ОбъектВыборки, "");
	Элементы.ДекорацияПредопределенныйМодуль.Заголовок = КонвертацияДанныхXDTOСервер.ОпределитьМодульПравилаПоУмолчанию(КонвертацияВладелецМодулей, 
			ПараметрОбъектКонфигурации, ПараметрОбъектФормата, Объект.Наименование, Объект.ИспользоватьДляОтправки, Объект.ИспользоватьДляПолучения); 
	Если Объект.ИспользоватьДляОтправки Тогда
		Если ЗначениеЗаполнено(Объект.ОбъектВыборки) И ТипЗнч(Объект.ОбъектВыборки) = Тип("СправочникСсылка.Объекты") Тогда
			ОбъектКонфигурацииМенеджера = Объект.ОбъектВыборки;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.ПравилоКонвертацииОбъекта) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОбъектКонфигурации
			|ИЗ Справочник.ПравилаКонвертацииОбъектов КАК Правила
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
			|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Правила.Ссылка
			|И Состав.Отключить = ЛОЖЬ
			|ГДЕ Код = &ИмяПравила";
			Запрос.УстановитьПараметр("Конвертация", КонвертацияВладелецМодулей);
			Запрос.УстановитьПараметр("ИмяПравила", Объект.ПравилоКонвертацииОбъекта);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ОбъектКонфигурацииМенеджера = Выборка.ОбъектКонфигурации; 
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	Если ЗначениеЗаполнено(ОбъектКонфигурацииМенеджера) Тогда
		ТекстНадписи = НСтр("ru='Выгружается в модуль менеджера %ИмяМодуля%'"); 
		Элементы.ДекорацияМодульМенеджера.Заголовок = СтрЗаменить(ТекстНадписи, "%ИмяМодуля%", СокрЛП(ОбъектКонфигурацииМенеджера));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборПоВладельцуОбъектВыгрузки()
	Если Объект.ИспользоватьДляПолучения Или НЕ ЗначениеЗаполнено(ВедущаяКонфигурация) Тогда
		Элементы.ОбъектВыборки.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
		Элементы.ОбъектВыборки.РедактированиеТекста = Ложь;
		Возврат;
	КонецЕсли;
	МассивСвязи = Новый Массив;
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "ВедущаяКонфигурация");
	МассивСвязи.Добавить(НоваяСвязь);
	Элементы.ОбъектВыборки.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязи);
	Элементы.ОбъектВыборки.РедактированиеТекста = Истина;
КонецПроцедуры
#КонецОбласти




