#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры 

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СпособЗагрузкиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьПравилаКонвертации(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	Если Объект.СпособЗагрузки > 0 И НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрана конвертация для создания правил'"));
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Создание правил начато.'"));
	Отказ = Ложь;
	ТекстСообщения = "";
	СоздатьПравилаКонвертацииНаСервере(Отказ, ТекстСообщения);
	Если Отказ Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Создание правил завершено.'"));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Конвертация.АвтоОтметкаНезаполненного = (Объект.СпособЗагрузки > 0);
	Элементы.Конвертация.Видимость = (Объект.СпособЗагрузки > 0);
КонецПроцедуры

&НаСервере
Процедура СоздатьПравилаКонвертацииНаСервере(Отказ, ТекстСообщения)
	// Проверка на существование идентификаторов
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Объекты.Владелец КАК Владелец
	|ИЗ
	|	Справочник.Объекты КАК Объекты
	|ГДЕ
	|	(Объекты.Владелец = &КонфигурацияИсточник
	|			ИЛИ Объекты.Владелец = &КонфигурацияПриемник)
	|	И Объекты.Идентификатор = """"
	|	И Объекты.ЭтоГруппа = ЛОЖЬ
	|	И НЕ Объекты.ПометкаУдаления
	|	И НЕ Объекты.Тип В (&ПростыеТипы)
	|	И Объекты.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПустаяСсылка)";
	Запрос.УстановитьПараметр("КонфигурацияИсточник", Объект.КонфигурацияИсточник);
	Запрос.УстановитьПараметр("КонфигурацияПриемник", Объект.КонфигурацияПриемник);
	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить(Перечисления.ТипыОбъектов.Булево);
	ПростыеТипы.Добавить(Перечисления.ТипыОбъектов.Дата);
	ПростыеТипы.Добавить(Перечисления.ТипыОбъектов.Число);
	ПростыеТипы.Добавить(Перечисления.ТипыОбъектов.НаборКонстант);
	ПростыеТипы.Добавить(Перечисления.ТипыОбъектов.Строка);
	ПростыеТипы.Добавить(Перечисления.ТипыОбъектов.ХранилищеЗначения);
	ПростыеТипы.Добавить(Перечисления.ТипыОбъектов.УникальныйИдентификатор);
	Запрос.УстановитьПараметр("ПростыеТипы", ПростыеТипы);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПараметрыПравил = Новый Структура("КонфигурацияИсточник, КонфигурацияПриемник, Конвертация",
				Объект.КонфигурацияИсточник, Объект.КонфигурацияПриемник, Объект.Конвертация);
		ПараметрыПравил.Вставить("ПланОбмена", Объект.ПланОбмена);
		ПараметрыПравил.Вставить("СпособЗагрузки", Объект.СпособЗагрузки);
		ПараметрыПравил.Вставить("СоздаватьПравилаДляДвиженийДокументов", Объект.СоздаватьПравилаДляДвиженийДокументов);

			Обработки.АвтогенерацияПравилКонвертацииXML.СоздатьПравилаКонвертации(ПараметрыПравил);
	Иначе
		Отказ = Истина;
		Выборка = Результат.Выбрать();
		ИменаКонфигураций = "";
		Пока Выборка.Следующий() Цикл
			ИменаКонфигураций = ИменаКонфигураций + Выборка.Владелец + ", ";
		КонецЦикла;
		ИменаКонфигураций = Лев(ИменаКонфигураций, СтрДлина(ИменаКонфигураций)-2);
		ТекстСообщения = НСтр("ru='В сведениях о структуре метаданных отсутствуют идентификаторы для релизов'") + ": " + ИменаКонфигураций;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

