
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции
Процедура ВыполнитьОбработкуОтменаЗахвата(ПараметрыВыполнения, АдресВременногоХранилища) Экспорт
	РезультатЗагрузки = Новый Структура("Успешно", Истина);
	ОбъектыКОбработке = ПолучитьОбъектыДляОтменыЗахвата(ПараметрыВыполнения.ЗахваченныеОбъекты);
	Если ОбъектыКОбработке.Количество() = 0 Тогда
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	ВыполненоУспешно = Истина;
	Действие = ?(ПараметрыВыполнения.РежимОтменитьЗахват, Перечисления.ДействияПриСовместнойРаботе.ОтменаЗахвата,
				Перечисления.ДействияПриСовместнойРаботе.ЗаписьОбъекта);
	Для Каждого ОбъектКОбработке Из ОбъектыКОбработке Цикл
		КонвертацияДанныхXDTOСервер.СнятьЗахватСОбъекта(ОбъектКОбработке, Действие,ПараметрыВыполнения.Комментарий, ВыполненоУспешно);
		Если НЕ ВыполненоУспешно Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	РезультатЗагрузки.Успешно = ВыполненоУспешно; 
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища); 
КонецПроцедуры

Процедура ВыполнитьОбработкуЗахват(ПараметрыВыполнения, АдресВременногоХранилища) Экспорт
	РезультатЗагрузки = Новый Структура("Успешно", Истина);
	ОбъектыКОбработке = ПолучитьОбъектыДляЗахвата(ПараметрыВыполнения);
	Если ОбъектыКОбработке.Количество() = 0 Тогда
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	Отказ = Ложь;
	КонвертацияДанныхXDTOСервер.ЗахватитьОбъекты(ОбъектыКОбработке, Пользователи.ТекущийПользователь(), "", Отказ);
	РезультатЗагрузки.Успешно = НЕ Отказ; 
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресВременногоХранилища); 

КонецПроцедуры

Функция ПолучитьОбъектыДляОтменыЗахвата(ЗахваченныеОбъекты)
	МассивОбъектов = Новый Массив;
	Для Каждого Строка Из ЗахваченныеОбъекты Цикл
		Если НЕ Строка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		МассивОбъектов.Добавить(Строка.Объект);
	КонецЦикла;
	Возврат МассивОбъектов;
КонецФункции

Функция ПолучитьОбъектыДляЗахвата(ПараметрыВыполнения)
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	Состав.ЭлементКонвертации КАК Ссылка
	 |ИЗ Справочник.СоставыКонвертаций КАК Состав
	 |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних КАК Захваченные
	 |ПО Состав.ЭлементКонвертации = Захваченные.Объект
	 |ГДЕ Состав.Владелец = &Конвертация И НЕ Состав.ПометкаУдаления И НЕ Состав.Отключить
	 |	И Захваченные.Действие IS NULL
	 |	И Состав.ЭлементКонвертации.Копия = ЛОЖЬ
	 |%Условие%
	 |";
	 Если ПараметрыВыполнения.ЗахватитьВсе Тогда
		 ТекстУсловие = "";
	 Иначе
		 Если ПараметрыВыполнения.ЗахватитьПОД Тогда
			 ТекстУсловие = "Состав.ЭлементКонвертации ССЫЛКА Справочник.ПравилаОбработкиДанных ИЛИ ";
		 КонецЕсли;
		 Если ПараметрыВыполнения.ЗахватитьПКО Тогда
			 ТекстУсловие = "Состав.ЭлементКонвертации ССЫЛКА Справочник.ПравилаКонвертацииОбъектов ИЛИ ";
		 КонецЕсли;
		 Если ПараметрыВыполнения.ЗахватитьПКПД Тогда
			 ТекстУсловие = "Состав.ЭлементКонвертации ССЫЛКА Справочник.ПравилаКонвертацииПредопределенныхДанных ИЛИ ";
		 КонецЕсли;
		 Если ПараметрыВыполнения.ЗахватитьАлгоритмы Тогда
			 ТекстУсловие = "Состав.ЭлементКонвертации ССЫЛКА Справочник.Алгоритмы ИЛИ ";
		 КонецЕсли;
		 ТекстУсловие = Лев(ТекстУсловие, СтрДлина(ТекстУсловие) - 4);
		 ТекстУсловие= "И (" + ТекстУсловие + ")";
	 КонецЕсли;
	 Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие%", ТекстУсловие);
	 Запрос.УстановитьПараметр("Конвертация", ПараметрыВыполнения.Конвертация);
	 Выборка = Запрос.Выполнить().Выбрать();
	 КОбработке = Новый СписокЗначений;
	 Пока Выборка.Следующий() Цикл
		 КОбработке.Добавить(Выборка.Ссылка);
	 КонецЦикла; 
	 Возврат КОбработке;
КонецФункции
#КонецОбласти

#КонецЕсли