#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьОписание(Команда)
	Если ПроверитьЗаполнение() = Ложь Тогда
		Возврат;
	КонецЕсли;
	СкопироватьОписаниеНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СкопироватьОписаниеНаСервере()
	ТекстЗапросаОписание = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.Описания
	|ГДЕ НомерВерсииФормата = &НомерВерсии";
	// Поиск описания исходного.
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОписание;
	Запрос.УстановитьПараметр("НомерВерсии", СокрЛП(Объект.ВерсияИсточник.Наименование));
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не найдено описание для исходной версии формата'") + ": " + Объект.ВерсияИсточник);
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ИсходноеОписание = Выборка.Ссылка;
	
	// Поиск и заполнение описания нового.
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОписание;
	Запрос.УстановитьПараметр("НомерВерсии", СокрЛП(Объект.ВерсияПолучатель.Наименование));
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОписаниеОбъект = Справочники.Описания.СоздатьЭлемент();
		ОписаниеОбъект.Наименование = СокрЛП(Объект.ВерсияПолучатель.Наименование);
		ОписаниеОбъект.НомерВерсииФормата = СокрЛП(Объект.ВерсияПолучатель.Наименование);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОписаниеОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
	КонецЕсли;
	ОписаниеОбъект.ВыводитьСвойстваОбъектовВИсходномПорядке = ИсходноеОписание.ВыводитьСвойстваОбъектовВИсходномПорядке;
	ОписаниеОбъект.ЗаголовокОписания = Новый ХранилищеЗначения(ИсходноеОписание.ЗаголовокОписания.Получить());
	ОписаниеОбъект.ОформлениеЗаголовков.Очистить();
	Для Каждого Оформление Из ИсходноеОписание.ОформлениеЗаголовков Цикл
		ОформлениеНов = ОписаниеОбъект.ОформлениеЗаголовков.Добавить();
		ОформлениеНов.Уровень = Оформление.Уровень;
		ОформлениеНов.ОбразецОформления = Новый ХранилищеЗначения(Оформление.ОбразецОформления.Получить());
	КонецЦикла;
	ОписаниеОбъект.Записать();
	
	ТекстЗапросаПоискРодителя = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.ЭлементыОписания
	|ГДЕ Владелец = &ОписаниеНов И ТипЭлемента = &ТипЭлемента 
	|	И ОбъектФормата = &ОбъектФормата И УровеньЗаголовка = &УровеньЗаголовка";
	
	// Копирование элементов описания.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭлементыСтар.Ссылка,
	|	ЭлементыСтар.Порядок,
	|	ЭлементыСтар.Наименование,
	|	ЭлементыСтар.ТипЭлемента,
	|	ЭлементыСтар.ТекстПростогоОписания,
	|	ЭлементыСтар.ОбъектФормата,
	|	ЭлементыСтар.УровеньЗаголовка,
	|	ЭлементыСтар.Родитель КАК Родитель
	|ИЗ Справочник.ЭлементыОписания КАК ЭлементыСтар
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.ОбъектыФормата КАК Объекты
	|ПО Объекты.Наименование = ЭлементыСтар.ОбъектФормата
	|	И Объекты.Владелец = &ВерсияФормата
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Справочник.ЭлементыОписания КАК ЭлементыНов
	|ПО ЭлементыНов.Владелец = &ОписаниеНов
	|	И ЭлементыНов.ОбъектФормата = ЭлементыСтар.ОбъектФормата
	|	И ЭлементыНов.ТипЭлемента = ЭлементыСтар.ТипЭлемента
	|	И ЭлементыНов.УровеньЗаголовка = ЭлементыСтар.УровеньЗаголовка
	|ГДЕ ЭлементыСтар.Владелец = &ОписаниеСтар
	|	И ЭлементыНов.Ссылка IS NULL
	|	И (ЭлементыСтар.ОбъектФормата = """" ИЛИ Объекты.Ссылка IS NOT NULL)
	|УПОРЯДОЧИТЬ ПО ЭлементыСтар.Ссылка ИЕРАРХИЯ, ЭлементыСтар.Порядок, ЭлементыСтар.Наименование";
	Запрос.УстановитьПараметр("ОписаниеНов", ОписаниеОбъект.Ссылка);
	Запрос.УстановитьПараметр("ОписаниеСтар", ИсходноеОписание);
	Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияПолучатель);

	ТекущийРодитель = Новый Соответствие();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементНов = Справочники.ЭлементыОписания.СоздатьЭлемент();
		ЭлементНов.Владелец = ОписаниеОбъект.Ссылка;
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			ЭлементНов.Родитель = ТекущийРодитель.Получить(Выборка.Родитель);
			Если НЕ ЗначениеЗаполнено(ЭлементНов.Родитель) Тогда
				ЗапросПоиск = Новый Запрос;
				ЗапросПоиск.Текст = ТекстЗапросаПоискРодителя;
				ЗапросПоиск.УстановитьПараметр("ОписаниеНов", ОписаниеОбъект.Ссылка);
				ДанныеРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Родитель, "ТипЭлемента, ОбъектФормата, УровеньЗаголовка");
				ЗапросПоиск.УстановитьПараметр("ТипЭлемента", ДанныеРодителя.ТипЭлемента);
				ЗапросПоиск.УстановитьПараметр("ОбъектФормата", ДанныеРодителя.ОбъектФормата);
				ЗапросПоиск.УстановитьПараметр("УровеньЗаголовка", ДанныеРодителя.УровеньЗаголовка);
				ВыборкаПоиск = ЗапросПоиск.Выполнить().Выбрать();
				Если ВыборкаПоиск.Следующий() Тогда
					ЭлементНов.Родитель = ВыборкаПоиск.ссылка;
					ТекущийРодитель.Вставить(Выборка.Родитель, ВыборкаПоиск.Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементНов, Выборка,"Порядок, ТипЭлемента, ОбъектФормата, УровеньЗаголовка, Наименование");
		ЭлементНов.ТекстПростогоОписания = Новый ХранилищеЗначения(Выборка.ТекстПростогоОписания.Получить());
		Если Выборка.ТипЭлемента = Перечисления.ТипыЭлементовОписания.ОписаниеОбъектаФормата Тогда
			СкопироватьОписанияРеквизитов(ЭлементНов, Выборка.Ссылка, Выборка.ОбъектФормата);
		КонецЕсли;
		Если Выборка.ТипЭлемента = Перечисления.ТипыЭлементовОписания.Типы Тогда
			СкопироватьОписанияТипов(ЭлементНов, Выборка.Ссылка);
		КонецЕсли;
		ЭлементНов.Записать();
		ТекущийРодитель.Вставить(Выборка.Ссылка, ЭлементНов.Ссылка);
	КонецЦикла;
КонецПроцедуры

Процедура СкопироватьОписанияРеквизитов(ЭлементНов, ЭлементСтар, ОбъектФормата)
	ТекстЗапросаРеквизитШапки = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.СвойстваФормата
	|ГДЕ Владелец.Владелец = &ВерсияФормата И Владелец.Наименование = &ОбъектФормата И НЕ ПометкаУдаления
	|	И ЭтоГруппа = &ЭтоГруппа";
	
	ТекстЗапросаРеквизитТЧ = "ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ Справочник.СвойстваФормата
	|ГДЕ Владелец.Владелец = &ВерсияФормата И Владелец.Наименование = &ОбъектФормата
	|	И ЭтоГруппа = Ложь И Родитель.Наименование = &ИмяТЧ";
	Для Каждого СтрокаТЧ Из ЭлементСтар.ОписанияРеквизитовШапки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТекстОписания) Тогда
			Продолжить;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаРеквизитШапки;
		Запрос.УстановитьПараметр("ЭтоГруппа", СтрокаТЧ.ЭтоГруппа); 
		Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияПолучатель);
		Запрос.УстановитьПараметр("ОбъектФормата", ОбъектФормата);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		НовСтрокаТЧ = ЭлементНов.ОписанияРеквизитовШапки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, СтрокаТЧ);
	КонецЦикла; 
	Для Каждого СтрокаТЧ Из ЭлементСтар.ОписанияРеквизитовТабличнойЧасти Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТекстОписания) Тогда
			Продолжить;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаРеквизитТЧ;
		Запрос.УстановитьПараметр("ИмяТЧ", СтрокаТЧ.НаименованиеТЧ); 
		Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияПолучатель);
		Запрос.УстановитьПараметр("ОбъектФормата", ОбъектФормата);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		НовСтрокаТЧ = ЭлементНов.ОписанияРеквизитовТабличнойЧасти.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

Процедура СкопироватьОписанияТипов(ЭлементНов, ЭлементСтар)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТипыФормата.Ссылка КАК Тип,
	|	ОписанияТипов.ТекстОписания КАК ТекстОписания,
	|	ТипыФормата.БазовыйТип КАК БазовыйТип,
	|	ТипыФормата.ПространствоИмен КАК ПространствоИмен
	|ИЗ Справочник.ЭлементыОписания.ОписанияТипов КАК ОписанияТипов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыФормата КАК ТипыФормата
	|ПО ОписанияТипов.Тип.Наименование = ТипыФормата.Наименование
	|	И ТипыФормата.Владелец = &ВерсияФормата
	|	И ТипыФормата.ПометкаУдаления = ЛОЖЬ
	|ГДЕ ОписанияТипов.Ссылка = &ЭлементОписания
	|УПОРЯДОЧИТЬ ПО ОписанияТипов.НомерСтроки";
	Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияПолучатель);
	Запрос.УстановитьПараметр("ЭлементОписания", ЭлементСтар);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрокаТЧ = ЭлементНов.ОписанияТипов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, Выборка);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
