#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииБсп
// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена	= Истина;
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса 				= Ложь;
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки	= Истина;
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	КраткаяИнформацияПоОбмену = НСтр("ru = 'ru = 'Позволяет создать рабочее место КД.''");
	ПодробнаяИнформацияПоОбмену = "ПланОбмена.РабочиеМеста.Форма.ПодробнаяИнформация";
	
	ОписаниеВарианта.ПутьКФайлуКомплектаПравилНаПользовательскомСайте	= "";
	ОписаниеВарианта.ПутьКФайлуКомплектаПравилВКаталогеШаблонов 		= "";
	ОписаниеВарианта.ИмяФормыСозданияНачальногоОбраза 					= "";
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными 			= Истина;
	ОписаниеВарианта.КраткаяИнформацияПоОбмену 							= КраткаяИнформацияПоОбмену;
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену 						= ПодробнаяИнформацияПоОбмену;
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника 						= НСтр("ru='Настройки обмена для рабочего места КД'");

	
	ОписаниеВарианта.Вставить("ЗаголовокКомандыДляСозданияНовогоОбменаДанными", НСтр("ru = 'Рабочее место КД'"));
	ОписаниеВарианта.Вставить("ЗаголовокПомощникаСозданияОбмена",               НСтр("ru = 'Настройка рабочего места КД'"));
	ОписаниеВарианта.Вставить("ЗаголовокУзлаПланаОбмена",                       НСтр("ru = 'Рабочее место КД'"));

	Транспорт = Новый Массив;
	Транспорт.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	Транспорт.Добавить(Перечисления.ВидыТранспортаСообщенийОбмена.FTP);
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = Транспорт;

КонецПроцедуры


#Область НастройкиПоУмолчанию

// Возвращает структуру отборов на узле плана обмена с установленными значениями по умолчанию;
// Структура настроек повторяет состав реквизитов шапки и табличных частей плана обмена;
// Для реквизитов шапки используются аналогичные по ключу и значению элементы структуры,
// а для табличных частей используются структуры,
// содержащие массивы значений полей табличных частей плана обмена.
// 
// Параметры:
//  ВерсияКорреспондента - Строка - Номер версии корреспондента. Используется, например,
//                         для разного состава настроек на узле для разных версий корреспондента.
//  ИмяФормы - Строка - Имя используемой формы настройки узла. Возможно, например,
//                         использование различных форм для разных версий корреспондента.
//  IDНастройки - Строка - имя дополнительной настройки обмена.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура - структура отборов на узле плана обмена.
// 
Функция НастройкаОтборовНаУзле(ВерсияКорреспондента, ИмяФормы, IDНастройки = "") Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Возвращает структуру значений по умолчанию для узла;
// Структура настроек повторяет состав реквизитов шапки плана обмена;
// Для реквизитов шапки используются аналогичные по ключу и значению элементы структуры.
// 
// Параметры:
//  ВерсияКорреспондента - Строка - Номер версии корреспондента. Используется, например,
//                         для разного состава настроек на узле для разных версий корреспондента.
//  ИмяФормы - Строка - Имя используемой формы настройки узла. Возможно, например,
//                         использование различных форм для разных версий корреспондента.
//  IDНастройки - Строка - имя дополнительной настройки обмена.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура - структура значений по умолчанию на узле плана обмена.
// 
Функция ЗначенияПоУмолчаниюНаУзле(ВерсияКорреспондента, ИмяФормы, IDНастройки = "") Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Возвращает структуру отборов на узле плана обмена базы корреспондента с установленными значениями по умолчанию;
// Структура настроек повторяет состав реквизитов шапки и табличных частей плана обмена базы корреспондента;
// Для реквизитов шапки используются аналогичные по ключу и значению элементы структуры,
// а для табличных частей используются структуры,
// содержащие массивы значений полей табличных частей плана обмена.
// 
// Параметры:
//  ВерсияКорреспондента - Строка - Номер версии корреспондента. Используется, например, для
//                         разного состава настроек на узле для разных версий корреспондента.
//  ИмяФормы - Строка - Имя используемой формы настройки узла. Возможно, например, использование
//                         различных форм для разных версий корреспондента.
//  IDНастройки - Строка - имя дополнительной настройки обмена.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура - структура отборов на узле плана обмена базы корреспондента.
// 
Функция НастройкаОтборовНаУзлеБазыКорреспондента(ВерсияКорреспондента, ИмяФормы, IDНастройки = "") Экспорт
	
	СтруктураНастроек = Новый Структура;
	Возврат СтруктураНастроек;
	
КонецФункции

// Возвращает структуру значений по умолчанию для узла базы корреспондента;
// Структура настроек повторяет состав реквизитов шапки плана обмена базы корреспондента;
// Для реквизитов шапки используются аналогичные по ключу и значению элементы структуры.
// 
// Параметры:
//  ВерсияКорреспондента - Строка - Номер версии корреспондента. Используется, например,
//                         для разного состава настроек на узле для разных версий корреспондента.
//  ИмяФормы - Строка - Имя используемой формы настройки узла. Возможно, например, 
//                        использование различных форм для разных версий корреспондента.
//  IDНастройки - Строка - имя дополнительной настройки обмена.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура - структура значений по умолчанию на узле плана обмена базы корреспондента.
//
Функция ЗначенияПоУмолчаниюНаУзлеБазыКорреспондента(ВерсияКорреспондента, ИмяФормы, IDНастройки = "") Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецОбласти

#Область ПереопределяемаяНастройкаДополненияВыгрузки

// Возвращает список организаций по таблице отбора (см "ПредставлениеОтбораИнтерактивнойВыгрузки")
// Также используется из демонстрационной формы "НастройкаВыгрузки" этого плана обмена.
//
// Параметры:
//     ТаблицаОтбора - ТаблицаЗначений   - содержит строки с описанием подробных отборов по сценарию узла. Содержит колонки:
//         ПолноеИмяМетаданных - Строка.
//         ВыборПериода        - Булево.
//         Период              - СтандартныйПериод.
//         Отбор               - ОтборКомпоновкиДанных.
//
// Возвращаемое значение:
//     СписокЗначений - значение - ссылка на организацию, представление - наименование.
//
Функция ОрганизацииОтбораИнтерактивнойВыгрузки(Знач ТаблицаОтбора) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Возвращает режим запуска, в случае интерактивного инициирования синхронизации.
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылка - узел для которого выполняется синхронизация.
// Возвращаемое значение:
//  Строка - АвтоматическаяСинхронизация Или ИнтерактивнаяСинхронизация.
//       На основании этих значений запускается либо помощник интерактивного обмена, либо автообмен.
Функция РежимЗапускаСинхронизацииДанных(УзелИнформационнойБазы) Экспорт
	Возврат "ИнтерактивнаяСинхронизация";
КонецФункции

// Возвращает сценарий работы помощника интерактивного сопоставления.
// Параметры:
//  УзелИнформационнойБазы - ПланОбменаСсылка - узел для которого выполняется синхронизация.
// Возвращаемое значение:
//  Строка - НеОтправлять, ИнтерактивнаяСинхронизацияДокументов, 
//           ИнтерактивнаяСинхронизацияСправочников либо пустая строка.
Функция ИнициализироватьСценарийРаботыПомощникаИнтерактивногоОбмена(УзелИнформационнойБазы) Экспорт
	
	Возврат "";
	
КонецФункции

// Функция возвращает имя обработки выгрузки данных.
//  Возвращаемое значение:
//   Строка - Имя обработки выгрузки данных.
Функция ИмяОбработкиВыгрузки() Экспорт
	
	Возврат "";
	
КонецФункции // ИмяОбработкиВыгрузки()

// Функция возвращает имя обработки загрузки данных.
//  Возвращаемое значение:
//   Строка - Имя обработки загрузки данных.
//
Функция ИмяОбработкиЗагрузки() Экспорт
	
	Возврат "";
	
КонецФункции // ИмяОбработкиЗагрузки()

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли