#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
	Если Объект.ИсточникЗагрузки = -1 Тогда
		Объект.ИсточникЗагрузки = 3;
	КонецЕсли;
	Если НЕ Объект.СоздатьНовуюКонвертацию Тогда
		ПриОткрытииСервер();
		Если ИспользоватьРазделениеМодуля И (Объект.ИсточникЗагрузки = 0 Или Объект.ИсточникЗагрузки = 1) Тогда
			Объект.ИсточникЗагрузки = 3;
		КонецЕсли;
	ИначеЕсли Объект.ИсточникЗагрузки = 0 Тогда
		Объект.ИсточникЗагрузки = 3;
	КонецЕсли; 
	Если ИспользоватьРазделениеМодуля Или Объект.СоздатьНовуюКонфигурацию Или Объект.ОбновлятьМетаданные Тогда
		Элементы.ИсточникЗагрузки_Буфер.Видимость = Ложь;
		Элементы.ИсточникЗагрузки_ТекстовыйФайл.Видимость = Ложь;
	КонецЕсли;
	Элементы.РасположениеФайловНаКлиенте.Доступность = Объект.ИсточникЗагрузки <> 0;
	Элементы.ИмяМенеджераКонвертации.Доступность = (Объект.ИсточникЗагрузки = 2 Или Объект.ИсточникЗагрузки = 3);
	Элементы.ИмяМенеджераКонвертации.АвтоОтметкаНезаполненного = Элементы.ИмяМенеджераКонвертации.Доступность;
	Если ПустаяСтрока(СокрЛП(Объект.ИмяМенеджераКонвертации)) Тогда
		Объект.ИмяМенеджераКонвертации = "МенеджерОбменаЧерезУниверсальныйФормат";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникЗагрузкиПриИзменении(Элемент) 
	Если Объект.ИсточникЗагрузки = 0 Тогда
		Объект.РасположениеФайловНаКлиенте = "";
	КонецЕсли;
	Элементы.ГруппаМенеджерКонвертации.Доступность = (Объект.ИсточникЗагрузки = 2 Или Объект.ИсточникЗагрузки = 3);
	Элементы.ИмяМенеджераКонвертации.АвтоОтметкаНезаполненного = Элементы.ИмяМенеджераКонвертации.Доступность;

	Элементы.РасположениеФайловНаКлиенте.Доступность = Объект.ИсточникЗагрузки <> 0;
КонецПроцедуры

&НаКлиенте
Процедура РасположениеФайловНаКлиентеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НастройкиДиалога = Новый Структура;
	МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент"); 
	Если НЕ ИспользоватьРазделениеМодуля И Объект.ИсточникЗагрузки = 1 Тогда
		СтандартнаяОбработка = Ложь;
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru='Текстовый документ(*.txt)|*.txt'"));
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите файл с модулем менеджера'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "РасположениеФайловНаКлиенте", СтандартнаяОбработка, НастройкиДиалога);
	ИначеЕсли Объект.ИсточникЗагрузки = 2 Тогда
		СтандартнаяОбработка = Ложь;
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru='Файл проекта(project)|*project*'"));
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите файл проекта project'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "РасположениеФайловНаКлиенте", СтандартнаяОбработка, НастройкиДиалога);
	Иначе
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите каталог с данными для загрузки'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайловогоКаталога(Объект, "РасположениеФайловНаКлиенте", СтандартнаяОбработка, НастройкиДиалога);
	КонецЕсли; 
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы  
&НаКлиенте
Процедура ОК(Команда)
	ОписаниеРезультата = "";
	Если Объект.ИсточникЗагрузки <> 0 И НЕ ЗначениеЗаполнено(Объект.РасположениеФайловНаКлиенте) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран каталог для загрузки'")); 
		Возврат;
	КонецЕсли;
	Если (Объект.ИсточникЗагрузки = 2 Или Объект.ИсточникЗагрузки = 3) И НЕ ЗначениеЗаполнено(Объект.ИмяМенеджераКонвертации) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указано имя менеджера конвертации'")); 
		Возврат;
	КонецЕсли;
	Если Объект.ИсточникЗагрузки = 0  Тогда
		ОписаниеРезультата = НСтр("ru='Выполняется загрузка из буфера обмена'");
	ИначеЕсли Объект.ИсточникЗагрузки = 1 Тогда
		ОписаниеРезультата = НСтр("ru='Выполняется загрузка из текстового файла: %1'");
	Иначе
		ОписаниеРезультата = НСтр("ru='Выполняется загрузка из %2, каталог: %1'");
	КонецЕсли;
	ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%1", СокрЛП(Объект.РасположениеФайловНаКлиенте));
	Если Объект.ИсточникЗагрузки >= 2 Тогда
		ОписаниеРезультата = СтрЗаменить(ОписаниеРезультата, "%2", ?(Объект.ИсточникЗагрузки = 3, "XML", "EDT")); 
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеРезультата", ОписаниеРезультата); 
	Результат.Вставить("ИмяМенеджераКонвертации", Объект.ИмяМенеджераКонвертации);
	Результат.Вставить("ИсточникЗагрузки", Объект.ИсточникЗагрузки);
	Результат.Вставить("РасположениеФайловНаКлиенте", Объект.РасположениеФайловНаКлиенте);
	Закрыть(Результат);
 КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 
&НаСервере
Процедура ПриОткрытииСервер()
	ИспользоватьРазделениеМодуля = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ИспользоватьРазделениеМодуля");
КонецПроцедуры

#КонецОбласти