
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Конвертация") Тогда
		Объект.Конвертация = Параметры.Конвертация;
		КонвертацияПриИзмененииСервер();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИсточникПриемникПометкаУдаления = Истина;
	УстановитьВидимость(); 
	ФлажкиУдаленныеЭлементыПриИзменении(); 
	ФлажкиТипыИсточникаПриемникаПриИзменении();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	КонвертацияПриИзмененииСервер();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриемникПометкаУдаленияПриИзменении(Элемент)
	ФлажкиУдаленныеЭлементыПриИзменении();
КонецПроцедуры


&НаКлиенте
Процедура ИсточникПриемникСПрефиксомУдалитьПриИзменении(Элемент)
	ФлажкиУдаленныеЭлементыПриИзменении();
КонецПроцедуры


&НаКлиенте
Процедура ПКСУказаноПКОИМножественныйТипИсточникаПриИзменении(Элемент)
	ФлажкиТипыИсточникаПриемникаПриИзменении();
КонецПроцедуры


&НаКлиенте
Процедура ПКСУказаноПКОИМножественныйТипПриемникаПриИзменении(Элемент)
	ФлажкиТипыИсточникаПриемникаПриИзменении();
КонецПроцедуры


&НаКлиенте
Процедура ПКСУказаноПКОИТипыОтличаютсяПриИзменении(Элемент)
	ФлажкиТипыИсточникаПриемникаПриИзменении();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПерейтиКПравилу(Команда)
	Если РезультатПроверки.ПолучитьЭлементы().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТекПравило = Элементы.РезультатПроверки.ТекущиеДанные.Объект;
	ТипПравила = ТипЗнч(ТекПравило);
	ИмяФормыПравила = "";
	Если ТипПравила = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда
		ИмяФормыПравила = "Справочник.ПравилаОбработкиДанных.Форма.ФормаЭлемента";
	ИначеЕсли ТипПравила = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		ИмяФормыПравила = "Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента"; 
	ИначеЕсли ТипПравила = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда
		Если ЭтоКонвертацияXDTO Тогда
			ИмяФормыПравила = "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXDTO";
		Иначе
			ИмяФормыПравила = "Справочник.ПравилаКонвертацииПредопределенныхДанных.Форма.ФормаЭлементаXML"; 
		КонецЕсли;
	ИначеЕсли ТипПравила = Тип("СправочникСсылка.ПравилаКонвертацииСвойств") Тогда
		ИмяФормыПравила = "Справочник.ПравилаКонвертацииСвойств.Форма.ФормаЭлемента";
	ИначеЕсли ТипПравила = Тип("СправочникСсылка.Объекты") Тогда
		ИмяФормыПравила = "Справочник.Объекты.Форма.ФормаЭлемента";
	КонецЕсли;
	Если НЕ ПустаяСтрока(ИмяФормыПравила) Тогда
		ОткрытьФорму(ИмяФормыПравила, Новый Структура("Ключ", ТекПравило));
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура Проверить(Команда)
	Если ПроверитьЗаполнение() = Ложь Тогда
		Возврат;
	КонецЕсли;
	ПроверкиВыбраны = Ложь;
	Если ЭтоКонвертацияXDTO Тогда
		ПКСУказаноПКОИМножественныйТипИсточника = Ложь;
		ПКСУказаноПКОИМножественныйТипПриемника = Ложь;
		ПКСУказаноПКОИТипыОтличаются = Ложь;
	Иначе
		ПроверкиВыбраны = ПКСУказаноПКОИМножественныйТипИсточника 
			Или ПКСУказаноПКОИМножественныйТипПриемника
			Или ПКСУказаноПКОИТипыОтличаются;			
	КонецЕсли;
	ПроверкиВыбраны = ПроверкиВыбраны Или ИсточникПриемникПометкаУдаления Или ИсточникПриемникСПрефиксомУдалить;
	ПроверкиВыбраны = ПроверкиВыбраны Или ИсточникНеВходитВПланОбмена Или ИсточникНеВходитВПодпискуНаСобытие Или ИмеютсяНеСопоставленныеЗначения;
	Если НЕ ПроверкиВыбраны Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбраны проверки'"));
		Возврат;
	ИначеЕсли (ИсточникНеВходитВПланОбмена Или ИсточникНеВходитВПодпискуНаСобытие)
		И НЕ ЗначениеЗаполнено(ПланОбмена) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран план обмена для конвертации'"));
		Возврат; 
	КонецЕсли;
	ПроверитьСервер();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура КонвертацияПриИзмененииСервер()
	ДанныеКонвертации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Конвертация, "ТипКонвертации, Конфигурация");
	ЭтоКонвертацияXDTO = (ДанныеКонвертации.ТипКонвертации = Перечисления.ТипыКонвертаций.XDTO);
	// Список планов обмена.
	Элементы.ПланОбмена.СписокВыбора.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ Справочник.Объекты 
	|ГДЕ Владелец = &Конфигурация И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектов.ПланОбмена)
	|	И НЕ ПометкаУдаления";
	Запрос.УстановитьПараметр("Конфигурация", ДанныеКонвертации.Конфигурация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ПланОбмена.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ПроверкаТиповИсточникаИПриемника.Видимость = НЕ ЭтоКонвертацияXDTO;
КонецПроцедуры

&НаСервере
Процедура ПроверитьСервер()
	ДеревоОшибки = Новый ДеревоЗначений;
	ДеревоОшибки.Колонки.Добавить("Объект");
	ДеревоОшибки.Колонки.Добавить("Информация");
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Если ЭтоКонвертацияXDTO Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|ВерсияФормата
		|ПОМЕСТИТЬ ВерсииФормата
		|ИЗ Справочник.Конвертации.ВерсииФормата
		|ГДЕ Ссылка = &Конвертация";
		Запрос.Выполнить();
	КонецЕсли;
	КлючиПоиска = Новый Соответствие;
	
	Если ИсточникПриемникПометкаУдаления Или ИсточникПриемникСПрефиксомУдалить Тогда
		ПроверитьПОД(МенеджерВТ, КлючиПоиска, ДеревоОшибки);
		ПроверитьПКО(МенеджерВТ, КлючиПоиска, "ПравилаКонвертацииОбъектов", ДеревоОшибки);
		ПроверитьПКО(МенеджерВТ, КлючиПоиска, "ПравилаКонвертацииПредопределенныхДанных", ДеревоОшибки);
		ПроверитьПКЗ(МенеджерВТ, КлючиПоиска, ДеревоОшибки);
	КонецЕсли;
	ПроверитьПКС(МенеджерВТ, КлючиПоиска, ДеревоОшибки);
	
	Если ИсточникНеВходитВПланОбмена Или ИсточникНеВходитВПодпискуНаСобытие Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
		Запрос.Текст = "ВЫБРАТЬ
		|	Объект.Ссылка КАК Правило,
		|	Объект.ОбъектВыборки КАК ОбъектКонфигурации,
		|	ВЫРАЗИТЬ(Объект.ОбъектВыборки КАК Справочник.Объекты).Владелец КАК ВладелецОбъекта,
		|	ВЫРАЗИТЬ(Объект.ОбъектВыборки КАК Справочник.Объекты).Наименование КАК НаименованиеОбъекта,
		|	ВЫРАЗИТЬ(Объект.ОбъектВыборки КАК Справочник.Объекты).Имя КАК ИмяОбъекта
		|ПОМЕСТИТЬ ПОДДляОтправки
		|ИЗ Справочник.ПравилаОбработкиДанных КАК Объект
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
		|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
		|	И (Объект.Захвачен = ЛОЖЬ
		|	ИЛИ Объект.Копия = ИСТИНА)
		|	И Объект.ИспользоватьДляОтправки = ИСТИНА
		|";
		Запрос.Выполнить();
		Если ИсточникНеВходитВПланОбмена Тогда
			ПроверитьСоставПланаОбмена(МенеджерВТ, КлючиПоиска, ДеревоОшибки);
		КонецЕсли;

		Если ИсточникНеВходитВПодпискуНаСобытие Тогда
			ПроверитьПодпискиНаСобытие(МенеджерВТ, КлючиПоиска, ДеревоОшибки);
		КонецЕсли;
	КонецЕсли;
	СтрокиПроверки = РезультатПроверки.ПолучитьЭлементы();
	СтрокиПроверки.Очистить();
	Для Каждого Строка Из ДеревоОшибки.Строки Цикл
		Стр = СтрокиПроверки.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Строка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьПОД(МенеджерВТ, КлючиПоиска, ДеревоОшибки)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
	ТекстЗапроса = "ВЫБРАТЬ
	|	Объект.Ссылка КАК Правило,
	|	Объект.ОбъектВыборки КАК Проблема,
	|	Состав.Ссылка КАК СоставСсылка,
	|	Объект.ОбъектВыборки.ПометкаУдаления КАК ПометкаУдаления,
	|	ИСТИНА КАК ЭтоИсточник,
	|	ЛОЖЬ КАК ЭтоОбъектФормата
	|ИЗ Справочник.ПравилаОбработкиДанных КАК Объект
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
	|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
	|	И Объект.ОбъектВыборки ССЫЛКА Справочник.Объекты
	|	И Объект.ОбъектВыборки <> ЗНАЧЕНИЕ(Справочник.Объекты.ПустаяСсылка)
	|	И (Объект.Захвачен = ЛОЖЬ
	|	ИЛИ Объект.Копия = ИСТИНА)
	|";
	ДополнитьОтборПоУдалению(ТекстЗапроса, "Объект.ОбъектВыборки");
	
	Запрос.Текст = ТекстЗапроса;
	Если ЭтоКонвертацияXDTO Тогда
		ТекстЗапроса = "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Объект.Ссылка КАК Правило,
		|	Объект.ОбъектВыборки КАК Проблема,
		|	Состав.Ссылка КАК СоставСсылка,
		|	ЕстьNULL(ОбъектыФормата.ПометкаУдаления, ИСТИНА) КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ЭтоИсточник,
		|	ИСТИНА КАК ЭтоОбъектФормата 
		|ИЗ Справочник.ПравилаОбработкиДанных КАК Объект
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.ОбъектыФормата КАК ОбъектыФормата
		|ПО ОбъектыФормата.Наименование = Объект.ОбъектВыборки
		|	И ОбъектыФормата.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата)
		|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
		|	И Объект.ИспользоватьДляПолучения
		|	И (ОбъектыФормата.Ссылка IS NULL ИЛИ ОбъектыФормата.Ссылка.ПометкаУдаления = ИСТИНА)
		|	И (Объект.Захвачен = ЛОЖЬ
		|	ИЛИ Объект.Копия = ИСТИНА)";
		Запрос.Текст = Запрос.Текст + ТекстЗапроса;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуВРезультат(Выборка.Правило, Выборка.Проблема, 
			ЗаполнитьПараметрыБулево(Выборка),
			КлючиПоиска, ДеревоОшибки);
		Если ПомечатьНаУдалениеНекорректныеПравила Тогда
			ОбработатьНекорректноеПравило(Выборка.Правило, Выборка.СоставСсылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьПКО(МенеджерВТ, КлючиПоиска, ИмяСправочника, ДеревоОшибки)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
	ТекстЗапроса = "ВЫБРАТЬ
	|	Объект.Ссылка КАК Правило,
	|	Объект.ОбъектКонфигурации КАК Проблема,
	|	Состав.Ссылка КАК СоставСсылка,
	|	Объект.ОбъектКонфигурации.ПометкаУдаления КАК ПометкаУдаления,
	|	ИСТИНА КАК ЭтоИсточник,
	|	ЛОЖЬ КАК ЭтоОбъектФормата
	|ИЗ Справочник.%ИмяСправочника% КАК Объект
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
	|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
	|	И (Объект.Захвачен = ЛОЖЬ
	|	ИЛИ Объект.Копия = ИСТИНА)";
	ДополнитьОтборПоУдалению(ТекстЗапроса, "Объект.ОбъектКонфигурации");
	Запрос.Текст = ТекстЗапроса;
	Если ЭтоКонвертацияXDTO Тогда
		ТекстЗапроса = "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Объект.Ссылка КАК Правило,
		|	Объект.ОбъектФормата КАК Проблема,
		|	Состав.Ссылка КАК СоставСсылка,
		|	ЕстьNULL(ОбъектыФормата.ПометкаУдаления, ИСТИНА) КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ЭтоИсточник,
		|	ИСТИНА КАК ЭтоОбъектФормата 
		|ИЗ Справочник.%ИмяСправочника% КАК Объект
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.ОбъектыФормата КАК ОбъектыФормата
		|ПО ОбъектыФормата.Наименование = Объект.ОбъектФормата
		|	И ОбъектыФормата.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата)
		|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
		|	И (ОбъектыФормата.Ссылка IS NULL ИЛИ ОбъектыФормата.Ссылка.ПометкаУдаления = ИСТИНА)
		|	И (Объект.Захвачен = ЛОЖЬ
		|	ИЛИ Объект.Копия = ИСТИНА)";

	Иначе
		ТекстЗапроса = "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Объект.Ссылка КАК Правило,
		|	Объект.ОбъектКонфигурацииКорреспондент КАК Проблема,
		|	Состав.Ссылка КАК СоставСсылка,
		|	Объект.ОбъектКонфигурацииКорреспондент.ПометкаУдаления КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ЭтоИсточник,
		|	ЛОЖЬ КАК ЭтоОбъектФормата
		|ИЗ Справочник.%ИмяСправочника% КАК Объект
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
		|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
		|	И (Объект.Захвачен = ЛОЖЬ
		|	ИЛИ Объект.Копия = ИСТИНА)";
		ДополнитьОтборПоУдалению(ТекстЗапроса, "Объект.ОбъектКонфигурацииКорреспондент");
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + ТекстЗапроса;
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяСправочника%", ИмяСправочника);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуВРезультат(Выборка.Правило, Выборка.Проблема, 
			ЗаполнитьПараметрыБулево(Выборка),
			КлючиПоиска, ДеревоОшибки);
		Если ПомечатьНаУдалениеНекорректныеПравила Тогда
			ОбработатьНекорректноеПравило(Выборка.Правило, Выборка.СоставСсылка);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ПроверитьПКЗ(МенеджерВТ, КлючиПоиска, ДеревоОшибки)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
	ТекстЗапроса = "ВЫБРАТЬ
	|	Объект.Ссылка КАК Ссылка,
	|	Состав.Ссылка КАК СоставСсылка,
	|	Объект.ОбъектКонфигурации,
	|	Объект.ОбъектФормата,
	|	Объект.ОбъектКонфигурацииКорреспондент
	|ПОМЕСТИТЬ ВсеПКПД
	|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Объект
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
	|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
	|	И (Объект.Захвачен = ЛОЖЬ
	|	ИЛИ Объект.Копия = ИСТИНА)
	|;
	|ВЫБРАТЬ
	|	Объект.Ссылка КАК Правило,
	|	Объект.ЗначениеКонфигурации КАК Проблема,
	|	ВсеПКПД.Ссылка КАК СоставСсылка,
	|	ЕстьNULL(Значение.ПометкаУдаления, ИСТИНА) КАК ПометкаУдаления,
	|	ИСТИНА КАК ЭтоИсточник,
	|	ЛОЖЬ КАК ЭтоОбъектФормата
	|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Объект
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ВсеПКПД КАК ВсеПКПД
	|ПО ВсеПКПД.Ссылка = Объект.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Значения КАК Значение
	|ПО Значение.Наименование = Объект.ЗначениеКонфигурации
	|	И Значение.Владелец = Объект.Ссылка.ОбъектКонфигурации
	|";
	ДополнитьОтборПоУдалению(ТекстЗапроса, "Значение", Истина);
	Запрос.Текст = ТекстЗапроса;
	Если ЭтоКонвертацияXDTO Тогда
		ТекстЗапроса = "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Объект.Ссылка КАК Правило,
		|	Объект.ЗначениеФормата КАК Проблема,
		|	ВсеПКПД.Ссылка КАК СоставСсылка,
		|	ЕстьNULL(ЗначенияФормата.ПометкаУдаления, ИСТИНА) КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ЭтоИсточник,
		|	ИСТИНА КАК ЭтоОбъектФормата 
		|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Объект
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	ВсеПКПД КАК ВсеПКПД
		|ПО ВсеПКПД.Ссылка = Объект.Ссылка
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	Справочник.ЗначенияФормата КАК ЗначенияФормата
		|ПО ЗначенияФормата.Наименование = Объект.ЗначениеФормата
		|	И ЗначенияФормата.Владелец.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата)
		|	И ЗначенияФормата.Владелец.Наименование = Объект.Ссылка.ОбъектФормата
		|ГДЕ (ЗначенияФормата.Ссылка IS NULL ИЛИ ЗначенияФормата.Ссылка.ПометкаУдаления = ИСТИНА)
		|";
	Иначе
		ТекстЗапроса = "
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Объект.Ссылка КАК Правило,
		|	Объект.ЗначениеКонфигурацииКорреспондент КАК Проблема,
		|	ВсеПКПД.Ссылка КАК СоставСсылка,
		|	ВЫБОР КОГДА Значение.Ссылка IS NULL ТОГДА
		|		ИСТИНА
		|	ИНАЧЕ Значение.ПометкаУдаления
		|	КОНЕЦ 			КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ЭтоИсточник,
		|	ЛОЖЬ КАК ЭтоОбъектФормата
		|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Объект
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	ВсеПКПД КАК ВсеПКПД
		|ПО ВсеПКПД.Ссылка = Объект.Ссылка
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Значения КАК Значение
		|ПО Значение.Наименование = Объект.ЗначениеКонфигурацииКорреспондент
		|	И Значение.Владелец = Объект.Ссылка.ОбъектКонфигурацииКорреспондент
		|";
		ДополнитьОтборПоУдалению(ТекстЗапроса, "Значение", Истина);
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуВРезультат(Выборка.Правило, Выборка.Проблема, 
			ЗаполнитьПараметрыБулево(Выборка),
			КлючиПоиска, ДеревоОшибки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьПКС(МенеджерВТ, КлючиПоиска, ДеревоОшибки)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
	Запрос.Текст = "ВЫБРАТЬ
	|	ПКС.Ссылка КАК Правило,
	|	ПКС.ПравилоКонвертацииСвойства КАК ПравилоКонвертацииСвойства, 
	|	ПКС.СвойствоКонфигурации КАК СвойствоКонфигурации,
	|	ПКС.СвойствоФормата КАК СвойствоФормата,
	|	ПКС.Владелец.ОбъектФормата КАК ОбъектФормата,
	|	ПКС.СвойствоКонфигурацииКорреспондента КАК СвойствоКонфигурацииКорреспондента,
	|	ПКС.СвойствоКонфигурации.ПометкаУдаления КАК СвойствоКонфигурацииПометкаУдаления,
	|	ПКС.СвойствоКонфигурацииКорреспондента.ПометкаУдаления КАК СвойствоКонфигурацииКорреспондентаПометкаУдаления,
	|	ПКС.ТипСвойстваКонфигурации КАК ТипСвойстваКонфигурации,
	|	ПКС.ТипСвойстваКонфигурацииКорреспондента КАК ТипСвойстваКонфигурацииКорреспондента
	|ПОМЕСТИТЬ ВсеПКС
	|ИЗ Справочник.ПравилаКонвертацииСвойств КАК ПКС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СоставыКонвертаций КАК Состав
	|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = ПКС.Владелец
	|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И ПКС.ПометкаУдаления = ЛОЖЬ И ПКС.ЭтоГруппа = ЛОЖЬ
	|	И (ПКС.Владелец.Захвачен = ЛОЖЬ
	|	ИЛИ ПКС.Владелец.Копия = ИСТИНА)
	|;
	|";
	Запрос.Выполнить();
	Если ИсточникПриемникПометкаУдаления Или ИсточникПриемникСПрефиксомУдалить Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		ТекстЗапроса = "ВЫБРАТЬ
		|	ПКС.Правило КАК Правило,
		|	ПКС.СвойствоКонфигурации КАК Проблема,
		|	ПКС.СвойствоКонфигурацииПометкаУдаления КАК ПометкаУдаления,
		|	ИСТИНА КАК ЭтоИсточник,
		|	ЛОЖЬ КАК ЭтоОбъектФормата
		|ИЗ ВсеПКС КАК ПКС
		|ГДЕ "; 
		ЕстьУсловие = Ложь;
		Если ИсточникПриемникПометкаУдаления Тогда
			ЕстьУсловие = Истина;
			ТекстЗапроса = ТекстЗапроса + "ПКС.СвойствоКонфигурацииПометкаУдаления = ИСТИНА ";
		КонецЕсли;
		Если ИсточникПриемникСПрефиксомУдалить Тогда
			ТекстЗапроса = ТекстЗапроса + ?(ЕстьУсловие, " ИЛИ ", "") + "ПКС.СвойствоКонфигурации.Наименование ПОДОБНО ""Удалить%""";
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;		
		Если  ЭтоКонвертацияXDTO Тогда
			ТекстЗапроса = "
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	ПКС.Правило КАК Правило,
			|	ПКС.СвойствоФормата КАК Проблема,
			|	ЕстьNULL(СвойстваФормата.ПометкаУдаления, ИСТИНА) КАК ПометкаУдаления,
			|	ЛОЖЬ КАК ЭтоИсточник,
			|	ИСТИНА КАК ЭтоОбъектФормата 
			|ИЗ ВсеПКС КАК ПКС
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Справочник.СвойстваФормата КАК СвойстваФормата
			|ПО СвойстваФормата.Наименование = ПКС.СвойствоФормата
			|	И СвойстваФормата.Владелец.Наименование = ПКС.ОбъектФормата
			|	И СвойстваФормата.Владелец.Владелец В (ВЫБРАТЬ ВерсияФормата ИЗ ВерсииФормата)
			|ГДЕ (СвойстваФормата.Ссылка IS NULL ИЛИ СвойстваФормата.Ссылка.ПометкаУдаления = ИСТИНА)";
		Иначе
			ТекстЗапроса = "
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	ПКС.Правило КАК Правило,
			|	ПКС.СвойствоКонфигурацииКорреспондента КАК Проблема,
			|	ПКС.СвойствоКонфигурацииКорреспондентаПометкаУдаления КАК ПометкаУдаления,
			|	ЛОЖЬ КАК ЭтоИсточник,
			|	ЛОЖЬ КАК ЭтоОбъектФормата
			|ИЗ ВсеПКС КАК ПКС
			|ГДЕ "; 
			ЕстьУсловие = Ложь;
			Если ИсточникПриемникПометкаУдаления Тогда
				ЕстьУсловие = Истина;
				ТекстЗапроса = ТекстЗапроса + "ПКС.СвойствоКонфигурацииКорреспондентаПометкаУдаления = ИСТИНА ";
			КонецЕсли;
			Если ИсточникПриемникСПрефиксомУдалить Тогда
				ТекстЗапроса = ТекстЗапроса + ?(ЕстьУсловие, " ИЛИ ", "") + "ПКС.СвойствоКонфигурацииКорреспондента.Наименование ПОДОБНО ""Удалить%""";
			КонецЕсли;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДобавитьСтрокуВРезультат(Выборка.Правило, Выборка.Проблема, 
				ЗаполнитьПараметрыБулево(Выборка),
				КлючиПоиска, ДеревоОшибки);
		КонецЦикла; 
	КонецЕсли;
	Если ПКСУказаноПКОИМножественныйТипИсточника Или ПКСУказаноПКОИМножественныйТипПриемника Или ПКСУказаноПКОИТипыОтличаются Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		ТекстЗапроса = "";
		ТекстЗапросаПерваяЧасть = "ВЫБРАТЬ
		|	Ссылка КАК Свойство,
		|	ВЫРАЗИТЬ(ТипыСтрокой КАК Строка(100)) КАК ТипСтрокой 
		|ПОМЕСТИТЬ ТипыСвойств
		|ИЗ Справочник.Свойства
		|ГДЕ Ссылка В (ВЫБРАТЬ ПКС.СвойствоКонфигурации ИЗ ВсеПКС КАК ПКС)
		|	ИЛИ Ссылка В (ВЫБРАТЬ ПКС.СвойствоКонфигурацииКорреспондента ИЗ ВсеПКС КАК ПКС)
		|;
		|";
		Если ПКСУказаноПКОИМножественныйТипИсточника Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			|	ПКС.Правило КАК Правило,
			|	ТипыСвойств.ТипСтрокой КАК Проблема1,
			|	NULL КАК Проблема2,
			|	ИСТИНА КАК ЭтоИсточник,
			|	ЛОЖЬ КАК ЭтоИсточникИПриемник
			|ИЗ ВсеПКС КАК ПКС
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыСвойств КАК ТипыСвойств
			|ПО ПКС.СвойствоКонфигурации = ТипыСвойств.Свойство
			|ГДЕ ПКС.ПравилоКонвертацииСвойства <> """"
			|	И ТипыСвойств.ТипСтрокой ПОДОБНО ""%,%""
			|";
		КонецЕсли;
		Если ПКСУказаноПКОИМножественныйТипПриемника Тогда
			ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ") + "
			|ВЫБРАТЬ
			|	ПКС.Правило КАК Правило,
			|	ТипыСвойств.ТипСтрокой КАК Проблема1,
			|	NULL КАК Проблема2,
			|	ЛОЖЬ КАК ЭтоИсточник,
			|	ЛОЖЬ КАК ЭтоИсточникИПриемник
			|ИЗ ВсеПКС КАК ПКС
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыСвойств КАК ТипыСвойств
			|ПО ПКС.СвойствоКонфигурацииКорреспондента = ТипыСвойств.Свойство
			|ГДЕ ПКС.ПравилоКонвертацииСвойства <> """"
			|	И ТипыСвойств.ТипСтрокой ПОДОБНО ""%,%""
			|";
		КонецЕсли;
		Если ПКСУказаноПКОИТипыОтличаются Тогда
			ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ") + "
			|ВЫБРАТЬ
			|	ПКС.Правило КАК Правило,
			|	ТипыСвойствИ.ТипСтрокой КАК Проблема1,
			|	ТипыСвойствК.ТипСтрокой КАК Проблема2,
			|	ЛОЖЬ КАК ЭтоИсточник,
			|	ИСТИНА КАК ЭтоИсточникИПриемник
			|ИЗ ВсеПКС КАК ПКС
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыСвойств КАК ТипыСвойствИ
			|ПО ПКС.СвойствоКонфигурации = ТипыСвойствИ.Свойство
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыСвойств КАК ТипыСвойствК
			|ПО ПКС.СвойствоКонфигурацииКорреспондента = ТипыСвойствК.Свойство
			|ГДЕ ПКС.ПравилоКонвертацииСвойства <> """"
			|	И ТипыСвойствК.ТипСтрокой <> ТипыСвойствИ.ТипСтрокой
			|";
		КонецЕсли;
		Запрос.Текст = ТекстЗапросаПерваяЧасть + ТекстЗапроса;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаДерева = КлючиПоиска.Получить(Выборка.Правило);
			Если СтрокаДерева = Неопределено Тогда
				СтрокаДерева = ДеревоОшибки.Строки.Добавить();
				СтрокаДерева.Объект = Выборка.Правило;
				ПроблемаСтрокойИсходная = "";
			Иначе
				ПроблемаСтрокойИсходная = СтрокаДерева.ПроблемаСтрокой;
			КонецЕсли;
			Если Выборка.ЭтоИсточник Тогда
				ПроблемаСтрокой = НСтр("ru='Указано ПКО и множественный тип источника (%1)'");
			ИначеЕсли Выборка.ЭтоИсточникИПриемник Тогда
				ПроблемаСтрокой = НСтр("ru='Указано ПКО и типы источника и приемника отличаются (%1 / %2)'");
			Иначе
				ПроблемаСтрокой = НСтр("ru='Указано ПКО и множественный тип приемника (%1)'");
			КонецЕсли;
			ПроблемаСтрокой = СтрЗаменить(ПроблемаСтрокой, "%1", СокрЛП(Выборка.Проблема1));
			ПроблемаСтрокой = СтрЗаменить(ПроблемаСтрокой, "%2", СокрЛП(Выборка.Проблема2));
			Если ПустаяСтрока(ПроблемаСтрокойИсходная) Тогда
				СтрокаДерева.Информация = ПроблемаСтрокой;
			Иначе
				СтрокаДерева.Информация = ПроблемаСтрокойИсходная + Символы.ПС + ПроблемаСтрокой;
			КонецЕсли;
			Если ОчищатьПКОВОшибочныхПКС Тогда 
				ПКСОбъект = Выборка.ПРавило.ПолучитьОбъект();
				ПКСОбъект.ПравилоКонвертацииСвойства = "";
				ПКСОбъект.ОбменДанными.Загрузка = Истина;
				ПКСОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ИмеютсяНеСопоставленныеЗначения Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);
		МенеджерВТ = Новый МенеджерВременныхТаблиц; 
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.Текст = "ВЫБРАТЬ
		|	Объект.Ссылка КАК Ссылка,
		|	Состав.Ссылка КАК СоставСсылка,
		|	Объект.ОбъектКонфигурации,
		|	Объект.ОбъектФормата,
		|	Объект.ОбъектКонфигурацииКорреспондент
		|ПОМЕСТИТЬ ВсеПКПД
		|ИЗ Справочник.ПравилаКонвертацииПредопределенныхДанных КАК Объект
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|	Справочник.СоставыКонвертаций КАК Состав
		|ПО Состав.Владелец = &Конвертация И Состав.ЭлементКонвертации = Объект.Ссылка
		|ГДЕ Состав.Отключить = ЛОЖЬ И Состав.ПометкаУдаления = ЛОЖЬ И Объект.ПометкаУдаления = ЛОЖЬ
		|	И (Объект.Захвачен = ЛОЖЬ
		|	ИЛИ Объект.Копия = ИСТИНА)";
		Запрос.Выполнить();
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		ТекстЗапроса = "ВЫБРАТЬ
		|	ВсеПКПД.Ссылка КАК Правило,
		|	НЕСопоставлены.Ссылка КАК Значение,
		|	ИСТИНА КАК ЭтоИсточник,
		|	ЛОЖЬ КАК ЭтоПриемник,
		|	ВЫБОР КОГДА Сопоставление.Ссылка is null ТОГДА ЛОЖЬ
		|	ИНАЧЕ ИСТИНА КОНЕЦ КАК СопоставленИсточник,
		|	ЛОЖЬ КАк СопоставленПриемник
		|ИЗ 
		| Справочник.Значения КАК НеСопоставлены
		|ЛЕВОЕ СОЕДИНЕНИЕ ВсеПКПД КАК ВсеПКПД 
		|ПО ВсеПКПД.ОбъектКонфигурации = НеСопоставлены.Владелец
		|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Сопоставление
		|ПО ВсеПКПД.Ссылка = Сопоставление.Ссылка
		|	И Сопоставление.ЗначениеКонфигурации = НеСопоставлены.Наименование
		|ГДЕ ВсеПКПД.Ссылка.Код is not null
		|ОБЪЕДИНИТЬ ВСЕ
		|"; 
		Если  ЭтоКонвертацияXDTO Тогда
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
			|	ВсеПКПД.Ссылка КАК Правило,
			|	НЕСопоставлены.Ссылка КАК Значение,
			|	ЛОЖЬ КАК ЭтоИсточник,
			|	ИСТИНА КАК ЭтоПриемник,
			|	ЛОЖЬ КАК СопоставленИсточник,
			|	ВЫБОР КОГДА Сопоставление.Ссылка is null ТОГДА ЛОЖЬ
			|	ИНАЧЕ ИСТИНА КОНЕЦ КАК СопоставленПриемник
			|ИЗ 
			| Справочник.ЗначенияФормата КАК НеСопоставлены
			|ЛЕВОЕ СОЕДИНЕНИЕ ВсеПКПД КАК ВсеПКПД 
			|ПО ВсеПКПД.ОбъектФормата = НеСопоставлены.Владелец
			|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Сопоставление
			|ПО ВсеПКПД.Ссылка = Сопоставление.Ссылка
			|	И Сопоставление.ЗначениеФормата = НеСопоставлены.Наименование
			|ГДЕ ВсеПКПД.Ссылка.Код is not null
			|";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
			|	ВсеПКПД.Ссылка КАК Правило,
			|	НЕСопоставлены.Ссылка КАК Значение,
			|	ЛОЖЬ КАК ЭтоИсточник,
			|	ИСТИНА КАК ЭтоПриемник,
			|	ЛОЖЬ КАК СопоставленИсточник,
			|	ВЫБОР КОГДА Сопоставление.Ссылка is null ТОГДА ЛОЖЬ
			|	ИНАЧЕ ИСТИНА КОНЕЦ КАК СопоставленПриемник
			|ИЗ 
			| Справочник.Значения КАК НеСопоставлены
			|ЛЕВОЕ СОЕДИНЕНИЕ ВсеПКПД КАК ВсеПКПД 
			|ПО ВсеПКПД.ОбъектКонфигурацииКорреспондент = НеСопоставлены.Владелец
			|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииПредопределенныхДанных.СопоставлениеЗначений КАК Сопоставление
			|ПО ВсеПКПД.Ссылка = Сопоставление.Ссылка
			|	И Сопоставление.ЗначениеКонфигурацииКорреспондент = НеСопоставлены.Наименование
			|ГДЕ ВсеПКПД.Ссылка.Код is not null
			|";
		КонецЕсли; 
		ТекстЗапроса = "ВЫБРАТЬ
		|	Свод.Правило,
		|	Свод.ЭтоИсточник,
		|	Свод.ЭтоПриемник,
		|	МИНИМУМ(Свод.СопоставленИсточник) КАК СопоставленИсточник,
		|	МИНИМУМ(Свод.СопоставленПриемник) КАК СопоставленПриемник
		|ИЗ (" + ТекстЗапроса + ") КАК Свод
		|СГРУППИРОВАТЬ ПО Свод.Правило, Свод.ЭтоИсточник, Свод.ЭтоПриемник
		|ИТОГИ ПО Свод.Правило";
		Запрос.Текст = ТекстЗапроса;
		ВыборкаПравило = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПравило.Следующий() Цикл 
			Выборка = ВыборкаПравило.Выбрать();
			НеСопоставленИсточник = Ложь;
			НеСопоставленПриемник = Ложь;
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтоИсточник И НЕ Выборка.СопоставленИсточник Тогда
					НеСопоставленИсточник = Истина;
				КонецЕсли;  
				Если Выборка.ЭтоПриемник И НЕ Выборка.СопоставленПриемник Тогда
					НеСопоставленПриемник = Истина;
				КонецЕсли; 
			КонецЦикла; 
			Если НеСопоставленИсточник И НеСопоставленПриемник Тогда
				СтрокаДерева = КлючиПоиска.Получить(ВыборкаПравило.Правило);
				Если СтрокаДерева = Неопределено Тогда
					СтрокаДерева = ДеревоОшибки.Строки.Добавить();
					СтрокаДерева.Объект = ВыборкаПравило.Правило;
					ПроблемаСтрокойИсходная = "";
				Иначе
					ПроблемаСтрокойИсходная = СтрокаДерева.ПроблемаСтрокой;
				КонецЕсли;
				ПроблемаСтрокой = НСтр("ru='Есть несопоставленные значения'");
				Если ПустаяСтрока(ПроблемаСтрокойИсходная) Тогда
					СтрокаДерева.Информация = ПроблемаСтрокой;
				Иначе
					СтрокаДерева.Информация = ПроблемаСтрокойИсходная + Символы.ПС + ПроблемаСтрокой;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоставПланаОбмена(МенеджерВТ, КлючиПоиска, ДеревоОшибки)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	Объект.Правило КАК Правило,
	|	Объект.ОбъектКонфигурации КАК Проблема
	|ИЗ ПОДДляОтправки КАК Объект
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства КАК ДанныеСостава
	|ПО ДанныеСостава.Наименование = Объект.ИмяОбъекта
	|	И ДанныеСостава.Владелец = &ПланОбмена
	|	И ДанныеСостава.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ЭлементСоставаПланаОбмена)
	|ГДЕ ДанныеСостава.Ссылка IS NULL";
	Запрос.УстановитьПараметр("ПланОбмена", ПланОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	ПроблемаСтрокой = НСтр("ru='Источник не входит в состав плана обмена (%2)'");
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуВРезультат(Выборка.Правило, Выборка.Проблема, 
			Новый Структура("ПометкаУдаления, ЭтоИсточник, ЭтоОбъектФормата", Ложь, Истина, Ложь), КлючиПоиска, ДеревоОшибки, ПроблемаСтрокой);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодпискиНаСобытие(МенеджерВТ, КлючиПоиска, ДеревоОшибки)
	ТекстЗапроса = "ВЫБРАТЬ
	|	Объект.Правило КАК Правило,
	|	Объект.ОбъектКонфигурации КАК Проблема
	|ИЗ ПОДДляОтправки КАК Объект
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Свойства КАК ДанныеСостава
	|ПО ДанныеСостава.Наименование = Объект.ИмяОбъекта
	|	И ДанныеСостава.Владелец.Имя = &ИмяПодписки
	|	И ДанныеСостава.Владелец.Владелец = Объект.ВладелецОбъекта
	|	И ДанныеСостава.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСвойств.ИсточникПодпискиНаСобытие)
	|ГДЕ Объект.ОбъектКонфигурации.Тип В (&ТипОбъекта)
	|	И ДанныеСостава.Ссылка IS NULL";
	
	ИмяПланаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланОбмена, "Имя");
	ПроверкиПоТипамМетаданных = Новый Структура;
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.Справочник);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.ПланВидовХарактеристик);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.ПланВидовРасчета);
	ПроверкиПоТипамМетаданных.Вставить(ИмяПланаОбмена + "Регистрация", ТипыОбъектов);
	
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.Документ);
	ПроверкиПоТипамМетаданных.Вставить(ИмяПланаОбмена + "РегистрацияДокумента", ТипыОбъектов);
	
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.РегистрСведений);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.РегистрБухгалтерии);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.РегистрНакопления);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.РегистрРасчета);
	ПроверкиПоТипамМетаданных.Вставить(ИмяПланаОбмена + "РегистрацияНабора", ТипыОбъектов);
	
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.Справочник);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.ПланВидовХарактеристик);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.ПланВидовРасчета);
	ТипыОбъектов.Добавить(Перечисления.ТипыОбъектов.Документ); 
	ПроверкиПоТипамМетаданных.Вставить(ИмяПланаОбмена + "РегистрацияУдаления", ТипыОбъектов);
	
	Для Каждого КлючИЗначение Из ПроверкиПоТипамМетаданных Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("ИмяПодписки", КлючИЗначение.Ключ);
		Запрос.УстановитьПараметр("ТипОбъекта", КлючИЗначение.Значение);
		Выборка = Запрос.Выполнить().Выбрать();
		ПроблемаСтрокой = НСтр("ru='Источник не входит в подписку на событие %1 (%2)'");
		ПроблемаСтрокой = СтрЗаменить(ПроблемаСтрокой, "%1", КлючИЗначение.Ключ);
		Пока Выборка.Следующий() Цикл
			ДобавитьСтрокуВРезультат(Выборка.Правило, Выборка.Проблема, 
				Новый Структура("ПометкаУдаления, ЭтоИсточник, ЭтоОбъектФормата", Ложь, Истина, Ложь), КлючиПоиска, ДеревоОшибки, ПроблемаСтрокой);
		КонецЦикла;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ДополнитьОтборПоУдалению(ТекстЗапроса, ИмяПоля, ДобавитьГде = Ложь)
	ДопУсловие = "";
	Если ИсточникПриемникПометкаУдаления Тогда
		ДопУсловие = "" + ИмяПоля + ".ПометкаУдаления = ИСТИНА";
	КонецЕсли;
	Если ИсточникПриемникСПрефиксомУдалить Тогда
		Если НЕ ПустаяСтрока(ДопУсловие) Тогда
			ДопУсловие = ДопУсловие + Символы.ПС + "ИЛИ ";
		КонецЕсли;
		ДопУсловие = ДопУсловие + "" + ИмяПоля + ".Наименование ПОДОБНО ""Удалить%""";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ?(ДобавитьГде, "ГДЕ ", " И ") + "( " + ДопУсловие + " )";
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВРезультат(Правило, ОбъектПроблема, ЛогическиеПараметры, КлючиПоиска, ДеревоОшибки, ПроблемаСтрокой = "")
	ПометкаУдаления = ЛогическиеПараметры.ПометкаУдаления;
	ЭтоИсточник = ЛогическиеПараметры.ЭтоИсточник;
	ЭтоОбъектФормата = ЛогическиеПараметры.ЭтоОбъектФормата;
	СтрокаДерева = КлючиПоиска.Получить(Правило);
	Если СтрокаДерева = Неопределено Тогда
		СтрокаДерева = ДеревоОшибки.Строки.Добавить();
		СтрокаДерева.Объект = Правило;
		ПроблемаСтрокойИсходная = "";
	Иначе
		ПроблемаСтрокойИсходная = СтрокаДерева.ПроблемаСтрокой;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПроблемаСтрокой) Тогда
		Если ЭтоОбъектФормата Тогда
			ПроблемаСтрокой = НСтр("ru='Объект формата %1 (%2)'");
			ПроблемаСтрокой = СтрЗаменить(ПроблемаСтрокой, "%1", ?(ПометкаУдаления, НСтр("ru='помечен на удаление'"), НСтр("ru='удален'")));
		Иначе
			Если ЭтоИсточник Тогда
				ПроблемаСтрокой = НСтр("ru='Источник %1 (%2)'");
			Иначе
				ПроблемаСтрокой = НСтр("ru='Приемник %1 (%2)'");
			КонецЕсли;
			ПроблемаСтрокой = СтрЗаменить(ПроблемаСтрокой, "%1", ?(ПометкаУдаления, НСтр("ru='помечен на удаление'"), НСтр("ru='с префиксом Удалить'")));
		КонецЕсли;
	КонецЕсли;
	ПроблемаСтрокой = СтрЗаменить(ПроблемаСтрокой, "%2", СокрЛП(ОбъектПроблема));
	Если ПустаяСтрока(ПроблемаСтрокойИсходная) Тогда
		СтрокаДерева.Информация = ПроблемаСтрокой;
	Иначе
		СтрокаДерева.Информация = ПроблемаСтрокойИсходная + Символы.ПС + ПроблемаСтрокой;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьНекорректноеПравило(ПравилоСсылка, СоставСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ ЭлементКонвертации = &Правило И Ссылка <> &СоставСсылка И НЕ ПометкаУдаления И НЕ Отключить";
	Запрос.УстановитьПараметр("Правило", ПравилоСсылка);
	Запрос.УстановитьПараметр("СоставСсылка", СоставСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Надо пометить на удаление само правило.
		ПравилоОбъект = ПравилоСсылка.ПолучитьОбъект();
		ПравилоОбъект.ОбменДанными.Загрузка = Истина;
		ПравилоОбъект.УстановитьПометкуУдаления(Истина);
		ПравилоОбъект.Записать();
	КонецЕсли;
	// Надо исключить правило из состава конвертации.
	СоставОбъект = СоставСсылка.ПолучитьОбъект();
	СоставОбъект.ОбменДанными.Загрузка = Истина;
	СоставОбъект.Отключить = Истина;
	СоставОбъект.УстановитьПометкуУдаления(Истина);
	СоставОбъект.Записать();
КонецПроцедуры

Функция ЗаполнитьПараметрыБулево(Выборка)
	Результат = Новый Структура("ПометкаУдаления, ЭтоИсточник, ЭтоОбъектФормата");
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ФлажкиУдаленныеЭлементыПриИзменении()
	Элементы.ПомечатьНаУдалениеНекорректныеПравила.Доступность = ИсточникПриемникПометкаУдаления Или ИсточникПриемникСПрефиксомУдалить;
	Если ПомечатьНаУдалениеНекорректныеПравила И НЕ (ИсточникПриемникПометкаУдаления Или ИсточникПриемникСПрефиксомУдалить) Тогда
		ПомечатьНаУдалениеНекорректныеПравила = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФлажкиТипыИсточникаПриемникаПриИзменении()
	Элементы.ОчищатьПКОВОшибочныхПКС.Доступность = ПКСУказаноПКОИМножественныйТипИсточника Или ПКСУказаноПКОИМножественныйТипПриемника Или ПКСУказаноПКОИТипыОтличаются;
	Если ОчищатьПКОВОшибочныхПКС И НЕ (ПКСУказаноПКОИМножественныйТипИсточника Или ПКСУказаноПКОИМножественныйТипПриемника Или ПКСУказаноПКОИТипыОтличаются) Тогда
		ОчищатьПКОВОшибочныхПКС = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
