
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьМодуль(Команда)
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	СформироватьМодульНаСервере();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьМодульНаСервере()
	Результат = Обработки.ВыгрузкаОбработчиковXML.ПолучитьТекстОбработчиков(Объект.Конвертация, Объект.ЭтоВыгрузка, Объект.ТолькоИспользуемые);
	ТекстМодуля.УстановитьТекст(Результат); 	
КонецПроцедуры
#КонецОбласти