#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ВариантЗагрузкиДвижений = 1;
	Если Параметры.Свойство("парКонфигурация") И ЗначениеЗаполнено(Параметры.парКонфигурация) Тогда
		Объект.Конфигурация = Параметры.ПарКонфигурация;
		СпособЗагрузки = 1;
		Если Параметры.Свойство("ИсточникДанных") Тогда
			Объект.ИсточникДанных = Параметры.ИсточникДанных;
		КонецЕсли;
		Если Параметры.Свойство("КаталогЗагрузки") Тогда
			Объект.ИмяКаталогаЗагрузки = Параметры.КаталогЗагрузки;
		КонецЕсли;
		Если Параметры.Свойство("ВариантЗагрузкиДвижений") Тогда
			Объект.ВариантЗагрузкиДвижений = Параметры.ВариантЗагрузкиДвижений;
		КонецЕсли;

		Если Параметры.Свойство("ЕстьРасширения") Тогда
			Объект.ЕстьРасширения = Параметры.ЕстьРасширения;
			Если Параметры.ЕстьРасширения И Параметры.Свойство("Расширения") Тогда
				Для Каждого ИмяКаталога Из Параметры.Расширения Цикл
					НовСтрока = Объект.Расширения.Добавить();
					НовСтрока.ИмяКаталогаЗагрузки = ИмяКаталога;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		СпособЗагрузки = 1;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяКаталогаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.ИсточникДанных = 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораКаталога", ЭтотОбъект, Новый Структура("ВыборРасширения", Ложь));
		ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Если ЗначениеЗаполнено(Объект.ИмяКаталогаЗагрузки) Тогда
			ДиалогВыбора.Каталог = Объект.ИмяКаталогаЗагрузки;
		КонецЕсли;
		ДиалогВыбора.Показать(Оповещение);
	Иначе
		НастройкиДиалога = Новый Структура;
		МодульОбменДаннымиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбменДаннымиКлиент"); 
		НастройкиДиалога.Вставить("Фильтр", НСтр("ru='Файл проекта(project)|*project*'"));
		НастройкиДиалога.Вставить("Заголовок", НСтр("ru='Выберите файл проекта project'"));
		МодульОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект, "ИмяКаталогаЗагрузки", СтандартнаяОбработка, НастройкиДиалога);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасширенияИмяКаталогаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораКаталога", ЭтотОбъект, Новый Структура("ВыборРасширения", Истина));
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ТекКаталог = Элементы.Расширения.ТекущиеДанные.ИмяКаталогаЗагрузки;
	Если ЗначениеЗаполнено(ТекКаталог) Тогда
		ДиалогВыбора.Каталог = ТекКаталог;
	КонецЕсли;
	ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура СпособЗагрузкиПриИзменении(Элемент)
	Если СпособЗагрузки = 0 Тогда
		Объект.ТолькоДобавлятьНовые = Ложь;
		Объект.ТолькоОбновитьПланыОбмена = Ложь;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЕстьРасширенияПриИзменении(Элемент)
	УстановитьВидимость();
	 
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	Объект.ИмяКаталогаЗагрузки = "";
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ИмяКаталогаЗагрузки) Тогда
		Если Объект.ИсточникДанных = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран каталог со структурой конфигурации'"));
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран файл проекта EDT project'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Если СпособЗагрузки = 1 И НЕ ЗначениеЗаполнено(Объект.Конфигурация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрана конфигурация для загрузки'"));
		Возврат;
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Ожидание;
	ИзменитьДоступностьЭлементовФормы(Ложь);
	ПодготовитьФайлыДляСервераНачало(); 
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Функция ИтерацияПодготовкиФайлов(КаталогЗагрузки, ЭтоРасширение)
	КаталогиДляОбработки = Новый Массив;
	Если Объект.ТолькоОбновитьПланыОбмена Тогда
		КаталогиДляОбработки.Добавить("ExchangePlans");
	Иначе
		КаталогиДляОбработки.Добавить("Catalogs");
		КаталогиДляОбработки.Добавить("Documents");
		КаталогиДляОбработки.Добавить("Enums");
		КаталогиДляОбработки.Добавить("Tasks");
		КаталогиДляОбработки.Добавить("BusinessProcesses");
		КаталогиДляОбработки.Добавить("ChartsOfAccounts");
		КаталогиДляОбработки.Добавить("ChartsOfCalculationTypes");
		КаталогиДляОбработки.Добавить("ChartsOfCharacteristicTypes");
		КаталогиДляОбработки.Добавить("AccountingRegisters");
		КаталогиДляОбработки.Добавить("AccumulationRegisters");
		КаталогиДляОбработки.Добавить("CalculationRegisters");
		КаталогиДляОбработки.Добавить("InformationRegisters");
		КаталогиДляОбработки.Добавить("ExchangePlans");
		КаталогиДляОбработки.Добавить("EventSubscriptions");
		КаталогиДляОбработки.Добавить("Constants");
		КаталогиДляОбработки.Добавить("DefinedTypes");
		КаталогиДляОбработки.Добавить("CommonAttributes");
		Если Объект.ИсточникДанных = 1 Тогда
			КаталогиДляОбработки.Добавить("Configuration");
		КонецЕсли;
	КонецЕсли;
	РазделительПути = СокрЛП(ПолучитьРазделительПути());
	КоличествоФайловДляОбработки = КаталогиДляОбработки.Количество();

	Если НЕ Объект.ТолькоОбновитьПланыОбмена Тогда
		КоличествоФайловДляОбработки = КоличествоФайловДляОбработки + 1;
		ОбновитьКоличествоФайловКаталога(КаталогЗагрузки, КоличествоФайловДляОбработки);
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект, Новый Структура("ЭтоРасширение, ИмяКаталога, КаталогЗагрузки", ЭтоРасширение, "", КаталогЗагрузки));
		Если Объект.ИсточникДанных = 0 Тогда
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + "Constants","*.xml",Ложь);
		Иначе
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + "Constants","*.mdo",Истина);
		КонецЕсли;
	Иначе
		ОбновитьКоличествоФайловКаталога(КаталогЗагрузки, КоличествоФайловДляОбработки);
	КонецЕсли;

	Для Каждого ИмяКаталога Из КаталогиДляОбработки Цикл
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект, Новый Структура("ЭтоРасширение, ИмяКаталога, КаталогЗагрузки", ЭтоРасширение, ИмяКаталога, КаталогЗагрузки));
		Если Объект.ИсточникДанных = 0 Тогда
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + ИмяКаталога,"*.xml",Ложь);

			Если ИмяКаталога = "ExchangePlans" Тогда
				// Файлы с составом плана обмена. 
				КоличествоКаталоговВОбработке = ПолучитьКоличествоФайловКаталога(КаталогЗагрузки) + 1;
				ОбновитьКоличествоФайловКаталога(КаталогЗагрузки, КоличествоКаталоговВОбработке);
				ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект, Новый Структура("ЭтоРасширение, ИмяКаталога, КаталогЗагрузки", ЭтоРасширение, "", КаталогЗагрузки));
				НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + ИмяКаталога,"Content.xml",Истина); 

			Иначе
				// Файлы с предопределенными элементами.
				КоличествоКаталоговВОбработке = ПолучитьКоличествоФайловКаталога(КаталогЗагрузки) + 1;
				ОбновитьКоличествоФайловКаталога(КаталогЗагрузки, КоличествоКаталоговВОбработке);
				ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПоискаФайловВКаталоге", ЭтотОбъект, Новый Структура("ЭтоРасширение, ИмяКаталога, КаталогЗагрузки", ЭтоРасширение, "", КаталогЗагрузки));
				НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + ИмяКаталога,"Predefined.xml",Истина);
			КонецЕсли;
		Иначе
			НачатьПоискФайлов(ОповещениеРезультатПоиска, КаталогЗагрузки + РазделительПути + "src" + РазделительПути + ИмяКаталога,"*.mdo",Истина);
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ЗавершениеПоискаФайловВКаталоге(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	Если ЗагружаемыеКаталоги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	КоличествоКаталоговВОбработке = ПолучитьКоличествоФайловКаталога(ДополнительныеПараметры.КаталогЗагрузки); 
	КоличествоКаталоговВОбработке = КоличествоКаталоговВОбработке - 1;
	ОбновитьКоличествоФайловКаталога(ДополнительныеПараметры.КаталогЗагрузки, КоличествоКаталоговВОбработке);
	Если НайденныеФайлы.Количество() > 0 Тогда
		ОбработатьМассивФайлов(НайденныеФайлы, ДополнительныеПараметры.ЭтоРасширение, ДополнительныеПараметры.ИмяКаталога);
	КонецЕсли;
	Если ПолучитьКоличествоФайловКаталога(ДополнительныеПараметры.КаталогЗагрузки) > 0 Тогда
		Возврат;
	КонецЕсли;
	ЕстьНеобработанные = Ложь;
	Для Каждого СтрТаб Из ЗагружаемыеКаталоги Цикл
		Если СтрТаб.КоличествоФайлов > 0 Тогда
			ЕстьНеобработанные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьНеобработанные Тогда
		Возврат;
	КонецЕсли;
	ЗагружаемыеКаталоги.Очистить();
	ВыполнитьЗагрузкуСервер();
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 10, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьМассивФайлов(ВложенныеФайлы, ЭтоРасширение, ИмяКаталога)
	Если ВложенныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщенияШаблон = "";
	ОбработаноФайлов = 0;
	ОбщееКоличествоФайлов = ВложенныеФайлы.Количество();
	Если НЕ ПустаяСтрока(ИмяКаталога) Тогда
		ТекстСообщенияШаблон = НСтр("ru='Каталог %3. %1 файлов из %2'"); 
		ТекстСообщенияШаблон = СтрЗаменить(ТекстСообщенияШаблон, "%3", ИмяКаталога);
		ТекстСообщенияШаблон = СтрЗаменить(ТекстСообщенияШаблон, "%2", ОбщееКоличествоФайлов);
	КонецЕсли;
	Для Каждого ВложенныйФайл Из ВложенныеФайлы Цикл
		Если ВложенныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВложенныйФайл.ПолноеИмя), УникальныйИдентификатор);
		ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение", ВложенныйФайл.ПолноеИмя, АдресХранилища, ЭтоРасширение));
		ОбработаноФайлов = ОбработаноФайлов + 1;
		Если ЗначениеЗаполнено(ТекстСообщенияШаблон) Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщенияШаблон, "%1", ОбработаноФайлов);
			Состояние(ТекстСообщения, ОбработаноФайлов *100 / ОбщееКоличествоФайлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФайлыДляСервераНачало()
	АдресХранилищаРезультата = "";
	ФайлыДляОбработкиСервер.Очистить();
	Если Объект.ИсточникДанных = 0 Тогда
		ОповещениеРезультатПоиска = Новый ОписаниеОповещения("ЗавершениеПроверкиСуществованияФайла", ЭтотОбъект, 
			Новый Структура("ТекстСообщенияОбОшибке", НСтр("ru='В каталоге не найден файл Configuration.xml'")));
		НачатьПоискФайлов(ОповещениеРезультатПоиска, Объект.ИмяКаталогаЗагрузки,"Configuration.xml",Ложь);
	Иначе
		// Файл project уже указан искать его не надо.
		// Для поиска файлов используется каталог в котором находится project
		ФайлПроекта = Новый Файл(Объект.ИмяКаталогаЗагрузки);
		ИтерацияПодготовкиФайлов(ФайлПроекта.Путь, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПроверкиСуществованияФайла(НайденныеФайлы, ДополнительныеПараметры) Экспорт 
	Если НайденныеФайлы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДополнительныеПараметры.ТекстСообщенияОбОшибке);
		Возврат;
	КонецЕсли;
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(НайденныеФайлы[0].ПолноеИмя), УникальныйИдентификатор);
	ФайлыДляОбработкиСервер.Добавить(Новый Структура("ПолноеИмя, Хранение", НайденныеФайлы[0].ПолноеИмя, АдресХранилища));
	ИтерацияПодготовкиФайлов(Объект.ИмяКаталогаЗагрузки, Ложь);
	Если Объект.ЕстьРасширения И Объект.Расширения.Количество() > 0 Тогда
		Для Каждого СтрРасширение Из Объект.Расширения Цикл
			ИтерацияПодготовкиФайлов(СтрРасширение.ИмяКаталогаЗагрузки, Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если НЕ ДлительнаяОперация Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
		ИзменитьДоступностьЭлементовФормы(Истина);
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеЗагрузкиКонфигурации", 1, Истина);
	Иначе
		// Отображение прогресса.
		Процент = 0;
		Текст = "Выполняется загрузка структуры конфигурации. Пожалуйста, подождите...";
		Если ТипЗнч(ПрогрессЗадания) = Тип("Структура") Тогда
			Процент = ПрогрессЗадания.Процент;
			Текст = ПрогрессЗадания.Текст;
		КонецЕсли;  
		Элементы.ДекорацияПроцент.Заголовок = Строка(Процент) + "%";
		Элементы.НадписьОжидание.Заголовок = Текст;
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	ПрогрессЗадания = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
	Если ПрогрессЗадания = Неопределено Тогда
		ПрогрессЗадания = Новый Структура("Процент, Текст", 0, "");
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеЗагрузкиКонфигурации() 
	ПрогрессЗадания = Новый Структура("Процент, Текст", 0, "");
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	Если РезультатЗагрузки.Успешно Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации выполнена успешно'"));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка структуры конфигурации не выполнена'"));
	КонецЕсли;
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Основная;
	ИзменитьДоступностьЭлементовФормы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементовФормы(ФлагДоступность)
	Элементы.ФормаВыполнитьЗагрузку.Доступность = ФлагДоступность;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	ЗагружатьВКонфигурацию = (СпособЗагрузки = 1);
	Элементы.Конфигурация.Видимость = ЗагружатьВКонфигурацию;
	Элементы.ТолькоДобавлятьНовые.Видимость = ЗагружатьВКонфигурацию;
	Элементы.Расширения.Видимость = Объект.ЕстьРасширения;
	Элементы.ТолькоОбновитьПланыОбмена.Видимость = ЗагружатьВКонфигурацию;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуСервер()
	ИдентификаторЗадания = Неопределено;
	ДлительнаяОперация = Ложь;
	АдресХранилищаРезультата = "";
	// Преобразование помещенных файлов  
	ПомещенныеФайлыДляПередачи = Новый Массив;
	ИмяВременногоКаталогаФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СокрЛП(КаталогВременныхФайлов()) + "_conf_" + Строка(Новый  УникальныйИдентификатор));
	СоздатьКаталог(ИмяВременногоКаталогаФайлов);
	Для Каждого ПомФайл Из ФайлыДляОбработкиСервер Цикл
		ИмяФайлаСведений = ИмяВременногоКаталогаФайлов + Строка(Новый  УникальныйИдентификатор)+ ".xml";
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПомФайл.Значение.Хранение);
		ДвоичныеДанные.Записать(ИмяФайлаСведений);
	
		ПараметрыФайла = Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение");
		ЗаполнитьЗначенияСвойств(ПараметрыФайла, ПомФайл.Значение);
		ПараметрыФайла.Хранение = ИмяФайлаСведений;
		ПомещенныеФайлыДляПередачи.Добавить(ПараметрыФайла);
		УдалитьИзВременногоХранилища(ПомФайл.Значение.Хранение);
	КонецЦикла;
	ФайлыДляОбработкиСервер.Очистить();
	СтруктураПараметров = Новый Структура("СпособЗагрузки, ПомещенныеФайлы",СпособЗагрузки, ПомещенныеФайлыДляПередачи); 
	СтруктураПараметров.Вставить("Конфигурация", Объект.Конфигурация);
	СтруктураПараметров.Вставить("ИсточникДанных", Объект.ИсточникДанных);
	СтруктураПараметров.Вставить("ВариантЗагрузкиДвижений", Объект.ВариантЗагрузкиДвижений);
	СтруктураПараметров.Вставить("ТолькоОбновитьПланыОбмена", Объект.ТолькоОбновитьПланыОбмена);
	СтруктураПараметров.Вставить("ТолькоДобавлятьНовые", Объект.ТолькоДобавлятьНовые);
	СтруктураПараметров.Вставить("ЕстьРасширения", Объект.ЕстьРасширения И Объект.Расширения.Количество() > 0);
	СтруктураПараметров.Вставить("ИмяКаталогаЗагрузки", Объект.ИмяКаталогаЗагрузки);
	Если СтруктураПараметров.ЕстьРасширения Тогда
		СтруктураПараметров.Вставить("КаталогиРасширений", Объект.Расширения.Выгрузить().ВыгрузитьКолонку("ИмяКаталогаЗагрузки"));
	КонецЕсли;
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка структуры метаданных из каталога'");
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне("Обработки.ЗагрузкаСтруктурыКонфигурацииИзФайловXML.ВыполнитьЗагрузкуМетаданных",
			СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		ДлительнаяОперация = Истина;
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При загрузке структуры конфигурации произошла ошибка'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораКаталога(Знач ВыбранныеФайлы, Знач ДопПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Или НЕ ДопПараметры.Свойство("ВыборРасширения") Тогда
		Возврат;
	КонецЕсли;
	Если ДопПараметры.ВыборРасширения Тогда
		НомСтроки = Элементы.Расширения.ТекущиеДанные.НомерСтроки;
		Объект.Расширения[НомСтроки - 1].ИмяКаталогаЗагрузки = ВыбранныеФайлы[0];
	Иначе
		Объект.ИмяКаталогаЗагрузки = ВыбранныеФайлы[0];
	КонецЕсли;
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоФайловКаталога(КаталогЗагрузки, КоличествоФайлов)
	СтрТаб = ЗагружаемыеКаталоги.НайтиСтроки(Новый Структура("КаталогЗагрузки", КаталогЗагрузки));
	КоличествоБыло = 0;
	Если СтрТаб.Количество() = 0 Тогда
		ТекСтрока = ЗагружаемыеКаталоги.Добавить();
		ТекСтрока.КаталогЗагрузки = КаталогЗагрузки;
	Иначе
		ТекСтрока = СтрТаб[0];
		КоличествоБыло = СтрТаб[0].КоличествоФайлов;
	КонецЕсли;
	ТекСтрока.КоличествоФайлов = КоличествоФайлов;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоФайловКаталога(КаталогЗагрузки)
	СтрТаб = ЗагружаемыеКаталоги.НайтиСтроки(Новый Структура("КаталогЗагрузки", КаталогЗагрузки));
	Если СтрТаб.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат СтрТаб[0].КоличествоФайлов;
	КонецЕсли;
КонецФункции



#КонецОбласти