#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);
	ЕстьОтборПоВладельцу = Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец");
	Если ЕстьОтборПоВладельцу Тогда
		Элементы.ТекущаяРегистрация.Видимость = Ложь;
	Иначе
		Элементы.ТекущаяРегистрация.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец",
			ТекущаяРегистрация, 
			ВидСравненияКомпоновкиДанных.Равно, НСтр("ru='Регистрация'"), Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	Если Элементы.Найти("ФормаОбщаяКомандаИнформацияОбОбработчиках") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаИнформацияОбОбработчиках.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяРегистрацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец",
		ТекущаяРегистрация, 
		ВидСравненияКомпоновкиДанных.Равно, НСтр("ru='Регистрация'"), Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
КонецПроцедуры
#КонецОбласти

