#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("парКонвертация") Тогда
		Объект.Конвертация = Параметры.парКонвертация;
	КонецЕсли;
	Если Константы.СовместнаяРабота.Получить() Тогда
		Элементы.ПодменюСохранитьМодуль.Видимость = Истина;
		Элементы.ФормаВыгрузитьБезСовместнойРаботы.Видимость = Ложь;
	Иначе
		Элементы.ПодменюСохранитьМодуль.Видимость = Ложь;
		Элементы.ФормаВыгрузитьБезСовместнойРаботы.Видимость = Истина;
	КонецЕсли;
    ОбновитьТекстКнопкиВыгрузки(); 
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	ОбновитьТекстКнопкиВыгрузки();
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	Объект.ПоСостояниюХранилища = Ложь;
	ВыгрузитьМодулиКлиент();
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить_Хранилище(Команда)
	Объект.ПоСостояниюХранилища = Истина;
	ВыгрузитьМодулиКлиент();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВыгрузитьМодулиКлиент()
	Если НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указана конвертация'"));
		Возврат;
	КонецЕсли;
	ИменаФайловДляСохранения = Новый Структура;
	НастройкиВыгрузки = Новый Структура;
	Модули = ВыгрузитьМодулиСервер(ИменаФайловДляСохранения, НастройкиВыгрузки);
	Если Модули.Количество() = 1 И ИменаФайловДляСохранения.Количество() = 0 Тогда
		ТХ = Модули.МенеджерОбменаЧерезУниверсальныйФормат;
		КонвертацияДанныхXDTOКлиент.ВывестиТекстДляИспользования(ТХ);
	Иначе
		КонвертацияДанныхXDTOКлиент.СохранитьМодулиКонвертацииВФайлы(Модули, НастройкиВыгрузки, ИменаФайловДляСохранения);
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ВыгрузитьМодулиСервер(ИменаФайловДляСохранения, НастройкиВыгрузки) 
	Обработки.ВыгрузкаМодуля.ПодготовитьНастройкиВыгрузкиМодулей(Объект.Конвертация, ИменаФайловДляСохранения, НастройкиВыгрузки);
	
	ОбработкаОбъект = Обработки.ВыгрузкаМодуля.Создать();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Результат = ОбработкаОбъект.ВыполнитьВыгрузкуМодулей();
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбновитьТекстКнопкиВыгрузки()
	Результат = Обработки.ВыгрузкаМодуля.ПолучитьТекстЗаголовкаКомандыВыгрузкиМодуля(Объект.Конвертация);
	Элементы.ФормаВыгрузитьБезСовместнойРаботы.Заголовок = Результат.ЗаголовокКоманды;
	Элементы.ПодменюСохранитьМодуль.Заголовок = Результат.ЗаголовокКоманды;
	Элементы.ПодменюСохранитьМодуль.Подсказка = Результат.Подсказка;
	Элементы.ДекорацияПодсказка.Заголовок = Результат.Подсказка;
КонецПроцедуры


#КонецОбласти
